{
  "id": "chapter_11",
  "content": "\nChapter 11 \nSecure Network Architecture and \nComponents \nTHE CISSP TOPICS COVERED IN THIS CHAPTER \nINCLUDE: \nDomain 4.0: Communication and Network Security \n4.1 Apply secure design principles in network  architectures \n4.1.1 Open System Interconnection (OSI) and \nTransmission Control Protocol/Internet Protocol \n(TCP/IP) models \n4.1.2 Internet Protocol (IP) version 4 and 6 (IPv6) \n(e.g., unicast, broadcast, multicast, anycast) \n4.1.3 Secure protocols (e.g., Internet Protocol Security \n(IPSec), Secure Shell (SSH), Secure Sockets Layer \n(SSL)/Transport Layer Security (TLS)) \n4.1.4 Implications of multilayer protocols \n4.1.5 Converged protocols (e.g., Internet Small \nComputer Systems Interface (iSCSI), Voice over \nInternet Protocol (VoIP), InfiniBand over Ethernet, \nCompute Express Link) \n4.1.6 Transport architecture (e.g., topology,  data/control/management plane, cut-through/store-  and-forward) \n4.1.8 Traffic flows (e.g., north-south, east-west) \n4.1.9 Physical segmentation (e.g., in-band, out-of-  band, air-gapped) \n4.1.10 Logical segmentation (e.g., virtual local area  networks (VLANs), virtual private networks (VPNs),  virtual routing and forwarding, virtual domain) \n4.1.11 Micro-segmentation (e.g., network  overlays/encapsulation; distributed firewalls, routers,  intrusion detection system (IDS)/intrusion prevention  system (IPS), zero trust) \n4.1.12 Edge networks (e.g., ingress/egress, peering) \n4.1.13 Wireless networks (e.g., Bluetooth, Wi-Fi, \nZigbee, satellite) \n4.1.14 Cellular/mobile networks (e.g., 4G, 5G) \n4.1.15 Content distribution networks (CDN) \n4.1.16 Software defined networks (SDN) (e.g.,  application programming interface (API), Software- \nDefined Wide-Area Network, network functions  virtualization) \n4.1.17 Virtual Private Cloud (VPC) \n4.2 Secure network components \n4.2.1 Operation of infrastructure (e.g., redundant  power, warranty, support) \n4.2.2 Transmission media (e.g., physical security of  media, signal propagation quality) \n4.2.3 Network Access Control (NAC) systems (e.g.,  physical, and virtual solutions) \n4.2.4 Endpoint security (e.g., host-based) \nDomain 7.0 Security Operations \n7.7 Operate and maintain detection and preventative  measures \n7.7.1 Firewalls (e.g., next generation, web application,  network) \nThis chapter discusses the Open Systems Interconnection (OSI)  model as a guiding principle in networking, cabling, wireless  connectivity, Transmission Control Protocol/Internet Protocol \n(TCP/IP) and related protocols, networking devices, and firewalls. To  properly implement secure design principles in network  architectures, you must fully understand computer communications  technologies. \nThe Communication and Network Security domain deals with topics  related to network components (i.e., network devices and protocols) \n—specifically, how they function and how they are relevant to  security. This domain is discussed in this chapter and in Chapter 12, \n“Secure Communications and Network Attacks.” Be sure to read and  study the materials in both chapters to ensure complete coverage of  the essential material. \nOSI Model \nCommunications between computers over networks are made  possible by protocols. A protocol is a set of rules and restrictions that  define how data is transmitted over a network medium (e.g., twisted-  pair cable, fiber optics, and wireless transmission). The International \nOrganization for Standardization (ISO) developed the Open Systems \nInterconnection (OSI) Reference Model for protocols in the late \n1970s. \nHistory of the OSI Model \nThe OSI Reference Model (more commonly called the OSI model )  wasn't the first or only attempt to establish a common  communications standard. In fact, the most widely used protocol  today, TCP/IP (which is based on the Defense Advanced Research \nProjects Agency [DARPA] model, also known now as the TCP/IP  model) was developed in the early 1970s. The OSI model was not  developed until the late 1970s (and not formally published as  standard ISO 7498 until 1984). \nThe OSI model was developed to establish a common  communication structure or standard for all computer systems. The \nOSI model serves as a conceptual framework, or theoretical model,  for how protocols should function in an ideal world on ideal  hardware. The OSI model was developed by ISO to facilitate  interoperability between different vendors' systems. The OSI model  has become a common reference point. \nOSI Functionality \nThe OSI model divides networking tasks into seven layers. Each layer  is responsible for performing specific tasks or operations with the  ultimate goal of supporting data exchange (i.e., network  communication) between two computers. They are referred to by  either their name or their layer number ( Figure 11.1). The layers are  ordered specifically to indicate how information flows through the  various levels of communication. Each layer communicates directly  with the layer above it as well as the layer below it. \nFIGURE 11.1 The OSI model \nEncapsulation/Deencapsulation \nThe OSI model represents a protocol stack, which is a layered  collection of multiple protocols (i.e., a multilayered protocol). \nCommunication between protocol layers occurs through  encapsulation and deencapsulation. Encapsulation is the addition of  a header, and possibly a footer, to the data received by each layer  from the layer above before it's handed off to the layer below. As the  message is encapsulated at each layer, the previous layer's header  and payload become the payload of the current layer. The inverse  action occurring as data moves up through the OSI model layers  from Physical to Application is known as deencapsulation . The  encapsulation/deencapsulation process is as follows: \nThe term decapsulation is sometimes used, but the  term used by the Internet Engineering Task Force (IETF) is  deencapsulation. \n1. The Application Layer receives data from software. The \nApplication Layer encapsulates the message by adding  information to it. Information is usually added only at the  beginning of the message (called a header); however, some  layers also add material at the end of the message (called a  footer), as shown in Figure 11.2. The Application Layer passes  the encapsulated message to the Presentation Layer. \nFIGURE 11.2 OSI model encapsulation \n2. The process of passing the message down and adding layer-  specific information continues until the message reaches the \nPhysical Layer. \n3. At the Physical Layer, the message is converted into signals that  represent bits and is transmitted over the physical connection. \n4. The receiving computer captures the bits from the physical  connection, re-creates the message in the Physical Layer, and  sends the message up to the Data Link Layer. \n5. The Data Link Layer strips its information and sends the  message up to the Network Layer. \n6. This process of deencapsulation is performed until the message  reaches the Application Layer. \n7. When the message reaches the Application Layer, the data in the  message is sent to the intended software recipient. \nThe information removed by each layer contains instructions,  checksums, and so on that can be understood only by the peer layer  that originally added or created the information (see Figure 11.3). \nThis is known as peer-layer communication . \nFIGURE 11.3 The OSI model peer layer logical channels \nThe data sent into the protocol stack at the Application Layer (Layer \n7) is encapsulated into a network container. The protocol data unit \n(PDU) is then passed down to the Presentation Layer (Layer 6),  which in turn passes it down to the Session Layer (Layer 5). This  network container is known as the PDU at Layers 7, 6, and 5. Once  the network container reaches the Transport Layer (Layer 4) it is  then called a segment (TCP) or a datagram (User Datagram Protocol \n[UDP]). In the Network Layer (Layer 3), it is called a packet . In the \nData Link Layer (Layer 2), it is called a frame . In the Physical Layer \n(Layer 1), the network container is converted into bits for  transmission over the physical connection medium. Figure 11.4  shows the label applied to the network container at each layer. \nFIGURE 11.4 OSI model layer-based network container names \nOSI Layers \nUnderstanding the functions and responsibilities of each layer of the \nOSI model will help you understand how network communications  function, how attacks can be perpetrated, and how security can be  implemented to protect network communications. \nRemember the OSI \nMnemonics can help you remember the layers of the OSI model  in order: Application, Presentation, Session, Transport, Network, \nData Link, and Physical (top to bottom). Examples include: \n“Please Do Not Teach Surly People Acronyms” (Physical Layer up  to the Application Layer) and “All Presidents Since Truman \nNever Did Pot” (Application Layer down to Physical Layer). \nApplication Layer \nThe Application Layer (Layer 7) is responsible for interfacing user  applications, network services, or the operating system with the  protocol stack. The software application is not located within this  layer; rather, the protocols and services required to transmit files,  exchange messages, connect to remote terminals, and so on are  found here. \nPresentation Layer \nThe Presentation Layer (Layer 6) is responsible for transforming  data into a format that any system following the OSI model can  understand. It imposes common or standardized structure and  formatting rules onto the data. The Presentation Layer is also  responsible for encryption and compression. \nOn TCP/IP networks, there is no actual Presentation Layer. There is  no current need to reformat data for network transport, and  protocol-stack compression only occurs in concert with some  encryption operations. Encryption in relation to network  communication can occur in at least five locations: \nPre-network encryption, where the software encrypts prior to  sending the data into the Application Layer \nTransport Layer encryption typically performed by TLS \nVPN encryption, which can occur at Layer 2, 3, or 4 depending  on the VPN technology in use (such as L2TP, IPSec, OpenVPN \n[i.e., TLS VPN], respectively) \nWireless encryption at the Data Link Layer \nBulk encryption at the Physical Layer (provided by a device  external to the network interface card [NIC]) \nMany technologies provide encrypted connectivity to  individual services or entire systems, such as remote desktop  solutions and HTML5. Some entities label these capabilities as \nVPNs, but they are not VPNs. HTML5 is the encoding language  for HTML documents, which is then interpreted by a browser. \nWhile it does support capabilities that are similar to a VPN, it is  not a true VPN. \nSession Layer \nThe Session Layer (Layer 5) is responsible for establishing,  maintaining, and terminating communication sessions between two  computers. It manages dialog discipline or dialog control (simplex,  half-duplex, full-duplex), establishes checkpoints for grouping and  recovery, and retransmits PDUs that have failed or been lost since  the last verified checkpoint. \nOn TCP/IP networks, there is no actual Session Layer. Session Layer  functions are handled by TCP at the Transport Layer or not at all  when UDP is in use. \nCommunication sessions can operate in one of three  different discipline or control modes: \nSimplex: One-way communication (as a sender or receiver,  but not both) \nHalf-Duplex: Two-way communication, but only one  direction can send or receive data at a time \nFull-Duplex: Two-way communication, in which data can be  sent and received in both directions simultaneously \nTransport Layer \nThe Transport Layer (Layer 4) is responsible for managing the  integrity of a connection and controlling the session. The Transport \nLayer establishes communications between nodes (also known as  devices) and defines the rules of a session. Session rules specify how  much data each segment can contain, how to verify message  integrity, and how to determine whether data has been lost. Session  rules are established through a handshaking process. (Please see the  section “Transport Layer Protocols,” later in this chapter, for the  discussion of the SYN/ACK three-way handshake of TCP.) \nThe Transport Layer establishes a logical connection between two  devices and provides end-to-end transport services to support data  delivery. This layer includes mechanisms for segmentation,  sequencing, error checking, controlling the flow of data, error  correction, multiplexing, and network service optimization. The  following protocols operate within the Transport Layer: \nTransmission Control Protocol (TCP) \nUser Datagram Protocol (UDP) \nTransport Layer Security (TLS) \nSince the actual TCP/IP protocol stack does not  functionally have a presentation or session layer, as defined by  the OSI model, some of the features of those “missing” layers are  handled in the Transport Layer by TCP. \nNetwork Layer \nThe Network Layer (Layer 3) is responsible for logical addressing  and performing routing. Logical addressing occurs when an address  is assigned and used by software or a protocol rather than being  provided and controlled by hardware. The Network Layer's packet  header includes the source and destination IP addresses. \nThe Network Layer is responsible for providing routing or delivery  guidance, but it is not responsible for verifying guaranteed delivery. \nThe Network Layer also manages error detection and node data  traffic (i.e., traffic control). \nNon-IP, or Legacy, Protocols \nNon-IP protocols are protocols that serve as an alternative to IP  at the OSI Network Layer (3). With the dominance and success of \nTCP/IP, non-IP protocols (i.e., legacy protocols ) have become  the purview of special-purpose networks, such as IPX/SPX, \nAppleTalk, and NetBEUI. Because non-IP protocols are rare,  most firewalls are unable to perform packet header, address, or  payload content filtering on those protocols. Also, non-IP  protocols can be encapsulated in IP to be communicated across  the Internet. Thus, legacy protocols need to be blocked. \nA router is the primary network hardware device that functions at \nLayer 3. Routers determine the best logical path for the transmission  of packets based on speed, hops, preference, and so on. Routers use  the destination IP address to guide the transmission of packets. A  routed protocol is a Network Layer protocol whose communications  are controlled by routers and their routing tables. Routers maintain a  routing table that includes information about known subnets and the  pathway to reach those subnets. The routing table information is  used to direct the traffic of a routed protocol to its destination. \nRouting Protocols \nThere are two broad categories of interior routing protocols :  distance vector and link state. Distance vector routing protocols  maintain a list of destination networks along with metrics of  direction and distance as measured in hops (in other words, the  number of routers to cross to reach the destination). Link state  routing protocols gather router characteristics, such as speed,  latency, error rates, and actual monetary cost for use. This  information is tabulated to make a next hop routing decision. \nCommon examples of distance vector routing protocols are \nRouting Information Protocol (RIP) and Interior Gateway \nRouting Protocol (IGRP) . Common examples of link state routing  protocols are Open Shortest Path First (OSPF) and Intermediate \nSystem to Intermediate System (IS-IS) . There is also a  commonly used advanced distance vector routing protocol that  replaces IGRP: Enhanced Interior Gateway Routing Protocol \n(EIGRP) . \nThere is one main category of exterior routing protocols that is  called path vector. Path vector routing protocols make next hop  decisions based on the entire remaining path (i.e., vector) to the  destination. This is distinct from interior routing protocols, which  make next hop decisions based solely on information related to  that next immediate hop. Interior routing protocols are myopic,  whereas exterior routing protocols are far-sighted. The primary  example of a path vector protocol is Border Gateway Protocol \n(BGP) . BGP maintains a routing table of the autonomous systems \n(AS) across the Internet. An autonomous system (AS) is a  collection of IP networks and routers under the control of a single  organization that presents a common routing policy to the \nInternet. \nRoute security can be enforced by configuring routers to accept  route updates only from other authenticated routers. \nAdministrative access to a router should be limited physically and  logically to only specific authorized entities. It is also important  to keep router firmware updated. \nData Link Layer \nThe Data Link Layer (Layer 2) is responsible for formatting the  packet for transmission. The proper format is determined by the  hardware, topology, and technology of the network, such as Ethernet \n(IEEE 802.3). \nPart of the processing performed on the network container within  the Data Link Layer includes adding the source and destination  hardware addresses to the frame. The hardware address is the \nMedia Access Control (MAC) address , which is a 6-byte (48-bit)  binary address written in hexadecimal notation (for example, 00-13- \n02-1F-58-F5). This address is also known as the physical address ,  the NIC address , and the Ethernet address . The first 3 bytes (24 bits)  of the address is the organizationally unique identifier (OUI) , which  denotes the vendor or manufacturer of the physical network  interface. OUIs are registered with the Institute of Electrical and \nElectronics Engineers (IEEE), which controls their issuance. The \nOUI can be used to discover the manufacturer of a NIC through the \nIEEE website at http://standards.ieee.org/products-  services/regauth/index.html . The last 3 bytes (24 bits) of the MAC  address represent a unique number assigned to that interface by the  manufacturer. Some manufacturers will encode information into  these final 24 bits, which may represent the make, model, and  production run along with a unique value. Thus, some devices (such  as mobile devices, IoT equipment, and embedded systems) that use a  unique NIC can be identified by their MAC addresses. \nAmong the protocols at the Data Link Layer (Layer 2) of the OSI  model, you should be familiar with Address Resolution Protocol \n(ARP). See the section “ARP Concerns” later in this chapter. \nNetwork hardware devices that function at Layer 2, the Data Link \nLayer, are switches and bridges. These devices support MAC-based  traffic routing. Switches receive a frame on one port and send it out  another port based on the destination's MAC address. MAC address  destinations are used to determine whether a frame is transferred  over the bridge from one network segment to another. \nPhysical Layer \nThe Physical Layer (Layer 1) converts a frame into bits for  transmission over the physical connection medium, and vice versa  for receiving communications. \nNetwork hardware devices that function at Layer 1, the Physical \nLayer, are NICs, hubs, repeaters, concentrators, and amplifiers. \nThese devices perform hardware-based signal operations, such as  sending a signal from one connection port out on all other ports (a  hub) or amplifying the signal to support greater transmission  distances (a repeater). \nTCP/IP Model \nThe TCP/IP model (also called the DARPA model or the DOD model )  consists of only four layers, as opposed to the OSI reference model's  seven. The four layers of the TCP/IP model are Application (also  known as Process ), Transport (also known as Host-to-Host ), \nInternet (sometimes Internetworking ), and Link (although Network \nInterface and sometimes Network Access are also used). Figure 11.5  shows how they compare to the seven layers of the OSI model. The \nTCP/IP protocol suite was developed before the OSI Reference \nModel was created. \nFIGURE 11.5 Comparing the OSI model with the TCP/IP model \nSince the TCP/IP model layer names and the OSI  model layer names can be used interchangeably, it is important to  know which model is being addressed in various contexts. Unless  informed otherwise, always assume that the OSI model provides  the basis for discussion because it's the most widely used network  reference model. \nThe TCP/IP model was derived directly from the TCP/IP protocol  suite or stack comprising hundreds of individual protocols. TCP/IP is  a platform-independent protocol based on open standards. TCP/IP  can be found in just about every available operating system, but it  consumes a significant amount of resources and is relatively easy to  hack, because it was originally designed for ease of use and  interoperability rather than for security. \nTCP/IP's vulnerabilities are numerous. Improperly implemented \nTCP/IP stacks in various operating systems are vulnerable to buffer  overflows, SYN flood attacks, various denial-of-service (DoS) attacks,  fragment attacks, oversized packet attacks, spoofing attacks,  adversary-in-the-middle attacks (AitM), hijack attacks, and coding  error attacks. \nTCP/IP (as well as most protocols) is also subject to passive attacks  via monitoring or sniffing. Eavesdropping and other attacks are  discussed in more detail at the end of Chapter 12. \nAnalyzing Network Traffic \nNetwork communications analysis is often an essential function in  managing a network. It can be useful in tracking down malicious  communications, detecting errors, or resolving transmission  problems. However, network eavesdropping may also be used to  violate communication confidentiality and/or serve as the  information-gathering phase of a subsequent attack. \nA protocol analyzer is a tool used to examine the contents of  network traffic. A protocol analyzer can be a dedicated hardware  device or software installed on a typical host system. A protocol  analyzer is a frame/packet-capturing tool that can collect network  traffic and store it in memory or on a storage device. Once a frame or  packet is captured, it can be analyzed either with complex automated  tools and scripts or manually. A protocol analyzer may also be called  a sniffer , network evaluator , network analyzer , traffic monitor , or  packet-capturing utility . A sniffer is generally a packet- or frame-  capturing tool, whereas a protocol analyzer is able to decode and  interpret packet/frame contents. \nA protocol analyzer usually places the NIC into promiscuous mode to  see and capture all Ethernet frames on the local network segment. In  promiscuous mode, the NIC ignores the destination MAC addresses  of Ethernet frames and collects each frame that reaches the interface. \nThe protocol analyzer can examine individual frames down to the  binary level. Most analyzers or sniffers automatically parse out the  contents of the header into an expandable outline form. Any  configuration or setting can be easily seen in the header details. The  payload of packets is often displayed in both hexadecimal and ASCII. \nProtocol analyzers typically offer both capture filters and display  filters . A capture filter is a set of rules to govern which frames are  saved into the capture file or buffer and which are discarded. A  display filter is used to show only those frames from the packet file or  buffer that match your requirements. \nProtocol analyzers vary from simple raw frame/packet-capturing  tools to fully automated analysis engines. There are both open source \n(such as Wireshark) and commercial (such as Omnipeek, \nNetWitness, and NetScout) options. \nCommon Application Layer Protocols \nIn the Application Layer of the OSI model reside numerous  application- or service-specific protocols: \nTelnet , TCP Port 23 This is a terminal emulation network  application that supports remote connectivity for executing  commands and running applications but does not support the  transfer of files. Telnet should not be used; replace it with SSH. \nFile Transfer Protocol (FTP) , TCP Ports 20 (Active Mode \nData Connection)/Ephemeral (Passive Mode Data \nConnection) and 21 (Control Connection) This is a network  application that supports an exchange of files that requires  anonymous or specific authentication. FTP should not be used;  replace it with SFTP or FTPS. \nTrivial File Transfer Protocol (TFTP) , UDP Port 69 This is a  network application that supports an exchange of files that does not  require authentication. Used to host network device configuration  files and can support multicasting. TFTP should not be used. \nSimple Mail Transfer Protocol (SMTP), TCP Port 25 This  is a protocol used to transmit email messages from a client to an  email server and from one email server to another. Only use if  encrypted with TLS to create SMTPS (i.e., STARTTLS, explicit TLS,  or opportunistic TLS) over TCP port 587 or implicit SMTPS over TCP  port 465. \nPost Office Protocol (POP3) , TCP Port 110 This is a protocol  used to pull email messages from an inbox on an email server down  to an email client (aka client archiving). Only use if encrypted with \nTLS to create POPS on TCP port 995. \nInternet Message Access Protocol (IMAP4), TCP Port 143 \nThis is a protocol used to pull email messages from an inbox on an  email server down to an email client. IMAP offers the ability to  retrieve only headers from an email server as well as to delete  messages directly off the email server (i.e., server archiving). Only  use if encrypted with TLS to create IMAPS on TCP port 993. \nDynamic Host Configuration Protocol (DHCP), UDP Ports \n67 (server) and 68 (client) DHCP provides for centralized  control of TCP/IP configuration settings assigned to systems upon  bootup. \nHypertext Transfer Protocol (HTTP), TCP Port 80 This is  the protocol used to transmit web page elements from a web server  to web browsers in cleartext. \nHypertext Transfer Protocol Secure (HTTPS) TCP Port \n443 This is the TLS-encrypted version of HTTP. (HTTPS with TLS  does support use of TCP port 80—but only for server-to-server  communications.) \nLine Printer Daemon (LPD), TCP Port 515 This is a network  service that is used to spool print jobs and send print jobs to printers. \nConsider enclosing in a VPN for use. \nX Window, TCP Ports 6000–6063 This is a GUI API for  command-line operating systems. Consider enclosing it in a VPN for  use. \nNetwork File System (NFS), TCP Port 2049 This is a  network service used to support file sharing between dissimilar  systems. Consider enclosing it in a VPN for use. \nSimple Network Management Protocol (SNMP), UDP Port \n161 (UDP Port 162 for Trap Messages) This is a network  service used to collect network health and status information from a  central monitoring station. Use the secure SNMPv3 only. \nSNMPv3 \nSimple Network Management Protocol (SNMP) is a standard  network-management protocol supported by most network  devices and TCP/IP-compliant hosts. These include routers,  switches, WAPs, firewalls, VPNs, printers, and so on. From a  management console, you can use SNMP to interact with various  network devices to obtain status information, performance data,  statistics, and configuration details. Some devices support the  modification of configuration settings through SNMP. \nEarly versions of SNMP relied on plaintext transmission of  community strings as authentication. Communities are named  collections of network devices. The original default community  names were public and private. The latest version of SNMP  allows for encrypted communications, as well as robust  authentication protection. \nUDP port 161 is used by the SNMP agent (that is, the network  device) to receive requests, and UDP port 162 is used by the  management console to receive responses and notifications (also  known as trap messages ). Trap messages inform the  management console when an event or threshold violation occurs  on a monitored system. \nTransport Layer Protocols \nWhen a connection is established via the Transport Layer, it is done  using ports. Since port numbers are 16-digit binary numbers, the  total number of ports is 2^16, or 65,536, numbered from 0 through \n65,535. Ports allow a single IP address to support multiple  simultaneous communications, each using a different port number \n(i.e., multiplexing over IP). The combination of an IP address and a  port number is known as a socket . \nThe first 1,024 of these ports (0–1,023) are called the well-known  ports or the service ports . These ports are reserved for use  exclusively by servers. \nPorts 1,024 to 49,151 are known as the registered software ports . \nThese are ports that have one or more networking software products  specifically registered with the Internet Assigned Numbers Authority \n(IANA) at http://iana.org . \nPorts 49,152 to 65,535 are known as random, dynamic, or  ephemeral ports because they are often used randomly and  temporarily by clients as source ports. However, most operating  systems allow for any port from 1,024 to be used as a dynamic client  source port as long as it is not already in use on that local system. \nThe two primary Transport Layer protocols of TCP/IP are TCP and \nUDP. Transmission Control Protocol (TCP) is a full-duplex  connection-oriented protocol, whereas User Datagram Protocol \n(UDP) is a simplex connectionless protocol. \nTransmission Control Protocol (TCP) supports full-duplex  communications, is connection-oriented, and employs reliable  sessions. TCP is connection-oriented because it employs a handshake  process between two systems to establish a communication session. \nThe three-way handshake process ( Figure 11.6) is as follows: \n1. The client sends a SYN (synchronize) flagged packet to the  server. \n2. The server responds with a SYN/ACK (synchronize and  acknowledge) flagged packet back to the client. \n3. The client responds with an ACK (acknowledge) flagged packet  back to the server. \nFIGURE 11.6 The TCP three-way handshake \nWhen a communication session is complete, there are two methods  to disconnect the TCP session. First, and most common, is the use of \nFIN (finish) flagged packets to gracefully initiate session shutdown. \nSecond is the use of an RST (reset) flagged packet, which causes an  immediate and abrupt session termination. \nTCP should be employed when the delivery of data is required. In the  event that all packets of a transmission window were not received, no  acknowledgment is sent. After a timeout period, the sender will  resend the entire transmission window set of packets again. TCP  guarantees delivery because it will continue to resend any  unacknowledged window of segments until it receives an  acknowledgment, it receives an RST, the local application terminates  the network communication attempts, or power is removed from the  system. \nUser Datagram Protocol (UDP) also operates at Layer 4 (the \nTransport Layer) of the OSI model. It is a connectionless “best-  effort” communications protocol. It offers no standard error  detection (other than an optional packet checksum) or correction,  does not use sequencing, does not use flow control mechanisms, does  not use a preestablished session, and is considered unreliable. UDP  has very low overhead and thus can transmit data quickly. However, \nUDP should be used only when the delivery of data is not essential. \nUDP is often employed by real-time or streaming communications  for audio and/or video. \nDomain Name System \nThere are three numbering and addressing concepts you should be  familiar with: \nDomain Name The domain name or computer name is a \n“temporary” human-friendly convention assigned to an IP address. \nIP Address The IP address is a “temporary” logical address  assigned over or onto the MAC address. \nMAC Address The MAC address, or hardware address, is a \n“permanent” physical address. \n“Permanent” and “Temporary” Addresses \nThe reason these two adjectives are within quotation marks is  that they are not completely accurate. MAC addresses are  designed to be permanent physical addresses but often can be  changed. When the NIC supports the change, the change occurs  on the hardware. When the OS supports the change, the change is  only in memory, but it looks like a hardware change to all other  network entities (this is known as MAC spoofing or MAC cloning  if duplicating another device's MAC address). \nAn IP address is temporary because it is a logical address and can  be changed at any time, either by DHCP or by an administrator. \nHowever, there are instances where systems are statically  assigned an IP address. Likewise, computer names or DNS names  might appear permanent, but they are logical and thus able to be  modified by an administrator. \nDomain Name System (DNS) resolves a human-friendly domain  name into its IP address equivalent. Then, Address Resolution \nProtocol (ARP) (see the later section “ARP Concerns”) resolves the IP  address into its MAC address equivalent. It is also possible to resolve  an IP address into a domain name via a DNS reverse lookup if a PTR \n(i.e., pointer) resource record is defined in the domain's zone file. IP  addresses are assigned either statically, or dynamically via DHCP. \nDNS is the hierarchical naming scheme used in both public and  private networks. DNS links IP addresses and human-friendly fully  qualified domain names (FQDNs) together. An FQDN consists of  three main parts: \nTop-level domain (TLD) —The com in www.google.com \nRegistered domain name —The google in www.google.com \nSubdomain(s) or hostname —The www in www.google.com \nThe TLD can be any number of official options, including six of the  original seven TLDs— com , org , edu , mil , gov , and net —as well as many  newer ones, such as info , museum , telephone , mobi , biz , and so on. \nThere are also two-letter country variations known as country codes . \n(See www.iana.org/domains/root/db for details on current TLDs and  country codes.) The seventh original TLD was int , for international,  which was replaced by the two-letter country codes. \nThe registered domain name must be officially registered with one of  any number of approved domain registrars, such as Network \nSolutions ( http://networksolutions.com ), Domains.com , or IONOS \n( http://ionos.com ). \nThe far-left section of an FQDN can be either a single hostname,  such as www. , ftp. , blog. , images. , and so on, or a multi-sectioned  subdomain designation, such as  server1.group3.bldg5.myexamplecompany.com . \nThe total length of an FQDN can't exceed 253 characters (including  the dots). Any single section can't exceed 63 characters. FQDNs can  only contain letters, numbers, hyphens, and periods. Though not  typically shown, there is a dot to the right of the TLD, which  represents the root of the entire DNS namespace. \nEvery registered domain name has an assigned authoritative name  server. The primary authoritative name server hosts the original  editable zone file for the domain. Secondary authoritative name  servers can be used to host read-only copies of the zone file. A zone  file is the collection of resource records or details about the specific  domain. There are dozens of possible resource records (see  www.iana.org/assignments/dns-parameters/dns-parameters.xhtml ),  such as A records linking an FQDN to an IPv4 address and AAAA  records linking an FQDN to an IPv6 address. The use of AAAA is  sometimes referred to as DNSv6. \nSome of the more commonly used resource records are: \nA: Address record; links a FQDN to an IPv4 address \nAAAA: Address record; links a FQDN to an IPv6 address \nPTR: Pointer record; links an IPv4 or IPv6 address to a FQDN \nCNAME: Canonical name or alias record; links a FQDN to  another FQDN \nMX: Mail exchange record; identifies SMTP email servers for a  domain \nNS: Name server record; identifies the DNS servers for a domain \nSOA: Start of authority record; identifies the primary  authoritative DNS server, the responsible email address, serial  number (of the zone file), and time intervals of refresh, retry,  expire, and default TTL \nOriginally, DNS was handled by a static local file known as the hosts  file. The hosts file contains hard-coded references for domain names  and their associated IP addresses. This file still exists on most \nTCP/IP capable computers, but a dynamic DNS query system has  mostly replaced it. Administrators or threat actors can add content to  the hosts file. \nWhen client software points to an FQDN, the resolution process first  checks the local DNS cache to see whether the answer is already  known. The DNS cache consists of the preloaded local hosts file plus  any DNS query results (that haven't timed out). If the needed answer  isn't in the cache, a DNS query is sent to the DNS server indicated in  the local IP configuration. \nDNS operates over TCP and UDP port 53. TCP port 53 is used for  zone transfers. These are zone file exchanges between DNS servers,  for special manual queries, or when a response exceeds 512 bytes. \nUDP port 53 is used for most typical DNS queries. \nDomain Name System Security Extensions (DNSSEC) \n( http://dnssec.net ) is a security improvement to the existing DNS  infrastructure. The primary function of DNSSEC is to provide mutual  certificate authentication and encrypted sessions between devices  during DNS operations. DNSSEC has been implemented across a  significant portion of the DNS system. Once fully implemented, \nDNSSEC will significantly reduce server-focused DNS abuses, such  as zone file poisoning and DNS cache poisoning. However, DNSSEC  only applies to DNS servers, not to systems performing queries  against DNS servers (such as clients). \nNon-DNS servers (i.e., mostly client devices), especially when using  the Internet, should consider using DNS over HTTPS (DoH) . This  system creates an encrypted session with a DNS server of TLS-  protected HTTP and then uses that session as a form of VPN to  protect the DNS query and response. A late 2020 enhancement to \nDoH is Oblivious DoH (OdoH) . OdoH adds a DNS proxy between the  client and the DNS resolver so that the identity of the requesting  client is isolated from the DNS resolver. Thus, ODoH provides  anonymity and privacy to DNS queries. However, you are now  trusting the ODoH provider to protect your privacy. \nFor an excellent primer and advanced discussion on \nDNS, its operation, and known issues, please visit “An Illustrated \nGuide to the Kaminsky DNS Vulnerability”:  http://unixwiz.net/techtips/iguide-kaminsky-dns-vuln.html . \nDNS Poisoning \nDNS poisoning is the act of falsifying the DNS information used by a  client to reach a desired system. It can take place in many ways. \nWhenever a client needs to resolve a DNS name into an IP address, it  may go through the following process: \n1. Check the local cache (which includes content from the hosts  file). \n2. Send a DNS query to a known DNS server. \n3. Send a broadcast query to any possible local subnet DNS server. \n(This step isn't widely supported.) \nIf the client doesn't obtain a DNS-to-IP resolution from any of these  steps, the resolution fails and the communication can't be sent. \nThere are many ways to attack or exploit DNS, most of which are  used to return false results. \nRogue DNS Server \nA rogue DNS server can listen in on network traffic for any DNS  query or specific DNS queries related to a target site. Then the rogue \nDNS server sends a DNS response to the client with false IP  information. Once the client receives the response from the rogue \nDNS server, the client closes the DNS query session, which causes  the response from the real DNS server to be dropped and ignored as  an out-of-session packet. \nDNS queries are not authenticated, but they do contain a 16-bit value  known as the query ID (QID) . The DNS response must include the  same QID as the query to be accepted. Thus, a rogue DNS server  must include the requesting QID in the false reply. \nPerforming DNS Cache Poisoning \nDNS poisoning involves attacking DNS servers and placing incorrect  information into its zone file or cache. Authorized DNS server attacks  aim to alter the primary record of an FQDN in the zone file on the  primary authoritative DNS server. This causes real DNS servers to  send false data back to clients. However, an attack on an  authoritative DNS server typically gets noticed very quickly, so it  rarely results in widespread exploitation. \nSo, most attackers focus on caching DNS servers instead. A caching \nDNS server is any DNS system deployed to cache DNS information  from other DNS servers. The content hosted on a caching DNS server  is not being watched by the worldwide security community but just  the local operators. Thus, an attack against a caching DNS server can  potentially occur without notice for a significant period of time. This  variation can be called DNS cache poisoning . \nAlthough both of these attacks focus on DNS servers, they ultimately  affect clients. Once a client has performed a dynamic DNS  resolution, the information received from an authoritative DNS  server or a caching DNS server will be temporarily stored in the  client's local DNS cache. If that information is false, then the client's \nDNS cache has been poisoned. \nDNS Pharming \nAnother attack closely related to DNS poisoning and/or DNS  spoofing is DNS pharming . Pharming is the malicious redirection of  a valid website's URL or IP address to a fake website. Pharming  typically occurs either by modifying the local hosts file on a system  or by poisoning or spoofing DNS resolution. \nAltering the Hosts File \nModifying the hosts file on the client by placing false DNS data into  it redirects users to false locations. If an attacker is able to plant false  information into the hosts file, then when the system boots, the  contents of the hosts file will be read into memory, where they will  take precedence. This attack is effective, but it is also highly targeted. \nIt only affects the individual systems with a locally corrupted hosts  file. If the attacker wishes to cause harm more broadly, any of the  other methods would be more effective. \nCorrupt the IP Configuration \nCorrupting the IP configuration can result in a client having a false \nDNS server definition (i.e., DNS lookup address changing). The DNS  server address is typically distributed to clients through DHCP, but it  can also be assigned statically. Attacks to alter a client's DNS server  lookup address can be performed by compromising DHCP or  through a script. \nDNS Query Spoofing \nA DNS query spoofing attack occurs when the threat actor is able to  eavesdrop on a client's query to a DNS server. The attacker then  sends back a reply with false information. In order for this to be  successful, the false reply must include the correct QID cloned from  the query. \nUse Proxy Falsification \nAlthough not strictly a DNS issue, a proxy falsification attack could  be implemented via DNS if the proxy's domain name has to be  resolved by the client to use the proxy. Attacks could modify the local  configuration, the configuration script, or the routing table to  redirect communications to a false proxy. This method works only  against web communications (or other services or protocols that use  a proxy). A rogue proxy server can modify traffic packets to reroute  requests to whatever site the malicious actor wants. \nAn adversary in the middle (AitM) (also known as a  man-in-the-middle attack [MitM] or on-path attack) can be  performed using DNS abuses, such as DNS cache poisoning. \nOnce a client receives a response from DNS, that response will be  cached for future use. If false information can be fed into the DNS  cache, then misdirecting communications is trivially easy. See \nChapter 17, “Preventing and Responding to Incidents,” for more  on this type of attack. \nDefenses to DNS Poisoning \nOrganizations should use a split-DNS system (aka split-horizon \nDNS , split-view DNS , and split-brain DNS ). A split-DNS is  deploying a DNS server for public use and a separate DNS server for  internal use. All data in the zone file on the public DNS server is  accessible by the public via queries or probing. However, the internal \nDNS is for internal use only. Only internal systems are granted  access to interact with the internal DNS server. Outsiders are  prohibited from accessing the internal DNS server by blocking  inbound port 53 for both TCP and UDP. TCP 53 is used for zone  transfers (which includes most DNS server–to–DNS server  communications), and UDP 53 is used for queries (which is any non- \nDNS system sending a query to a DNS server). Internal systems can  be configured to interact only with the internal DNS servers, or they  may be allowed to send queries to external DNS servers (which does  require the firewall to be a stateful inspection firewall configured to  allow responses to return to the internal system from an approved  outbound query). \nAlthough there are many DNS poisoning methods, here are some  basic security measures you can take that can greatly reduce their  threat: \nLimit zone transfers from internal DNS servers to external DNS  servers. This is accomplished by blocking inbound TCP port 53 \n(zone transfer requests) and UDP port 53 (queries). \nRequire internal clients to resolve all domain names through the  internal DNS. This will require that you block outbound UDP  port 53 (for queries) while keeping open outbound TCP port 53 \n(for zone transfers). \nLimit the external DNS servers from which internal DNS servers  pull zone transfers. \nDeploy a network intrusion detection system (NIDS) to watch  for abnormal DNS traffic. \nProperly harden all DNS, server, and client systems in your  private network. \nUse DNSSEC to secure your DNS infrastructure. \nUse DoH or OdoH on all clients where supported. \nThere is no easy patch or update that will prevent these exploits from  being waged against a client. This is due to the fact that these attacks  take advantage of the normal and proper mechanisms built into  various protocols, services, and applications. Thus, the defense is  more of a detection and preventive concern. Install both HIDS and \nNIDS tools to watch for abuses of these types. Regularly review the  logs of your DNS and DHCP systems, as well as local client system  logs and potentially firewall, switch, and router logs for entries  indicating abnormal or questionable occurrences. \nAnother DNS defense mechanism is a DNS sinkhole. A DNS sinkhole  is a specific example of a false telemetry system (aka sinkhole server,  internet sinkhole, and blackhole DNS). This technique is effectively \nDNS spoofing used as a defense. A DNS sinkhole attempts to provide  false responses to DNS queries from malware, such as bots, to  prevent access to command and control systems. It can also be used  to protect users from visiting known malicious or phishing sites. \nThus, DNS sinkholes can be used for both malicious and  benign/investigative/defensive purposes. \nDomain Hijacking \nDomain hijacking , or domain theft , is the malicious action of  changing the registration of a domain name without the  authorization of the valid owner. This may be accomplished by  stealing the owner's logon credentials, using XSRF, hijacking a  session, using an AitM attack, or exploiting a flaw in the domain  registrar's systems. \nAn example of a domain hijack is the theft of the fox-it.com domain;  you can read about this attack at http://blog.fox-  it.com/2017/12/14/lessons-learned-from-a-man-in-the-middle-  attack . \nSometimes, when another person registers a domain name  immediately after the original owner's registration expires, it is  called domain hijacking, but it shouldn't be. This is a potentially  unethical practice, but it is not an actual hack or attack. It is taking  advantage of the oversight of the original owner's failure to manually  extend their registration or configure auto-renewal. If an original  owner loses their domain name by failing to maintain registration,  there is often no recourse other than to contact the new owner and  ask about reobtaining control. \nWhen an organization loses its domain and someone else takes over  control, this can be a devastating event both to the organization and  its customers and visitors. The new FQDN owner might host  completely different content or a false duplicate of the previous site. \nThis later activity might result in fooling visitors, similar to a  phishing attack, where personally identifiable information (PII)  might be extracted and collected. \nThe best defense against domain hijacking is to use strong  multifactor authentication when logging into your domain registrar. \nTo defend against letting your domain registration lapse, set up auto-  renew and double-check the payment method a week before the  renewal date. \nHomograph Attack \nAnother DNS, address, or hyperlink concern is that of the  homograph attack . These attacks leverage similarities in character  sets to register phony international domain names (IDNs) that to the  naked eye appear legitimate. For example, in many fonts, some  letters in Cyrillic look like Latin characters; for example, the l (i.e.,  lowercase L) in Latin looks like the Palochka Cyrillic letter. Thus,  domain names of apple.com and paypal.com might look valid as Latin  characters but could actually include Cyrillic characters that, when  resolved, direct you to a different site than you intended. For a  thorough discussion of the homograph attack, see  http://blog.malwarebytes.com/101/2017/10/out-of-character-  homograph-attacks-explained . \nSee Chapter 2, “Personnel Security and Risk \nManagement Concepts,” for social engineering topics of  typosquatting, URL hijacking, and clickjacking, which are also  related to domain name poisoning or spoofing. \nInternet Protocol (IP) Networking \nAnother important protocol in the TCP/IP protocol suite operates at  the Network Layer of the OSI model, namely, Internet Protocol (IP) . \nIP provides route addressing for data packets. It is this route  addressing that is the foundation of global internet communications  because it provides a means of identity and prescribes transmission  paths. Similar to UDP, IP is connectionless and is an unreliable  communication service. IP does not offer guarantees that packets  will be delivered or that packets will be delivered in the correct order,  and it does not guarantee that packets will be delivered only once. \nHowever, it was designed to perform “best effort” in finding a path or  route to a destination in spite of a damaged or corrupted network  structure. Thus, you must employ TCP with IP to gain reliable and  controlled communication sessions. \nIPv4 vs. IPv6 \nIPv4 is the version of Internet Protocol that is most widely used  around the world. However, IPv6 is being rapidly adopted for both  private and public network use. IPv4 uses a 32-bit addressing  scheme, whereas IPv6 uses 128 bits for addressing. IPv6 offers many  new features that are not available in IPv4. Some of IPv6's new  features are scoped addresses, autoconfiguration, and quality of  service (QoS) priority values. Scoped addresses give administrators  the ability to group and then block or allow access to network  services, such as file servers or printing. Autoconfiguration  theoretically removes the need for traditional DHCP and network  address translation (NAT). However, DHCPv6 and NAT66 exist (see \nChapter 12 for NAT66). QoS priority values allow for traffic  management based on prioritized content. Also, IPSec is native to \nIPv6, but it is an add-on for IPv4. \nDHCPv6 has two modes of operation. In stateful mode, DHCPv6  assigns specific IPv6 addresses to devices and manages the allocation  of network configuration parameters. This mode is similar to the  operation of DHCP in IPv4 networks. In stateless mode, DHCPv6  provides network configuration parameters without assigning  specific IPv6 addresses. Devices may use Stateless Address \nAutoconfiguration (SLAAC) to generate their own addresses. \nSLAAC is based on routers periodically sending Router \nAdvertisement (RA) messages to the local network segment. The RA  messages include information about the network prefix that devices  should use when forming their IPv6 addresses. The second element  used to craft an IPv6 address is the interface identifier, which is  typically derived from the Media Access Control (MAC) address of  the network interface on the device. However, to enhance privacy,  some implementations may use techniques like “privacy extensions”  to generate random interface identifiers. The combination of the  network prefix and the interface identifier results in a self-assigned  unique IPv6 address for each device. \nIPv4 has an equivalent concept to that of IPv6's QoS,  which is named Type of Service (ToS). However, ToS seemed to  go unused and was converted into the Differentiated Services \n(DS) by a later specification. The DS field offers a variety of  definable characteristics that can be used to manage traffic flow. \nHowever, it still does not seem to have widespread use or support  by network devices, which would perform such management. \nThere is promise that IPv6 networks will include more common  support and actually provide for traffic prioritization based on \nIPv6 header values. \nIPv6 is supported by most operating systems released since 2000. \nFor most OSs today, native IPv6 is standard. While the initial  deployment of IPv6, both privately and publicly, has been slow, at  the start of 2024, over 42 percent of Internet IP traffic was IPv6-  based. For a glimpse into the status of IPv4 to IPv6 conversion on the \nInternet from Google's perspective, see the IPv6 statistics at  www.google.com/intl/en/ipv6/statistics.html . \nThe transition or migration to IPv6 raises several security concerns. \nOne issue is that with the larger 128-bit address space, there are  many more addresses that attackers can use as source addresses;  thus, IP filtering and block lists will be less effective as attackers can  just use a different address to get past the filter. \nA second issue is that secure deployment of IPv6 requires that all  security filtering and monitoring products be upgraded to fully  support IPv6 prior to enabling the protocol on the production  network. Otherwise, IPv6 will serve as a covert channel, as it will be  unmonitored and unfiltered. \nThe means by which IPv6 and IPv4 can coexist on the same network  is to use one or more of three primary options: dual stack , tunneling,  or NAT-PT. Dual stack means having systems operate both IPv4 and \nIPv6 and using the appropriate protocol for each conversation. \nTunneling allows most systems to operate a single stack of either \nIPv4 or IPv6 and use an encapsulation tunnel to access systems of  the other protocol. Network Address Translation-Protocol \nTranslation (NAT-PT) (RFC-2766) can be used to convert between \nIPv4 and IPv6 network segments similar to how NAT converts  between internal and external addresses. See Chapter 12 on NAT66. \nFor those organizations still reluctant to deploy IPv6 internally, they  might consider IPv6 at the edge. This is a configuration where IPv6 is  only supported on the boundary devices connected directly to the \nInternet. This enables communications over the Internet using IPv6,  while using IPv4 internally. \nBoth IPv4 and IPv6 have a header field that is used to  control or limit infinite transmission. The time to live (TTL) field  of IPv4 and the hop limit field of IPv6 are decremented by routers  until it reaches zero (0). Once that occurs, the packet is discarded  and an ICMP Type 11 Timeout Exceeded error message is sent  back to the origin. \nIP Classes \nBasic knowledge of IPv4 addressing and IPv4 classes is a must for  any security professional. If you are rusty on IPv4 addressing,  subnetting, classes, and other related topics, take the time to refresh  your knowledge. \nTable 11.1 and Table 11.2 provide a quick overview of the key details  of classes and default subnets. A full Class A subnet supports \n16,777,214 hosts; a full Class B subnet supports 65,534 hosts; and a  full Class C subnet supports 254 hosts. Class D is used for  multicasting, whereas Class E is reserved for experimental and future  use. \nTABLE 11.1 IP classes \nClass First binary digits Decimal range of first octet \nA 0 1–126 \nB 10 128–191 \nC 110 192–223 \nD 1110 224–239 \nE 1111 240–255 \nTABLE 11.2 IP classes' default subnet masks \nClass Default subnet mask CIDR equivalent \nA 255.0.0.0 /8 \nB 255.255.0.0 /16 \nC 255.255.255.0 /24 \nNote that the entire Class A network of 127 was set aside for the  loopback address , although only a single address is actually needed  for that purpose. A Class A network of 0 is defined as the blackhole  network where traffic is routed to be thrown away and discarded. \nThe loopback address for IPv4 is any address in the \nClass A subnet of 127.0.0.1–127.255.255.254, even though only  the address of 127.0.0.1 is typically used. When an interface is  configured for loopback, a subnet mask is not defined; it will use \n255.255.255.255 by default, although some will document this as \n127.0.0.0/8. Also note that under IPv4, the first address of a  subnet is reserved as the network address (i.e., 127.0.0.0) and the  last for the directed broadcast (i.e., 127.255.255.255) and,  therefore, not directly usable as a host address (or in this case a  loopback address). The IPv6 loopback is not a specific address—it  is a notation: ::1/128 or ::1%128. \nThe original class-based grouping of IPv4 addresses is no longer  strictly adhered to. Instead, a more flexible system has been adopted  based on variable length subnet masking (VLSM) and Classless \nInter-Domain Routing (CIDR) . CIDR provides for a subnet masking  notation that uses mask bit counts rather than a full dotted-decimal  notation subnet mask. Thus, instead of 255.255.0.0, a CIDR notation  is added to the IP address after a slash, as in 172.16.1.1/16, for  example. One significant benefit of CIDR over traditional subnet-  masking techniques is the ability to combine multiple noncontiguous  sets of addresses into a single subnet. For example, it is possible to  combine several Class C subnets into a single larger subnet grouping. \nIf CIDR piques your interest, see IETF's RFC for CIDR at  http://tools.ietf.org/html/rfc4632 . \nICMP \nInternet Control Message Protocol (ICMP) is used to determine the  health of a network or a specific link. ICMP is utilized by ping ,  traceroute , tracert , pathping , and other network management tools. \nThe ping utility employs ICMP echo packets and bounces them off  remote systems. Thus, you can use ping to determine whether the  remote system is online, whether the remote system is responding  promptly, whether the intermediary systems are supporting  communications, and at what level of performance efficiency the  intermediary systems are communicating. The ping utility includes a  redirect function that allows the echo responses to be sent to a  destination different from the system of origin. \nUnfortunately, the features of ICMP were often exploited in various  forms of bandwidth-based denial-of-service (DoS) attacks, such as  ping of death, Smurf attacks, and ping floods. This fact has shaped  how networks handle ICMP traffic today, resulting in many networks  limiting the use of ICMP or at least limiting its throughput rates. \nIGMP \nInternet Group Management Protocol (IGMP) allows systems to  support multicasting. Multicasting is the transmission of data to  multiple specific recipients. RFC 1112 discusses the requirements to  perform IGMP multicasting ( http://tools.ietf.org/html/rfc1112 ). \nIGMP is used to manage a host's dynamic multicast group  membership. With IGMP, a single initial signal is multiplied at the  router if divergent pathways exist to the intended recipients. \nMulticasting can be assisted by a Trivial File Transfer Protocol \n(TFTP) system to host or cache content that is to be sent to multiple  recipients. \nARP Concerns \nAddress Resolution Protocol (ARP) is used to resolve IP addresses \n(32-bit binary number for logical addressing) into MAC addresses \n(48-bit binary number for physical addressing). Traffic on a network  segment (for example, from a client to a default gateway [i.e., a  router] via a switch) is directed from its source system to its  destination system using MAC addresses. ARP is carried as the  payload of an Ethernet frame and is a dependent Layer 2 protocol. \nARP uses caching and broadcasting to perform its operations. The  first step is to check the local ARP cache. If the needed information is  already present in the ARP cache, it is used. If not, then an ARP  request in the form of a broadcast is transmitted. If the owner of the  queried address is in the local subnet, it can respond with the  necessary information in an ARP reply/response. If not, the system  will default to using its default gateway's MAC address to transmit its  communications. ARP can be abused using a technique called ARP  cache poisoning, where an attacker inserts bogus information into  the ARP cache. \nARP cache poisoning or ARP spoofing is caused by an attacker  responding with falsified replies. ARP cache is updated each time an \nARP reply is received. The dynamic content of ARP cache, whether  poisoned or legitimate, will remain in cache until a timeout occurs \n(which is usually under 10 minutes). Once an IP-to-MAC mapping  falls out of cache, then the attacker gains another opportunity to  poison the ARP cache when the client re-performs the ARP  broadcast query. \nAnother form of ARP poisoning uses gratuitous ARP or unsolicited \nARP replies. This occurs when a system announces its MAC-to-IP  mapping without being prompted by an ARP query. A gratuitous \nARP broadcast may be sent as an announcement of a node's  existence, to update an ARP mapping due to a change in IP address  or MAC address, or when redundant devices are in use that share an \nIP address and may also share the same MAC address (regularly  occurring gratuitous ARP announcements help to ensure reliable  failover). \nA third form of ARP cache poisoning is to create static ARP entries. \nThis is done via the ARP command and must be done locally. \nUnfortunately, this is easily accomplished through a malicious script  executed on the client. However, static ARP entries are not persistent  across reboots. \nThe best defense against ARP-based attacks is port security on the  switch. Switch port security can prohibit communications with  unknown, unauthorized, rogue devices and may be able to determine  which system is responding to all ARP queries and block ARP replies  from the offending system. A local or software firewall, host  intrusion detection and prevention system (HIDPS), or special  endpoint security products can also be used to block unrequested \nARP replies/announcements. One popular tool used to detect ARP  poisoning is arpwatch . \nAnother defense is to establish static ARP entries. Yes, this can be  used as both an attack/abuse and a defense. However, this is not  often recommended because it removes the flexibility of a system  adapting to changing network conditions, such as other devices  entering and leaving the network. Once a static ARP entry is defined,  it is “permanent” in that it will not be overwritten by any ARP reply,  but it will not be retained across a reboot (that feature would be  called persistence). A boot or logon script would need to be crafted  on each system to re-create the static entries each time the system  rebooted. \nSecure Communication Protocols \nProtocols that provide security services for application-specific  communication channels are called secure communication protocols. \nExamples include the following: \nIPSec Internet Protocol Security (IPSec) uses public key  cryptography to provide encryption, integrity, antireplay, access  control, and message origin authentication, all using IP-based  protocols. The primary use of IPSec is for virtual private networks \n(VPNs), so IPSec can operate in either transport or tunnel mode. \nIPSec is a standard of IP security extensions used as an add-on for \nIPv4 and integrated into IPv6. IPSec is discussed further in Chapter \n12. \nKerberos Kerberos offers a single sign-on (SSO) solution for  users and provides protection for logon credentials. Modern  implementations of Kerberos use hybrid encryption to provide  reliable authentication protection. Kerberos is discussed further in \nChapter 14, “Controlling and Monitoring Access.” \nSSH Secure Shell (SSH) is a good example of an end-to-end  encryption technique. This security tool can be used to encrypt  numerous plaintext utilities (such as rcp , rlogin , and rexec ), serve as  a protocol encrypter (such as with SFTP), and function as a transport  mode VPN (i.e., host-to-host and link encryption only). SSH is  discussed further in Chapter 12. \nSignal Protocol This is a cryptographic protocol that provides  end-to-end encryption for voice communications, videoconferencing,  and text message services. The Signal Protocol is a core element in  the messaging app named Signal. \nSecure Remote Procedure Call (S-RPC) S-RPC is an  authentication service for cross-network service communications  and is simply a means to prevent unauthorized execution of code on  remote systems. \nTransport Layer Security (TLS) This is an encryption protocol  that operates at OSI Layer 4 (by encrypting the payload of TCP  communications). Although it is primarily known to be used to  encrypt web communications as HTTPS, it can encrypt any \nApplication Layer protocol. Transport Layer Security (TLS)  replaced Secure Sockets Layer (SSL) . Features of TLS include the  following: \nSupports secure client-server communications across an  insecure network while preventing tampering, spoofing, and  eavesdropping. \nSupports one-way authentication. \nSupports two-way authentication using digital certificates. \nOften implemented as the initial payload of a TCP package,  allowing it to encapsulate all higher-layer protocol payloads. \nCan be used to encrypt User Datagram Protocol (UDP) and \nSession Initiation Protocol (SIP) connections. (SIP is a protocol  associated with Voice over IP [VoIP].) \nImplications of Multilayer Protocols \nTCP/IP is a multilayer protocol . TCP/IP derives several benefits  from its multilayer design, specifically in relation to its mechanism of  encapsulation. For example, when communicating between a web  server and a web browser over a typical network connection, HTTP is  encapsulated in TCP, which in turn is encapsulated in IP, which in  turn is encapsulated in Ethernet. This could be presented as follows: \n[ Ethernet [ IP [ TCP [ HTTP [Payload] ] ] ] ] \nHowever, this is not the extent of TCP/IP's encapsulation support. It  is also possible to add additional layers of encapsulation. For  example, adding TLS encryption to the communication would insert  a new encapsulation between HTTP and TCP (technically, this  results in HTTPS, the TLS-encrypted form of HTTP): \n[ Ethernet [ IP [ TCP [ TLS [ HTTP [Payload] ] ] ] ] ] \nThis in turn could be further encapsulated with a Network Layer  encryption such as IPSec: \n[ Ethernet [ IPSec [ IP [ TCP [ TLS [ HTTP [Payload] ] ] ] ] ] \n] \nThis is an example of a VPN. VPNs use encapsulation to enclose or  tunnel one protocol inside another protocol. Usually, the  encapsulation protocol encrypts the original protocol. For more on \nVPNs, see Chapter 12. \nHowever, encapsulation is not always implemented for benign  purposes. Numerous covert channel communication mechanisms  use encapsulation to hide or isolate an unauthorized protocol inside  another authorized one. For example, if a network blocks the use of \nFTP but allows HTTP, then tools such as HTTPTunnel can be used to  bypass this restriction. This could result in an encapsulation  structure such as this: \n[ Ethernet [ IP [ TCP [ HTTP [ FTP [Payload] ] ] ] ] ] \nNormally, HTTP carries its own web-related payload, but with the \nHTTPTunnel tool, the standard payload is replaced with an  alternative protocol. \nThis false encapsulation can even occur lower in the protocol stack. \nFor example, ICMP is typically used for network health testing and  not for general communication. However, with utilities such as Loki, \nICMP is transformed into a tunnel protocol to support TCP  communications. The encapsulation structure of Loki is as follows: \n[ Ethernet [ IP [ ICMP [ TCP [ HTTP [Payload] ] ] ] ] ] \nAnother area of concern caused by unbounded encapsulation  support is the ability to jump between virtual local area networks \n(VLANs). Please see Chapter 12 about VLANs. \nMultilayer protocols provide the following benefits: \nA wide range of protocols can be used at higher layers. \nEncryption can be incorporated at various layers. \nFlexibility and resiliency in complex network structures is  supported. \nThere are a few drawbacks of multilayer protocols: \nCovert channels are allowed. \nFilters can be bypassed. \nLogically imposed network segment boundaries can be  overstepped. \nDNP3 \nDNP3 (Distributed Network Protocol 3) is primarily used in the  electric and water utility and management industries. It is used to  support communications between data acquisition systems and  the system control equipment. This includes substation  computers, remote terminal units (RTUs) (i.e., devices controlled  by an embedded microprocessor), intelligent electronic devices \n[IEDs], and SCADA primary stations (i.e., control centers). DNP3  is an open and public standard. It is a multilayer protocol that  functions similarly to TCP/IP in that it has link, transport, and  transportation layers. For more details on DNP3, please view the  protocol primer at www.dnp.org/About/Overview-of-DNP3- \nProtocol . \nConverged Protocols \nConverged protocols are the merging of specialty or proprietary  protocols with standard protocols, such as those from the TCP/IP  suite. The primary benefit of converged protocols is the ability to use  existing TCP/IP supporting network infrastructure to host special or  proprietary services without the need for unique deployments of  alternate networking hardware. Some common examples of  converged protocols are described here: \nStorage Area Network (SAN) A storage area network (SAN) is  a secondary network (distinct from the primary communications  network) used to consolidate and manage various storage devices  into a single consolidated network-accessible storage container. \nSANs are often used to enhance networked storage devices such as  hard drives, drive arrays, optical jukeboxes, and tape libraries so that  they can be made to appear to servers as if they were local storage. \nSANs operate by encapsulating or converging data storage signals  into TCP/IP communications to separate storage and proximity. A \nSAN can be a single point of failure, so redundancy needs to be  integrated to provide protection of availability. In some instances, a \nSAN may implement deduplication to save space by not retaining  multiple copies of the same file. However, this can sometimes result  in data loss if the one retained original is corrupted. \nInternet Small Computer Systems Interface (iSCSI) \nInternet Small Computer Systems Interface (iSCSI) is a networking  storage standard based on IP that operates at Layer 5 (Session). This  technology can be used to enable location-independent file storage,  transmission, and retrieval over LAN, WAN, or public internet  connections. iSCSI is often viewed as a low-cost alternative to Fibre \nChannel. \nInfiniBand over Ethernet InfiniBand over Ethernet (IBoE)  refers to the encapsulation of InfiniBand traffic within Ethernet  frames, allowing InfiniBand protocols to run over Ethernet networks. \nInfiniBand is a high-performance and low-latency interconnect  technology commonly used in high-performance computing (HPC)  environments. IBoE provides a way to integrate InfiniBand  technology into existing Ethernet infrastructures. \nCompute Express Link Compute Express Link (CXL) is an  advanced high-speed interconnect technology developed to address  the increasing demands of data-intensive workloads in modern  computing systems. It is designed to enhance the performance,  efficiency, and scalability of data-centric applications in various  domains such as artificial intelligence (AI), machine learning (ML), \nHPC, and more. As a converged protocol, CXL supports the  communication and collaboration of various components, such as \nCPUs, GPUs, accelerators, memory, and other devices, over a single  high-speed interconnect. \nOther concepts that may be considered examples of converged  technologies include VPN, SDN, cloud, virtualization, SOA,  microservices, and serverless architecture. \nVoice over Internet Protocol (VoIP) \nVoice over IP (VoIP) is a tunneling mechanism that encapsulates  audio, video, and other data into IP packets to support voice calls  and multimedia collaboration. VoIP has become a popular and  inexpensive telephony solution for companies and individuals  worldwide. VoIP has the potential to replace or supplant public  switched telephone network (PSTN) services because it's often less  expensive and offers a wider variety of options and features. VoIP  can be used as a direct telephone replacement on computer networks  as well as mobile devices. VoIP is considered a converged protocol as  it combines the audio (and video) encapsulation technology \n(operating as Application Layer protocols) with the established  multilayer protocol stack of TCP/IP. \nVoIP is available in both commercial and open source options. Some \nVoIP solutions require specialized hardware to either replace  traditional telephone handsets/base stations or allow these to  connect to and function over the VoIP system. Some VoIP solutions  are software only, such as Skype, and allow the user's existing  speakers, microphone, or headset to replace the traditional  telephone handset. Others are hardware-based, such as magicJack,  which allows the use of existing PSTN phone devices plugged into a \nUSB adapter to take advantage of VoIP over the Internet. \nCommercial VoIP equipment typically looks and functions much like  traditional PSTN equipment but simply replaces the prior plain old  telephone service (POTS) line with VoIP connectivity. Often, VoIP-  to-VoIP calls are free (assuming the same or compatible VoIP  technology are in use on both ends), whereas VoIP-to-landline or \nVoIP-to-mobile calls are usually charged a per-minute fee. \nIt is important to keep security in mind when selecting a VoIP  solution to ensure that it provides the privacy and security you  expect. Some VoIP systems are essentially plain-form  communications that are easily intercepted and eavesdropped;  others are highly encrypted, and any attempt to interfere or wiretap  is deterred and thwarted. \nVoIP is not without its problems. Threat actors can wage a wide  range of potential attacks against a VoIP solution: \nCaller ID can be falsified easily using any number of VoIP tools,  so threat actors can perform vishing (VoIP phishing) or Spam  over Internet Telephony (SPIT) attacks. \nThe call manager systems and VoIP phones themselves might be  vulnerable to host operating system attacks and DoS attacks. If a  device's or software's host OS or firmware has vulnerabilities,  there is increased risk of exploits. \nThreat actors might be able to perform AitM attacks by spoofing  call managers or endpoint connection negotiations and/or  responses. \nDepending on the deployment, there are also risks associated  with deploying VoIP phones off the same switches as desktop  and server systems. This could allow for 802.1X authentication  falsification as well as VLAN and VoIP hopping (i.e., jumping  across authenticated channels). \nSince VoIP traffic is just network traffic, it is often possible to  listen in on VoIP communications by decoding the VoIP traffic  when it isn't encrypted. \nSecure Real-Time Transport Protocol or Secure RTP (SRTP) is a  security improvement over the Real-Time Transport Protocol (RTP)  that is used in many VoIP communications. SRTP aims to minimize  the risk of DoS, AitM attacks, and other VoIP exploits through robust  encryption and reliable authentication. RTP or SRTP takes over after \nSession Initiation Protocol (SIP) establishes the communication link  between endpoints. \nSoftware-Defined Networking \nSoftware-defined networking (SDN) is a unique approach to  network operation, design, and management. The concept is based  on the theory that the complexities of a traditional network with on-  device configuration (i.e., routers and switches) often force an  organization to stick with a single device vendor and limit the  flexibility of the network to adapt to changing physical and business  conditions, as well as optimize costs of acquiring new devices. SDN  aims to separate the infrastructure layer (aka the data plane and the  forwarding plane)—hardware and hardware-based settings—from  the control layer—network services of data transmission  management. The control plane uses protocols to decide where to  send traffic, and the data plane includes rules that decide whether  traffic will be forwarded. This form of traffic management also  involves access control over what systems can communicate which  protocols to whom. This type of access control is typically attribute-  based access control (ABAC) based. \nInstead of traditional networking equipment such as routers and  switches, an SDN solution gives an organization the option to handle  traffic routing using simpler network devices that accept instructions  from the SDN controller. This eliminates some of the complexity  related to traditional networking protocols. Furthermore, this also  removes the traditional networking concepts of IP addressing,  subnets, routing, and the like from needing to be programmed into  or be deciphered by hosted applications. \nSDN offers a new network design that is directly programmable from  a central location, flexible, vendor-neutral, and open-standards-  based. Using SDN frees an organization from having to purchase  devices from a single vendor. It instead allows organizations to mix  and match hardware as needed, such as to select the most cost-  effective or highest throughput–rated devices regardless of vendor. \nThe configuration and management of hardware are then controlled  through a centralized management interface. APIs (application  programming interfaces) play a crucial role in SDN by providing a  standardized way for external software applications to interact with  and manipulate the network. In addition, the settings applied to the  hardware can be changed and adjusted dynamically as needed from a  central console or control point. \nIn relation to SDN, a southbound interface is the communication  path from the SDN controller to the network devices in the data  plane, facilitating the control and management of network traffic. \nThe northbound interface is the communication path from the SDN  controller to the applications or services in the Application Layer,  allowing applications to interact with the SDN controller and make  use of the network's programmability. These terms describe the flow  of information between different components within an SDN  framework. \nSometimes the terms eastbound and westbound are  used to describe communications within a layer of a network or  services’ lattice structure (i.e., between peer elements). \nSDN and network functions virtualization (NFV) are two distinct but  closely related concepts that have transformed the traditional  networking landscape. While SDN focuses on the separation of the  control plane and data plane, NFV is about virtualizing and  abstracting network functions from dedicated hardware devices. \nWhen combined, SDN and NFV create a more flexible, scalable, and  programmable network infrastructure. It is effectively network  virtualization. It allows data transmission paths, communication  decision trees, and flow control to be virtualized in the SDN/NFV  control layer rather than being handled on the hardware on a per-  device basis. \nAnother interesting development arising out of the concept of  virtualized networks is that of a virtual SAN (VSAN) . A SAN is a  network technology that combines multiple individual storage  devices into a single consolidated network-accessible storage  container. They are often used with multiple or clustered servers that  need high-speed access to a single shared dataset. These have  historically been expensive due to the complex hardware  requirements of the SAN. VSANs bypass these complexities with  virtualization. A virtual SAN or a software-defined shared storage  system is a virtual re-creation of a SAN on top of a virtualized  network or an SDN. \nSoftware-defined storage (SDS) is another derivative of SDN. SDS is  a SDN version of a SAN or NAS. SDS is a storage management and  provisioning solution that is policy driven and is independent of the  actual underlying storage hardware. It is effectively virtual storage. \nSoftware-defined wide-area networks (SDWAN or SD-WAN) are an  evolution of SDN that can be used to manage the connectivity and  control services between distant data centers, remote locations, and  cloud services over WAN links. \nSegmentation \nNetworks are not typically configured as a single large collection of  systems. Usually, networks are segmented or subdivided into smaller  organizational units. These smaller units, groupings, segments, or  subnetworks (i.e., subnets) can be used to improve various aspects of  the network: \nBoosting Network Performance Network segmentation can  improve performance through an organizational scheme in which  systems that often communicate are located in the same segment. \nAlso, dividing broadcast domains can significantly improve  performance for larger networks. \nReducing Communication Problems Network segmentation  often reduces congestion and contains communication problems,  such as broadcast storms. \nProviding Security Network segmentation can also improve  security by isolating traffic and user access to those segments where  they are authorized. \nPhysical segmentation refers to the practice of physically separating  different components or segments within a network or system to  enhance security, isolate sensitive information, and control access. \nThis segmentation is typically achieved through various means, and  different types of physical segmentation include in-band, out-of-  band, and air-gapped. In-band segmentation involves the use of the  same communication path or network infrastructure for both data  and control traffic. Components within the same in-band segment  share the same network resources. Often this is synonymous with  logical segmentation as it does not use physical divisions for  segmentation. Out-of-band segmentation involves separating data  and controlling traffic onto different communication paths or  networks. Control signals and management traffic have a dedicated  network that is distinct from the network used for regular data  transmission. An out-of-band segment creates a separate and  distinct network structure for traffic that would otherwise interfere  with the production network or that may itself be put at risk if placed  on the production network. Secondary (or additional) network paths  or segments may be created to support data storage traffic (such as  with SANs), VoIP, backup data, patch distribution, and management  operations. \nAir-gapped segmentation is the most stringent form of physical  segmentation, where there is a complete physical separation between  two systems or networks. This isolation is typically achieved by  having no direct physical connection, such as cables, between the  systems. There is also a need to either avoid the use of wireless  communications or to block them purposefully. \nLogical segmentation can be created by using switch-based virtual  local area networks (VLANs), virtual private networks (VPNs),  routers, firewalls, virtual routing and forwarding (VRF), and virtual  domains individually or in combination. \nVLANs are a method of logically dividing a physical LAN into  multiple isolated broadcast domains. Devices within the same VLAN  can communicate with each other as if they were on the same  physical network, even if they are located on different physical  segments. VLANs help improve network performance, security, and  flexibility by grouping devices logically instead of relying solely on  physical network topology. VLANs are commonly used in enterprise  networks to segregate traffic based on departments, functions, or  security levels. \nVPNs create secure and encrypted communication channels over a  public or shared network (usually the Internet). They allow remote  users or branch offices to securely connect to the main corporate  network, creating a virtual private network. VPNs provide secure  communication over untrusted networks, ensuring privacy and data  integrity. They are widely used for remote access, site-to-site  connectivity, and secure communication between different entities. \nVRF is a technology that allows multiple instances of a routing table  to coexist within a router. Each VRF instance operates as a separate  and independent routing domain, enabling the isolation of routing  information. VRF is often used in service provider networks to  provide virtualization and isolation for different customers or  departments. It allows the same physical router to maintain separate  routing tables for different VRF instances, preventing the leakage of  routing information between them. \nVirtual domains, also known as virtual systems or virtual contexts,  involve creating isolated instances of a network device, such as a  firewall or switch, to operate independently. Each virtual domain has  its own configuration and operates as a separate logical entity. \nVirtual domains allow multiple customers or departments to use the  same physical network device while maintaining logical separation. \nThis is common in firewall appliances where different organizations  or business units require dedicated firewall policies. \nA private LAN or intranet, a screened subnet, and an extranet are all  types of network segments. \nAnother example of network segmentation is a VPC. A virtual private  cloud (VPC) is a virtualized network infrastructure provided by a  cloud computing service provider. It allows users to create and  manage isolated, logically segmented networks within the public  cloud environment. A VPC enables organizations to host their  applications and resources in a secure and dedicated space in the  cloud while maintaining control over network configuration. \nAn evolution of the concept of network segmentation is micro-  segmentation. Micro-segmentation is a network security strategy  that involves dividing a network into small, isolated segments to  enhance security and minimize the potential impact of security  breaches. Micro-segmentation may potentially create divisions as  small as a single device, such as a high-value server or even a client  or endpoint device. This approach focuses on applying fine-grained  security controls to individual workloads, applications, or devices  within the network. Any and all communications between zones are  filtered, may require authentication, often require session  encryption, and may be subjected to allow list and block list control \n(i.e., authorization) and be closely monitored and logged. In some  cases, to communicate with entities external to the local segment, the  communication must be encapsulated for egress. This is similar to  using a VPN to access a remote network. Micro-segmentation is a  key element in implementing zero trust (see Chapter 8, “Principles of \nSecurity Models, Design, and Capabilities”). \nSeveral technologies and concepts contribute to the implementation  of micro-segmentation, including network overlays/encapsulation,  distributed firewalls, distributed routers, and intrusion detection  systems (IDSs)/intrusion prevention systems (IPSs): \nNetwork overlays/encapsulation: Network overlays involve  creating logical networks on top of an existing physical network. \nEncapsulation is a technique where data packets are wrapped in  an additional layer, providing a form of isolation. Overlays and  encapsulation support micro-segmentation by creating isolated  communication channels between different segments. This helps  in preventing unauthorized access to data by encapsulating it  within specific overlays. \nDistributed firewalls: Traditional firewalls are typically placed  at the network perimeter. Distributed firewalls, on the other  hand, are implemented at various points within the network,  closer to individual workloads or devices. These firewalls are  also called internal segmentation firewalls (ISFWs). Distributing  firewall capabilities across the network means that security  policies can be enforced at a more granular level. Each workload  or segment can have its own firewall rules, allowing for  customized security controls. \nDistributed routers: Similar to distributed firewalls, distributed  routers are deployed at various points within the network rather  than being centralized. Distributed routers enable localized  routing decisions and help control the flow of traffic between  different micro-segments. This approach enhances network  efficiency and provides more control over routing at a finer  granularity. \nIntrusion detection system (IDS)/intrusion prevention system \n(IPS): IDS monitors network and/or system activities for  suspicious behavior or security policy violations. IPS goes a step  further by actively preventing or blocking identified threats. \nDeploying IDS/IPS at various points within the network allows  for real-time detection and prevention of security threats. These  systems contribute to the proactive security posture of micro-  segmented environments. \nMicro-segmentation is a powerful security strategy, especially in the  context of modern cybersecurity, where organizations seek to  enhance their defenses against advanced threats and minimize the  impact of security incidents. \nVirtual Extensible LAN (VXLAN) is an encapsulation protocol that  enables VLANs (see Chapter 12) to be stretched across subnets and  geographic distances. VLANs are typically restricted to Layer 2  network areas and are not able to include members from other  networks that are accessible only through a router portal. \nAdditionally, VXLAN allows for up to 16 million virtual networks to  be created, whereas traditional VLANs are limited to only 4,096. \nVXLAN can be used as a means to implement micro-segmentation  without limiting segments to local entities only. VXLAN is defined in \nRFC 7348. \nEdge Networks \nAn edge network is a carefully designed data architecture that  strategically allocates computing resources to edge devices within a  network. This design helps distribute processing power demands  away from central servers, empowering the devices to handle a  significant portion of the processing workload. Edge networks are  designed to bring content, services, and applications closer to the  users to reduce latency and improve performance. \nEdge network ingress points are often strategically located at the  edge of the network infrastructure to efficiently bring in data or  content from external sources, ensuring a responsive and low-latency  user experience. \nEdge network egress points are strategically positioned to efficiently  direct traffic from the network to external destinations. This helps  optimize the flow of data and content to ensure a seamless and  responsive user experience. \nEdge network peering refers to the process of establishing direct  interconnections between edge networks, allowing them to exchange  traffic directly without relying on intermediaries. The objective is to  optimize the exchange of data, content, or services between different  edge networks, leading to improved performance, reduced latency,  and enhanced efficiency. \nWireless Networks \nWireless networking is widely implemented because of the ease of  deployment and relatively low cost. Wireless networks are subject to  the same vulnerabilities, threats, and risks as any cabled network in  addition to distance eavesdropping and new forms of DoS and  intrusion. \nA wireless network can be referred to as an  unbounded network, while a cable-only network can be referred  to as a bound network. \n802.11 is the IEEE standard for wireless network communications. \nVarious versions (technically called amendments) of the standard  have been implemented, many of which offer better throughput, as  described in Table 11.3. Any later amendments that use the same  frequency as earlier ones maintain backward compatibility. \nTABLE 11.3 802.11 wireless networking amendments \nAmendments Wi-Fi Theoretical Frequencies \nAlliance data rates  names \n802.11 Wi-Fi 0 2 Mbps 2.4 GHz \n802.11a Wi-Fi 2 54 Mbps 5 GHz \n802.11b Wi-Fi 1 11 Mbps 2.4 GHz \n802.11g Wi-Fi 3 54 Mbps 2.4 GHz \n802.11n Wi-Fi 4 600 Mbps 2.4 GHz or 5 GHz \n802.11ac Wi-Fi 5 3.5 Gbps 5 GHz \n802.11ax Wi-Fi 9.6 Gbps Between 1 GHz and \n6/Wi-Fi 6E 7.125 GHz \n802.11be Wi-Fi 7 40 Gbps Between 1 GHz and \n7.250 GHz; coexists  with 2.4, 5, & 6 GHz \nWi-Fi 0, 1, 2, and 3 are named by retroactive  inference. They do not exist in the official standards or Wi-Fi \nAlliance documentation. \n802.11x is sometimes used to collectively refer to all of these  specific implementations as a group; however, 802.11 is preferred  because 802.11x is easily confused with 802.1X, which is an  authentication technology independent of wireless. \nWi-Fi can be deployed in either ad hoc mode (aka peer-to-peer Wi- \nFi) or infrastructure mode. Ad hoc mode means that any two wireless  networking devices can communicate without a centralized control  authority (i.e., base station or access point). Wi-Fi Direct is an  upgraded version of ad hoc mode that can support WPA2 and WPA3 \n(ad hoc supported only WEP). Infrastructure mode means that a  wireless access point (WAP) is required and restrictions for wireless  network access are enforced. \nInfrastructure mode includes several variations, including stand-  alone, wired extension, enterprise extended, and bridge. A stand-  alone mode deployment is when there is a WAP connecting wireless  clients to one another but not to any wired resources (thus, the WAP  is on its own). A wired extension mode deployment is when the WAP  acts as a connection point to link the wireless clients to the wired  network. An enterprise extended mode deployment is when multiple  wireless access points (WAPs) are used to connect a large physical  area to the same wired network. Each WAP will use the same  extended service set identifier (ESSID) so that clients can roam the  area while maintaining network connectivity, even while their  wireless NICs change associations from one WAP to another. A  bridge mode deployment is when a wireless connection is used to  link two wired networks. This type of deployment often uses  dedicated wireless bridges and is used when wired bridges are  inconvenient, such as when linking networks between floors or  buildings. \nA fat access point is a base station that is a fully managed wireless  system, which operates as a stand-alone wireless solution. A thin  access point is little more than a wireless transmitter/receiver, which  must be managed from a separate external centralized management  console called a wireless controller . The benefit of using thin access  points is that management, security, routing, filtering, and more are  centralized at a management console, whereas numerous thin access  points simply handle the radio signals. Most fat access points require  device-by-device configuration and thus are not as flexible for  enterprise use. Controller-based WAPs are thin access points that are  managed by a central controller. A stand-alone WAP is a fat access  point that handles all management functions locally on the device. \nSecuring the SSID \nWireless networks are assigned a service set identifier (SSID) to  differentiate one wireless network from another. This effectively  defines the Wi-Fi network's name. An SSID is used when a single \nWAP is in use, while an ESSID (extended service set identifier) is  used when there are multiple WAPs supporting the same network by  name over a larger area. An independent service set identifier \n(ISSID) is used by Wi-Fi Direct or in ad hoc mode. The basic service  set identifier (BSSID) is the MAC address of the base station (or  initiating device in an ad hoc/Wi-Fi Direct network), which is used to  differentiate multiple base stations supporting an ESSID. \nIf a wireless client knows the SSID, they can configure their wireless \nNIC to communicate with the associated WAP. Knowledge of the \nSSID does not always grant entry, though, because the WAP can use  numerous security features to block unwanted access. SSIDs are  defined by default by vendors and thus are well known. Standard  security practice dictates that the SSID should be changed to  something unique before deployment. \nThe SSID is broadcast by the WAP via a special transmission called a  beacon frame . A beacon frame allows any wireless NIC within range  to see the wireless network and make connecting as simple as  possible. This default SSID broadcast can be disabled to attempt to  keep the wireless network secret. However, attackers can still  discover the SSID with a wireless sniffer since the SSID is still used  in transmissions between connected wireless clients and the WAP. \nThus, disabling SSID broadcasting is not a true mechanism of  security. Instead, use WPA2 or WPA3 as a reliable authentication  and encryption solution rather than trying to hide the existence of  the wireless network. \nWireless Channels \nWithin the assigned frequency of the wireless signal are subdivisions  of that frequency known as channels . Think of channels as lanes on  the same highway. In the United States, there are 11 channels defined  within the 2.4 GHz frequency range, in Europe there are 13, and in \nJapan there are 14. The differences stem from local laws regulating  frequency management—think international versions of the Federal \nCommunications Commission (FCC). \nWhen two or more 2.4 GHz access points are relatively close to one  another physically, signals on one channel can interfere with signals  on another channel. One way to avoid this is to set the channels of  physically close access points as differently as possible to minimize  channel overlap interference. For example, if a building has four  access points arranged in a line along the length of the building, the  channel settings could be 1, 11, 1, and 11. However, if the building is  square and an access point is in each corner, the channel settings  may need to be 1, 4, 8, and 11. If three WAPs are positioned in close  proximity, they can be set to channels 1, 6, and 11 without  interference since these three channels do not overlap with each  other. \n5 GHz wireless was designed to avoid this channel overlap and  interference issue. While 2.4 GHz channels are 22 MHz wide and 5 \nMHz apart, 5 GHz channels are 20 MHz wide and 20 MHz apart. \nTherefore, adjacent 5 GHz channels do not interfere with one  another. Furthermore, adjacent channels can be combined or  bonded into a larger width channel for faster throughput. \nWi-Fi band/frequency selection should be based on the purpose or  use of the wireless network as well as the level of existing  interference. For external networks, 2.4 GHz is often preferred  because it can provide good coverage over a distance but at slower  speeds; 5 GHz is often preferred for internal networks because it  provides higher throughput rates (but less coverage area), but it does  not penetrate solid objects, like walls and furniture. Most of the mesh \nWi-Fi (multiple WAP) options are based on 5 GHz and use three or  more mini-WAP devices to provide ML-optimized (machine  learning–capable) coverage throughout a home or office. The 6 GHz  spectrum range supports up to seven 160 MHz–wide channels more  than the 5 GHz spectrum. This is possible due to the fact that the 6 \nGHz spectrum is a contiguous 1.2 GHz frequency range rather than  the multiple noncontiguous ranges in the 5 GHz spectrum. This  provides for more top-speed connections than earlier forms of Wi-Fi. \nDevices that support the1–6 GHz spectrum range are labeled Wi-Fi \n6E (as the version without the E only supports 1–5 GHz). However, 6 \nGHz is even more restricted by obstacles and distance. \nConducting a Site Survey \nWireless cells are the areas within a physical environment where a  wireless device can connect to a wireless access point. You should  adjust the strength of the WAP to maximize authorized user access  and minimize outside intruder access. Doing so may require unique  placement of wireless access points, shielding, and noise  transmission. Often WAP placement is determined by performing a  site survey to generate a heat map. A site survey is useful for  evaluating existing wireless network deployments, planning  expansion of current deployments, and planning for future  deployments. \nA site survey is a formal assessment of wireless signal strength,  quality, and interference using an RF signal detector. A site survey is  performed by placing a wireless base station in a desired location  and then collecting signal measurements from throughout the area. \nThese measurements are evaluated to determine whether sufficient  signal is present where needed while minimizing signals elsewhere. \nIf the base station is adjusted, then the site survey should be  repeated. The goal of a site survey is to maximize performance in the  desired areas (such as within a home or office) while minimizing ease  of unauthorized access in external areas. \nA site survey is often used to produce a heat map. A heat map is a  mapping of signal strength measurements over a building's  blueprint. The heat map helps to locate hot spots (oversaturation of  signal) and cold spots (lack of signal) to guide adjustments to WAP  placement, antenna type, antenna orientation, and signal strength. \nWireless Security \nWi-Fi is not always encrypted, and even when it is, the encryption is  only between the client device and the base station. For end-to-end  encryption of communications, use a VPN or an encrypted  communications application to pre-encrypt communications before  transmitting them over Wi-Fi. For foundational encryption concepts,  see Chapter 6, “Cryptography and Symmetric Key Algorithms,” and \nChapter 7, “PKI and Cryptographic Applications.” \nThe original IEEE 802.11 standard defined two methods that  wireless clients can use to authenticate to WAPs before normal  network communications can occur across the wireless link. These  two methods are open system authentication (OSA) and shared key  authentication (SKA) . \nOSA means no real authentication is required. As long as a radio  signal can be transmitted between the client and WAP,  communications are allowed. It is also the case that wireless  networks using OSA typically transmit everything in cleartext, thus  providing no secrecy or security. \nWith SKA, some form of authentication must take place before  network communications can occur. The 802.11 standard defines one  optional technique for SKA known as Wired Equivalent Privacy \n(WEP). Later 802.11 amendments added WPA, WPA2, WPA3, and  other technologies. \nWired Equivalent Privacy (WEP) \nWired Equivalent Privacy (WEP) is defined by the original IEEE \n802.11 standard. WEP uses a predefined shared Rivest Cipher 4 \n(RC4) secret key for both authentication (i.e., SKA) and encryption. \nUnfortunately, the shared key is static and shared among the WAP(s)  and clients. Due to flaws in its implementation of RC4, WEP is weak. \nWEP was cracked almost as soon as it was released. Today, it is  possible to crack WEP in less than a minute. Fortunately, there are  alternatives to WEP that you should use instead. \nWi-Fi Protected Access (WPA) \nWi-Fi Protected Access (WPA) was designed as the replacement for \nWEP; it was a temporary fix until the new 802.11i amendment was  completed. WPA is a significant improvement over WEP in that it  does not use the same static key to encrypt all communications. \nInstead, it negotiates a unique key set with each host. Additionally, it  separated authentication from encryption. WPA borrowed the  authentication options from the then-still-draft of 802.11i. \nWPA uses the RC4 algorithm and employs the Temporal Key \nIntegrity Protocol (TKIP) or the Cisco alternative, Lightweight \nExtensible Authentication Protocol (LEAP) . However, WPA is no  longer secure. Attacks specific to WPA (i.e., coWPAtty and GPU-  based cracking tools) have rendered WPA's security unreliable. WPA  might still be deployed to support EOSL or legacy equipment \n(although this is a very poor security option). \nTemporal Key Integrity Protocol (TKIP) was designed  as a temporary measure to support WPA features without  requiring the replacement of legacy wireless hardware. TKIP and \nWPA were officially replaced by WPA2 in 2004. In 2012, TKIP  was officially deprecated and is no longer considered secure. \nWi-Fi Protected Access 2 (WPA2) \nIEEE 802.11i or Wi-Fi Protected Access 2 (WPA2) replaced WEP and \nWPA. It implements AES-CCMP instead of RC4. To date, no attacks  have been successful against AES-CCMP encryption. However, there  have been exploitations of the WPA2 key exchange processes \n(research KRACK [Key Reinstallation AttaCKs], if interested). \nCounter Mode with Cipher Block Chaining Message \nAuthentication Code Protocol (CCMP) (Counter-Mode/CBC- \nMAC Protocol) is the combination of two block cipher modes to  enable streaming by a block algorithm. CCMP can be used on  many block ciphers. The AES-CCMP implementation was defined  as part of WPA2, which replaced WEP and WPA, and is also used  in WPA3 as the preferred means of wireless encryption. \nWPA2/802.11i defined two “new” authentication options known as  preshared key (PSK) or personal (PER) and IEEE 802.1X or  enterprise (ENT) . They were also supported in WPA, but they were  borrowed from the draft of IEEE 802.11i before it was finalized. PSK  is the use of a static fixed password for authentication. ENT enables  the leveraging of an existing AAA service, such as RADIUS or \nTACACS+, to be used for authentication. \nDon't forget about the ports related to common AAA  services: UDP 1812 (authentication and authorization) and UDP \n1813 (accounting) for RADIUS and TCP 49 for TACACS+. \nWi-Fi Protected Access 3 (WPA3) \nWi-Fi Protected Access 3 (WPA3) was finalized in January 2018. \nWPA3-ENT uses 192-bit AES CCMP encryption, and WPA3-PER  remains at 128-bit AES CCMP. WPA3-PER replaces the preshared  key authentication with Simultaneous Authentication of Equals \n(SAE). Some 802.11ac/Wi-Fi 5 devices were the first to support or  adopt WPA3. \nSimultaneous Authentication of Equals (SAE) still uses a password,  but it no longer encrypts and sends that password across the  connection to perform authentication. Instead, SAE performs a zero-  knowledge proof process known as Dragonfly Key Exchange, which  is itself a derivative of Diffie–Hellman. The process uses the preset  password and the MAC addresses of the client and AP to perform  authentication and session key exchange. (There have been attacks  against SAE; research Dragonblood attack, if interested.) \nWPA3 also implements IEEE 802.11w-2009 management frame  protection so that a majority of network management operations  have confidentiality, integrity, authentication of source, and replay  protection. \n802.1X/EAP \nWPA, WPA2, and WPA3 support the enterprise (ENT)  authentication known as 802.1X/EAP , a standard port-based  network access control that ensures that clients cannot communicate  with a resource until proper authentication has taken place. \nEffectively, 802.1X is a handoff system that allows network devices  to leverage the existing network infrastructure's authentication  services. You can almost consider 802.1X as an authentication proxy  service. Through the use of 802.1X, other techniques and solutions  such as Remote Authentication Dial-In User Service (RADIUS), \nTerminal Access Controller Access Control System (TACACS),  certificates, smartcards, token devices, and biometrics can be  integrated into wireless networks, providing techniques for both  mutual and multifactor authentication. \nExtensible Authentication Protocol (EAP) is not a specific  mechanism of authentication; rather it is an authentication  framework. Effectively, EAP allows for new authentication  technologies to be compatible with existing wireless or point-to-  point connection technologies. For more on EAP and 802.1X, see \nChapter 12. \nLEAP \nLightweight Extensible Authentication Protocol (LEAP) is a Cisco  proprietary alternative to TKIP for WPA. This was developed to  address deficiencies in TKIP before the 802.11i/WPA2 system was  ratified as a standard. \nAn attack tool known as asleap was released in 2004 that could  exploit the ultimately weak protection provided by LEAP. LEAP  should be avoided when possible; use of EAP-TLS as an alternative is  recommended, but if LEAP is used, a complex password is strongly  recommended. \nPEAP \nProtected Extensible Authentication Protocol (PEAP) encapsulates \nEAP methods within a TLS tunnel that provides authentication and  potentially encryption. Since EAP was originally designed for use  over physically isolated channels and hence assumed secured  pathways, EAP is usually not encrypted. So PEAP can provide  encryption for EAP methods. \nWi-Fi Protected Setup (WPS) \nWi-Fi Protected Setup (WPS) is a security standard for wireless  networks. It is intended to simplify the effort involved in adding new  clients to a well-secured wireless network. It operates by auto-  connecting and automatically authenticating the first new wireless  client to initiate a connection to the network once WPS is triggered. \nWPS can be initiated by a button on the WAP or a code or PIN that  can be sent to the base station remotely. This allows for a brute-force  guessing attack that could enable a threat actor to guess the WPS  code in less than six hours, which in turn would enable the threat  actor to connect their own unauthorized system to the wireless  network. \nThe PIN code is composed of two four-digit  segments, which can be guessed one segment at a time, with  confirmation from the base station of each segment. \nWPS is a feature that is enabled by default on most WAPs because it  is a requirement for device Wi-Fi Alliance certification. It's  important to disable it as part of a security-focused predeployment  process. If a device doesn't offer the ability to turn off WPS (or the  configuration Off switch doesn't work), upgrade or replace the base  station's firmware or replace the whole device. \nWireless MAC Filter \nA MAC filter can be used on a WAP to limit or restrict access to only  known and approved devices. The MAC filter is a list of authorized  wireless client interface MAC addresses that is used by a WAP to  block access to all nonauthorized devices. Though a potentially  useful feature, it can be difficult to manage and tends to be used only  in small, static environments. However, even with WPA2 or WPA3,  the Ethernet header remains in cleartext, which enables threat actors  to sniff and spoof authorized MAC addresses. Additionally, many  modern mobile devices offer randomized Wi-Fi MAC addresses. \nThus, MAC filtering is no longer a useful option to block unknown  devices while allowing in known ones. \nWireless Antenna Management \nA wide variety of antenna types can be used for wireless clients and  base stations. Many devices can have their standard antennas  replaced with stronger (i.e., signal-boosting) antennas. \nThe standard straight or pole antenna is an omnidirectional  antenna . This is the antenna found on most base stations and client  devices. This type of antenna is sometimes also called a base antenna  or a rubber duck antenna (due to most being covered in a flexible  rubber coating). \nMost other types of antennas are directional, meaning they focus  their sending and receiving capabilities in one primary direction. \nSome examples of directional antennas include Yagi, cantenna,  panel, and parabolic. A Yagi antenna is similar in structure to that of  traditional roof TV antennas, which are crafted from a straight bar  with cross-sections. Cantennas are constructed from tubes with one  sealed end. Panel antennas are flat devices that focus from only one  side of the panel. Parabolic antennas are used to focus signals from  very long distances or weak sources. \nConsider the following guidelines when seeking optimal antenna  placement: \nUse a central location. \nAvoid solid physical obstructions. \nAvoid reflective or other flat metal surfaces. \nAvoid electrical equipment. \nIf a base station has external omnidirectional antennas, typically,  they should be positioned pointing straight up vertically. If a  directional antenna is used, point the focus toward the area of  desired use. Keep in mind that wireless signals are affected by  interference, distance, and obstructions. \nSome WAPs provide a physical or logical adjustment of the antenna  power levels. Power level controls are typically set by the  manufacturer to a setting that is suitable for most situations. After  performing site surveys, if wireless signals are still not satisfactory,  power level adjustment might be necessary. However, changing  channels, avoiding reflective and signal-scattering surfaces, and  reducing interference can often be more significant in terms of  improving connectivity reliability. \nWhen adjusting power levels, make minor adjustments instead of  attempting to maximize or minimize the setting. Also, take note of  the initial/default setting so that you can return to that setting if  desired. After each power level adjustment, reset/reboot the WAP  before re-performing site survey and quality tests. Sometimes,  lowering the power level can improve performance. Some WAPs are  capable of providing higher power levels than are allowed by  regulations in countries where they are available. \nUsing Captive Portals \nA captive portal is an authentication technique that redirects a newly  connected client to a web-based portal access control page. The  portal page may require the user to input payment information,  provide login credentials, or input an access code. A captive portal is  also used to display an acceptable use policy, privacy policy, and  tracking policy to the user, who must consent to the policies before  being able to communicate across the network. \nCaptive portals are most often located on wireless networks  implemented for public use, such as at hotels, restaurants, bars,  airports, libraries, and so on. However, they can be used on cabled \nEthernet connections as well. Captive portals can be used in any  scenario where the owner or administrator of a connection wants to  limit access to authorized entities (which might include paying  customers, overnight guests, known visitors, or those who agree to a  security policy and/or terms of service). \nGeneral Wi-Fi Security Procedure \nHere is a general guide or procedure to follow when deploying a Wi- \nFi network. These steps are in order of consideration and  application/installation: \n1. Update firmware. \n2. Change the default administrator password to something unique  and complex. \n3. Enable WPA2 or WPA3 encryption. \n4. Enable ENT authentication or PSK/SAE with long, complex  passwords. \n5. Change the SSID (the default is often the vendor name). \n6. Change the wireless MAC address (to hide OUI and device  make/model that may be encoded into the default MAC  address). \n7. Decide whether to disable the SSID broadcast based on your  deployment requirements (even though this doesn't increase  security). \n8. Enable MAC filtering if the pool of wireless clients is relatively  small (usually less than 20) and static. \n9. Consider using static IP addresses or configure DHCP with  reservations (applicable only for small deployments). \n10. Treat wireless as external or remote access, and separate the \nWAP from the wired network using a firewall. \n11. Treat wireless as an entry point for attackers and monitor all \nWAP-to-wired-network communications with an NIDS. \n12. Deploy a wireless intrusion detection system (WIDS) and a  wireless intrusion prevention system (WIPS). \n13. Consider requiring the use of a VPN across a Wi-Fi link. \n14. Implement a captive portal. \n15. Track/log all wireless activities and events. \nWireless Communications \nWireless communication is a quickly expanding field of technologies  for networking, connectivity, communication, and data exchange. As  wireless technologies continue to proliferate, your organization's  security efforts need to encompass wireless communications. \nGeneral Wireless Concepts \nWireless communications employ radio waves to transmit signals  over a distance. The radio spectrum is differentiated using frequency. \nFrequency is a measurement of the number of wave oscillations  within a specific time and is identified using the unit Hertz (Hz) (i.e.,  oscillations per second). Radio waves have a frequency between 3 Hz  and 300 GHz. Several spectrum-use techniques were developed to  manage the simultaneous use of the limited radio frequencies,  including spread spectrum, FHSS, DSSS, OFDM, MIMO, TDMA, and \nCDMA. \nMost devices operate within a small subsection of  frequencies rather than all available frequencies. This is because  of frequency-use regulations (in other words, the FCC in the \nUnited States), power consumption, and the expectation of  interference. \nSpread spectrum means that communication occurs over multiple  frequencies. Thus, a message is broken into pieces, and each piece is  sent at the same time but using a different frequency. Effectively, this  is a parallel communication rather than a serial communication. \nFrequency Hopping Spread Spectrum (FHSS) was an early  implementation of the spread spectrum concept. FHSS transmits  data in series across a range of frequencies, but only one frequency at  a time is used. \nDirect Sequence Spread Spectrum (DSSS) employs frequencies  simultaneously in parallel. DSSS uses a special encoding mechanism  known as chipping code to allow a receiver to reconstruct data even if  parts of the signal were distorted because of interference. \nOrthogonal Frequency-Division Multiplexing (OFDM) employs a  digital multicarrier modulation scheme that allows for a more tightly  compacted transmission. The modulated signals are perpendicular \n(orthogonal) and thus do not cause interference with one another. \nUltimately, OFDM requires a smaller frequency set (aka channel  bands) but can offer greater data throughput. \nMultiple Input, Multiple Output (MIMO) is a wireless  communication technology that uses multiple antennas at both the  transmitter and receiver ends to improve the performance of a  communication link. MIMO is widely used in modern wireless  communication systems to enhance data rates, reliability, and overall  spectral efficiency. \nTime Division Multiple Access (TDMA) is a digital communication  technology used in various wireless communication systems,  including mobile and satellite communication. TDMA is a multiple  access scheme that divides the available communication channel into  time slots, allowing multiple users to share the same frequency  without interfering with each other. \nCode Division Multiple Access (CDMA) is a digital cellular  technology that allows multiple users to share the same frequency  band simultaneously. CDMA assigns a unique code to each entity. \nThis unique code allows multiple signals to occupy the same  frequency at the same time. \nBluetooth \nBluetooth was originally defined in IEEE 802.15.1 but is currently  managed by Bluetooth SIG ( www.bluetooth.com ). The Bluetooth SIG \n(special interest group) is an industry association that oversees the  development and standardization of Bluetooth technology. The \nBluetooth SIG is responsible for defining the specifications,  promoting interoperability, and certifying Bluetooth products. \nBluetooth is a wireless communication technology that allows  devices to exchange data over short distances using radio waves. It  uses the 2.4 GHz frequency. Bluetooth is plaintext by default in most  implementations, but it can be encrypted with specialty transmitters  and peripherals. Bluetooth operates between devices that have been  paired, which often use a default pair code, such as 0000 or 1234. \nBluetooth is generally a short-distance communication method (used  to create personal area networks [PANs]), but that distance is based  on the relative strengths of the paired devices' antennas. Standard or  official use of Bluetooth ranges up to 100 meters, and an estimated \n350+ meters with the introduction of Bluetooth 5. \nBluetooth Low Energy (Bluetooth LE, BLE, Bluetooth Smart) is a  low-power-consumption derivative of standard Bluetooth. BLE was  designed for IoT, edge/fog devices, mobile equipment, medical  devices, and fitness trackers. It uses less power while maintaining a  similar transmission range to that of standard Bluetooth. Standard \nBluetooth and BLE are not compatible, but they can coexist on the  same device.  iBeacon is a location-tracking technology developed by Apple based  on BLE. iBeacon can be used by a store to track customers while they  shop as well as by customers as an indoor positioning system to  navigate to an interior location. \nZigbee is an IoT equipment communications concept that is based on \nBluetooth. Zigbee has low power consumption and a low throughput  rate, and requires close proximity of devices. Zigbee communications  are encrypted using a 128-bit symmetric algorithm. \nBluetooth is vulnerable to a wide range of attacks: \nBluesniffing is Bluetooth-focused network packet capturing. \nBluesmacking is a DoS attack against a Bluetooth device that  can be accomplished through the transmission of garbage traffic  or signal jamming. \nBluejacking involves sending unsolicited messages to Bluetooth-  capable devices without the permission of the owner/user. \nThese messages may appear on a device's screen automatically,  but many modern devices prompt whether to display or discard  such messages. \nBLUFFS (Bluetooth Forward and Future Secrecy) is a series of  exploits targeting Bluetooth, aiming to break Bluetooth sessions'  forward and future secrecy, compromising the confidentiality of  past and future communications between devices. \nBluesnarfing is the unauthorized access of data via a Bluetooth  connection. Sometimes, the term bluejacking is mistakenly used  to describe or label the activity of bluesnarfing. Bluesnarfing  typically occurs over a paired link between the threat actor's  system and the target device. However, bluesnarfing is also  possible against non-discoverable devices if their Bluetooth \nMAC addresses are known, which could be gathered using  bluesniffing. \nBluebugging grants an attacker remote control over the  hardware and software of your devices over a Bluetooth  connection. The name is derived from enabling the microphone  on a compromised system to use it as a remote wireless bug. \nAll Bluetooth devices are vulnerable to bluesniffing, bluesmacking,  bluejacking, and BLUFF attacks. Only a few devices have been  discovered to be vulnerable to bluesnarfing or bluebugging. \nThe defenses for all of these Bluetooth threats are to minimize use of \nBluetooth, especially in public locations, and to leave Bluetooth  turned off completely when not in active use. \nRFID \nRadio Frequency Identification (RFID) is a tracking technology  based on the ability to power a radio transmitter using current  generated in an antenna (see Figure 11.7) when placed in a magnetic  field. RFID can be triggered/powered and read from a considerable  distance away (potentially hundreds of meters). RFID can be  attached to devices and components or integrated into their  structure. This can allow for quick inventory tracking without having  to be in direct physical proximity to the device. Simply walking into a  room with an RFID reader, a malicious actor can collect the  information transmitted by the activated chips in the area. \nFIGURE 11.7 An RFID antenna \nAdapted from http://electrosome.com/rfid-radio-frequency-identification \nThere is some concern that RFID can be a privacy-violating  technology. If you are in possession of a device with an RFID chip,  then anyone with an RFID reader can take note of the signal from  your chip. When an RFID chip is awakened or responds to being  near a reader, the chip (also called the RFID tag) transmits a unique  code or serial number. That unique number is meaningless without  the corresponding database that associates the number with the  specific object (or person). However, if you are the only one around  and someone detects your RFID chip code, then they can associate  you and/or your device with that code for all future detections of the  same code. \nNFC \nNear-field communication (NFC) is a standard that establishes radio  communications between devices in close proximity (4 centimeters  or less versus meters for passive RFID). It lets you perform a type of  automatic synchronization and association between devices by  touching them together or bringing them within centimeters of one  another. NFC can be implemented as a field-powered or field-  triggered device. NFC is a derivative technology from RFID and is a  form of field-powered or manually triggered device. \nNFC is commonly found on smartphones and many mobile device  accessories. It's often used to perform device-to-device data  exchanges, set up direct communications, or access more complex  services such as WPA2/WPA3 wireless networks by linking with the \nWAP via NFC. Many contactless payment systems are based on NFC. \nNFC can function just like RFID (such as when using an NFC tile or  sticker) or support more complex interactions. NFC chips can  support challenge-response dialogs and even use public key  infrastructure (PKI) encryption solutions. \nNFC attacks can include AitM attacks, eavesdropping, data  manipulation, and replay attacks. So, while some NFC  implementations support reliable authentication and encryption, not  all of them do. A best practice is to leave NFC features disabled until  they need to be used. \nWireless Attacks \nWireless networking has become common on both corporate and  home networks. Even with wireless security present, wireless attacks  can still occur. \nWi-Fi Scanners \nWar driving is someone using a detection tool to look for wireless  networking signals, often ones they aren't authorized to access. The  name comes from the legacy attack concept of war dialing , which  was used to discover active computer modems by dialing all the  numbers in a prefix or an area code. War driving can be performed  with a dedicated handheld detector, with a mobile device with Wi-Fi  capabilities, with a notebook that has a wireless network card, or  even with a drone ( war flying ). It can be performed using native  features of the OS or using specialized scanning and detecting tools \n(aka wireless scanners). \nA wireless scanner is used to detect the presence of a wireless  network. Any active wireless network that is not enclosed in a \nFaraday cage can be detected, since the base station will be  transmitting radio waves, even those with SSID broadcast disabled. \nA wireless scanner is able to determine whether there are wireless  networks in the area, what frequency and channel they are using, the \nSSID, and what type of encryption is in use (if any). A wireless  cracker can be used to break the encryption of WEP and WPA  networks. WPA2 networks might be vulnerable to Key Reinstallation \nAttaCKs (KRACK) if devices have not been updated since 2017. \nRogue Access Points \nA rogue WAP may be planted by an employee for convenience,  installed internally by a physical intruder, or operated externally by  an attacker. Such unauthorized access points usually aren't  configured for security, or, if they are, they aren't configured  properly or in line with the organization's approved access points. \nRogue WAPs should be discovered and removed to eliminate an  unregulated access path into your otherwise secured network. \nA rogue WAP or false WAP can be deployed by an attacker externally  to target your existing wireless clients or future visiting wireless  clients. An attack against existing wireless clients requires that the  rogue WAP be configured to duplicate the SSID, MAC address, and  wireless channel of the valid WAP, although operating at a higher  power rating. This may cause clients with saved wireless profiles to  inadvertently select or prefer to connect to the rogue WAP instead of  the valid original WAP. \nA second method used by a rogue WAP focuses on attracting new  visiting wireless clients. This type of rogue WAP is configured with a  social engineering trick by setting the SSID to an alternate name that  appears legitimate or even preferred over the original valid wireless  network's SSID. The rogue WAP's MAC address and channel do not  need to be clones of the original WAP. \nThe defense against rogue WAPs is to operate a wireless intrusion  detection system (WIDS) to monitor the wireless signals for abuses,  such as newly appearing WAPs, especially those operating with  mimicked or similar SSID and MAC values. \nAn administrator or security team member could attempt to locate  rogue WAPs through the use of a wireless scanner and a directional  antenna to perform triangulation. Once a rogue device is located, the  investigation can turn to figuring out how it got there and who was  responsible. \nFor clients, the best option is to connect a VPN across the wireless  link, and only if the VPN connection is established successfully  should the wireless link be used. VPNs can be set up in private  networks for local wireless clients, or a public VPN provider can be  used when connecting to public wireless networks. \nEvil Twin \nEvil twin is an attack in which a threat actor operates a false access  point that will automatically clone or twin the identity of an access  point based on a client device's request to connect. Each time a  typical device successfully connects to a wireless network, it retains a  wireless profile in its history. These wireless profiles are used to  reconnect to a network automatically whenever the device is within  range of the related base station. Each time the wireless adapter is  enabled on a device, it sends out reconnection requests to each of the  networks in its wireless profile history. These reconnect requests  include the original base station's MAC address and the network's \nSSID. The evil twin attack system eavesdrops on the wireless signal  for these reconnect requests. Once the evil twin sees a reconnect  request, it spoofs its identity with those parameters and offers a  plaintext connection to the client. The client accepts the request and  establishes a connection with the false evil twin base station. This  enables the malicious actor to eavesdrop on communications  through an AitM attack, which could lead to session hijacking, data  manipulation credential theft, and identity theft. \nThis attack works because authentication and encryption are  managed by the base station, not enforced by the client. Thus, even  though the client's wireless profile will include authentication  credentials and encryption information, the client will accept  whatever type of connection is offered by the base station, including  plaintext. \nTo defend against evil twin attacks, pay attention to the wireless  network your devices connect to. If you connect to a network that  you know is not located nearby, it may be a sign that you are under  attack. Disconnect and go elsewhere for internet access. You should  also prune unnecessary and old wireless profiles from your history  list to give attackers fewer options to target. \nYou can be easily fooled into thinking that you are connected to a  proper and valid base station or connected to a false one. On most  systems, you can check to see what if any communication security \n(i.e., encryption) is currently in use. If your network connection is  not secure, you can either disconnect and go elsewhere or connect to  a VPN. We always recommend attempting to connect to a VPN when  using a wireless connection, even if your network properties show a  valid security type. \nDisassociation \nDisassociation is one of the many types of wireless management  frames. A disassociation frame is used to disconnect a client from  one WAP as it is connecting to another WAP in the same ESSID  network coverage area. If used maliciously, the client loses their  wireless link. \nA similar attack can be performed using a deauthentication packet. \nThis packet is normally used immediately after a client initiates WAP  authentication but fails to provide proper credentials. However, if  sent at any time during a connected session, the client immediately  disconnects as if its authentication did fail. \nThese management frames can be used in several forms of wireless  attacks, including the following: \nFor networks with hidden SSIDs, a disassociation packet with a \nMAC address spoofed as that of the WAP is sent to a connected  client that causes the client to lose its connection and then send  a Reassociation Request packet (in an attempt to reestablish a  connection), which includes the SSID in the clear. \nAn attack can send repeated disassociation frames to a client to  prevent reassociation, thus causing a DoS. \nA session hijack event can be initiated by using disassociation  frames to keep the client disconnected while the attacker  impersonates the client and takes over their wireless session  with the WAP. \nAn AitM attack can be implemented by using a disassociation  frame to disconnect a client. Then the attacker provides a  stronger signal from their rogue/fake WAP using the same SSID  and MAC as the original WAP; once the client connects to the  false WAP, the attacker connects to the valid WAP. \nThe main defense against these attacks is to use WAP3 and/or  operate a WIDS, which monitors for wireless abuses. \nJamming \nJamming is the transmission of radio signals to intentionally prevent  or interfere with communications by decreasing the effective signal-  to-noise ratio. To avoid or minimize interference and jamming, start  by adjusting the physical location of devices. Next, check for devices  using the same frequency and/or channel (i.e., signal configuration). \nIf there are conflicts, change the frequency or channel in use on  devices you control. If an interference attack is occurring, try to  triangulate the source of the attack and take appropriate steps to  address the concern—that is, contact law enforcement if the source of  the problem is outside of your physical location. \nInitialization Vector (IV) Abuse \nAn initialization vector (IV) is a mathematical and cryptographic  term for a random number. Most modern crypto functions use IVs to  increase their security by reducing predictability and repeatability. \nAn IV becomes a point of weakness when it's too short, exchanged in  plaintext, or selected improperly. One example of an IV attack is  cracking WEP encryption using the wesside-ng tool from the \nAircrack-ng suite at http://aircrack-ng.org . \nReplay \nA replay attack is the retransmission of captured communications in  the hope of gaining access to the targeted system. Replay attacks  attempt to reestablish a communication session by replaying (i.e.,  retransmitting) captured traffic against a system. This may grant an  adversary access into an account without the attacker possessing the  account's actual credentials. \nThe replay attack concept is also used against cryptographic  algorithms that don't incorporate temporal protections. In this  attack, the malicious individual intercepts an encrypted message  between two parties (often a request for authentication) and then  later “replays” the captured message to open a new session. \nMany wireless replay attack variants exist. They include capturing  new connection requests of a typical client and then replaying that  connect request to fool the base station into responding as if another  new client connection request was initiated. Wireless replay attacks  can also focus on DoS by retransmitting connection requests or  resource requests of the base station to keep it busy focusing on  managing new connections rather than maintaining and providing  service for existing connections. \nWireless replay attacks can be mitigated by keeping the firmware of  the base station updated. A WIDS will be able to detect such abuses  and inform the administrators promptly about the situation. \nAdditional defenses include using one-time authentication  mechanisms, a timestamp and expiration period in each message,  using challenge-response based authentication, and using sequenced  session identification. \nSatellite Communications \nSatellite communications are primarily based on transmitting radio  waves between terrestrial locations and an orbiting artificial satellite. \nSatellites are used to support telephone, television, radio, internet,  and military communications. Satellites can be positioned in three  primary orbits: low Earth orbit (LEO) , 160–2,000 km, medium \nEarth orbit (MEO) , 2,000–35,786 km, and geostationary orbit \n(GEO) , 35,786 km. \nLEO satellites often have stronger signals than other orbits, but they  do not remain in the same position over the earth, so multiple  devices must be used to maintain coverage. Starlink (from SpaceX) is  an example of a LEO satellite-based internet service. Starlink has  plans to deploy a constellation of over 40,000 satellites to provide  global coverage of their internet from space service. \nMEO satellites are in the sky above a terrestrial location for longer  than a LEO satellite. Individual MEO satellites also usually have a  larger transmission footprint (area of the earth covered by its  transmitter/receiver) than that of LEO satellites. However, due to  the higher orbit, there is additional delay and a weaker signal from \nMEO satellites. \nGEO satellites appear motionless in the sky, as they are rotating  around the earth at the same angular velocity as the earth rotates. \nThus, GEO satellites maintain a fixed position above a terrestrial  location. GEO satellites have a larger transmission footprint than \nMEO satellites but also a higher latency. But GEO satellites do not  require that a ground station track the movement of the satellite  across the sky, as is necessary with LEO and MEO satellites, so GEO  ground stations can use fixed antennas. \nCellular Networks \nA cellular network , mobile network, or wireless network is the  primary communications technology that is used by many mobile  devices, especially cell phones and smartphones. The network is  organized around areas of access called cells, which are centered  around a primary transceiver, known as a cell site, cell tower, or base  station. The services provided over cellular networks are often  referred to by a generational code, such as 2G, 3G, 4G, and 5G. \nGenerally, cellular service is encrypted, but only while the  communication is being transmitted from the mobile device to a  transmission tower. Communications are effectively plaintext once  they are being transmitted over wires. So, avoid performing any task  over cellular that is sensitive or confidential in nature. Use an  encrypted communications application to pre-encrypt  communications before transmitting them over a cellular  connection, such as TLS or a VPN. \n4G has been in use since the early 2000s and most cellular devices  support 4G communications. The 4G standard allows for mobile  devices to achieve 100 Mbps, whereas stationary devices can reach 1 \nGbps. 4G is primarily using IP-based communications for both voice  and data, rather than the traditional circuit-switching telephony  services of the past. 4G is provided by various transmission systems,  the most common being LTE, followed by WiMAX. \n5G is the latest mobile service technology that is available for use on  some mobile phones, tablets, and other equipment. Many ICS, IoT,  and specialty devices may have embedded 5G capabilities. 5G uses  higher frequencies than previous cellular technologies, which has  allowed for higher transmission speeds (up to 10 Gbps) but at a  reduced distance. Organizations need to be aware of when and where \n5G is available for use and enforce security requirements on such  communications. \nThere are a few key issues to keep in mind with regard to cell phone  wireless transmissions. First, communications over a cell phone  provider's network, whether voice, text, or data, are not necessarily  secure. Second, with specific wireless-sniffing equipment, your cell  phone transmissions can be intercepted. In fact, your provider's  towers can be simulated to conduct adversary-in-the-middle attacks. \nThird, using your cell phone connectivity to access the Internet or  your office network provides attackers with yet another potential  avenue of attack, access, and compromise. Many of these devices can  potentially act as bridges, creating insecure access into a company  network. \nContent Distribution Networks (CDNs) \nA content distribution network (CDN) , or content delivery network ,  is a collection of resource services deployed in numerous data  centers across the Internet to provide low latency, high performance,  and high availability of the hosted content. CDNs provide the desired  multimedia performance quality demanded by customers through  the concept of distributed data hosts. Rather than having media  content stored in a single central location to be transmitted to all  parts of the Internet, the media is distributed to numerous  geographically distributed pre-staging internet locations that are  closer to groups of customers. This results in a type of geographic  and logical load balancing (see Chapter 12). No one server or cluster  of servers will be strained under the load of all resource requests, and  the hosting servers are located closer to the requesting customers. \nThe overall result is lower-latency and higher-quality throughput. \nThere are many CDN service providers, including Cloudflare, \nAkamai, Amazon CloudFront, and CacheFly. \nAlthough most CDNs focus on the physical distribution of servers,  client-based CDN is also possible. This is often referred as P2P (peer-  to-peer) . The most widely recognized P2P CDN is BitTorrent. \nA service delivery platform (SDP) is a collection of components that  provide the architecture for service delivery. SDP is often used in  relation to telecommunications, but it can be used in many contexts,  including VoIP, Internet TV, SaaS, and online gaming. An SDP is  similar to a content delivery network (CDN), as both are designed for  the support of and efficient delivery of a resource (such as services of  an SDP and multimedia of a CDN). The goal of an SDP is to provide  transparent communication services to other content or service  providers. Both SDPs and CDNs can be implemented using  microservices. \nSecure Network Components \nThere are two basic types of private network segments: intranets and  extranets. An intranet is a private network (i.e., LAN) that is often  designed to host information services privately, similar to services  found on the Internet. Networks that rely on external servers (in  other words, ones positioned on the public internet) to provide  information services for internal use are not considered intranets. \nIntranets provide users with access to the web, email, and other  services on internal servers that are not accessible to anyone outside  the private network. \nAn extranet is a cross between the Internet and an intranet. An  extranet is a section of an organization's network that has been  sectioned off so that it acts as an intranet for the private network but  also serves information to authorized outsiders or external entities. \nAn extranet is often reserved for use by specific partners, suppliers,  distributors, remote salesforce, or select customers. An extranet for  public consumption is typically labeled a screened subnet or  perimeter network. \nA screened subnet (previously known as a demilitarized zone [DMZ])  is a special-purpose extranet that is designed specifically for low-  trust and unknown users to access specific systems, such as the  public accessing a web server. It can be implemented with two  firewalls or one multihomed firewall. The two firewall deployment  method positions one firewall between the screened subnet and the \nInternet and the second between the screened subnet and the  intranet. This positions the subnet for outside access as a buffer  between the Internet and the intranet, and the firewalls bounding the  subnet effectively filter or screen all communications related to it. \nThe multihomed firewall deployment method uses a single firewall  with one interface connected to the Internet, a second interface to  the screened subnet, and a third interface to the intranet. \nA screened host is a firewall-protected system logically positioned  just inside a network segment. All inbound traffic is routed to the  screened host, which in turn acts as a proxy for all the trusted  systems within the private network. It is responsible for filtering  traffic coming into the private network as well as for protecting the  identity of the internal system. \nEast-west traffic refers to the traffic flow that occurs  within a specific network, data center, or cloud environment. \nNorth-south traffic refers to the traffic flow that occurs inbound  or outbound between internal systems and external systems. \nSecure Operation of Hardware \nStrong familiarity with secure network components can assist you in  designing an IT infrastructure that avoids single points of failure and  provides strong support for availability. Part of operating hardware  is to ensure that it is reliable and sufficient to support business  operations. Some of the issues to consider in this regard include  redundant power, warranty, and support. \nComputer systems don't work without power. Providing reliable  power is essential for a reliable IT/IS infrastructure. The concepts of  surge protectors and UPSs were covered in Chapter 10, “Physical \nSecurity Requirements,” but another option you should consider is  the deployment of redundant power supplies. Most deployments of  failover power supplies are configured so that both provide half the  power consumed by the system. But in the event of a failure of one,  the other can take over to provide 100 percent of the system's power  needs. Some solutions offer hot swapping support so that failed  supplies can be replaced or lower-capacity supplies can be swapped  out with those with higher capacity. \nThe majority of equipment that is purchased and deployed today will  likely operate without issue for years. However, it is still possible for  devices to fail, causing excessive downtime or data loss. These  problems can be minimized with planning and preparation, such as  implementing redundancy and avoiding single-point-of-failure  deployments (see Chapter 18, “Disaster Recovery Planning”). \nHowever, that doesn't resolve the issue that you have a failed device. \nThat's when a warranty or a return policy can be helpful. When  acquiring equipment, always inquire about the warranty coverage  and return policy restrictions. You may be able to get a refund or a  replacement if the device fails within a specific time frame. \nAnother aspect of hardware management that might be undervalued  is support. Many of the hardware products in use today, such as VPN  appliances, firewalls, switches, routers, and WAPs, are quite  advanced. Some might even require specialized training or  certification just to configure, set up, and deploy. If your  organization does not have staff with expertise and experience with a  specific hardware device, then you will need to rely on the support  services provided by the vendor. Therefore, when obtaining new  equipment, inquire about the technical support services available  and whether they are included with the product purchase or if such  services require an additional fee, subscription, or contract. \nCommon Network Equipment \nThese are some of the typical hardware devices in a network: \nRepeaters, Concentrators, and Amplifiers Repeaters,  concentrators, and amplifiers (RCAs) are used to strengthen the  communication signal over a cable segment as well as connect  network segments that use the same protocol. RCAs operate at OSI \nLayer 1. Systems on either side of an RCA are part of the same  collision domain and broadcast domain. Aka line driver . \nMultiplexer A multiplexer, often abbreviated as MUX, is a digital  electronic device that combines multiple input signals into a single  output signal for transmission over a shared medium. \nCollision Domains vs. Broadcast Domains \nA collision occurs when two systems transmit data at the same  time onto a connection medium that supports only a single  transmission path. A collision domain is the group of networked  systems that could cause a collision if any two (or more) systems  in that group transmitted simultaneously. Collision domains are  divided by using any Layer 2 or higher device. \nA broadcast occurs when a single system transmits data to all  possible recipients. A broadcast domain is the group of  networked systems in which all other members receive a  broadcast signal when one of the members of the group transmits  it. Usually, the term broadcast domain is used to refer  specifically to Ethernet broadcast domains (and not the broadcast  features of IPv4). Ethernet broadcast domains are divided by  using any Layer 3 or higher device. \nHubs Hubs are used to connect multiple systems and connect  network segments that use the same protocol. A hub is a multiport  repeater. Hubs operate at OSI Layer 1. Systems on either side of a  hub are part of the same collision and broadcast domains. \nModems A traditional landline dial-up modem (modulator-  demodulator) is a communications device that covers or modulates  between an analog carrier signal and digital information to support  computer communications of PSTN lines. From about 1960 until the  mid-1990s, modems were a common means of WAN  communications. Modems have generally been replaced by digital  broadband technologies, including cable modems, fiber-optic  modems, DSL modems, satellite modems, 802.11 wireless, and  various forms of wireless modems. \nThe term modem is used incorrectly on any device  that does not actually perform modulation. Most modern devices  labeled as modems (cable, DSL, wireless, etc.) are routers, not  modems. Integrated cable modem routers contain both  functionalities of a modem and router in one device. \nBridges A bridge is used to connect two networks together—even  networks of different topologies, cabling types, and speeds—to  connect network segments that use the same protocol. A bridge  forwards traffic from one network to another. Bridges that connect  networks using different transmission speeds may have a buffer to  store packets until they can be forwarded to the slower network. This  is known as a store-and-forward device . Bridges operate at OSI \nLayer 2. Bridges were primarily used to connect hub networks  together and thus have mostly been replaced by switches. \nSwitches Switches manage the transmission of frames via MAC  address. Switches can also create separate broadcast domains when  used to create VLANs (see Chapter 12). Switches operate primarily at \nOSI Layer 2. When switches have additional features, such as routing  among VLANs, they can operate at OSI Layer 3 as well, known as \nLayer 3 switches. \nMPLS (Multiprotocol Label Switching) is a high-  throughput, high-performance network technology that directs  data across a network based on short path labels rather than  longer network addresses. This technique saves significant time  over traditional IP-based routing processes, which can be quite  complex. Furthermore, MPLS is designed to handle a wide range  of protocols through encapsulation. \nRouters Routers are used to control traffic flow on networks and  are often used to connect similar networks and control traffic flow  between the two. Routers manage traffic based on logical IP  addressing. They can function using statically defined routing tables,  or they can employ a dynamic routing system. Routers operate at \nOSI Layer 3. \nLAN Extenders A LAN extender is a remote access, multilayer  switch used to connect distant networks over WAN links. Aka WAN  switch or WAN router . \nJumpbox A jump server or jumpbox is a remote access system  deployed to make accessing a specific system or network easier or  more secure. A jump server is often deployed in extranets, screened  subnets, or cloud networks where a standard direct link or private  channel is not available or is not considered safe. A jump server can  be deployed to receive an in-band VPN connection, but most are  configured to accept out-of-band connections, such as direct dial-up  or internet-origin broadband links. No matter what form of  connection is used to access the jump server, it is important to  ensure that only encrypted connections are employed. \nSensor A sensor collects information and then transmits it back to  a central system for storage and analysis. Sensors are common  elements of fog computing, ICS, IoT, IDS/IPS, and SIEM/security  orchestration, automation, and response (SOAR) solutions. Many  sensors are based on an SoC (system on a chip). \nCollector A security collector is any system that gathers data into  a log or record file. A collector's function is similar to the functions of  auditing, logging, and monitoring. A collector watches for a specific  activity, event, or traffic and then records the information into a  record file. \nAggregators Aggregators are a type of multiplexor. Numerous  inputs are received and directed or transmitted to a single  destination. MPLS is an example of an aggregator. Some IDSs/IPSs  use aggregators to collect or receive input from numerous sensors  and collectors to integrate the data into a single data stream for  analysis and processing. \nSystem on a Chip (SoC) \nA system on a chip (SoC) is an integrated circuit (IC) or chip that  has all of the elements of a computer integrated into a single chip. \nThis often includes the main CPU, RAM, GPU, Wi-Fi, wired  networking, peripheral interfaces (such as USB), and power  management. In most cases, the only item missing from an SoC  compared to a full computer is bulk storage. Often, a bulk storage  device must be attached or connected to the SoC to store its  programs and other files since the SoC usually contains only  enough memory to retain its own firmware or OS. \nThe security risks of an SoC include the fact that the firmware or \nOS of an SoC is often minimal, which leaves little room for most  security features. An SoC may be able to filter input (such as by  length or to escape metacharacters), reject unsigned code,  provide basic firewall filtering, use communication encryption,  and offer secure authentication. However, these features are not  universally available on all SoC products. A few devices that use  an SoC include the mini-computer Raspberry Pi, fitness trackers,  smart watches, and some smartphones. \nNetwork Access Control \nNetwork access control (NAC) is the concept of controlling access to  an environment through strict adherence to and enforcement of  security policy. NAC is meant to be an automated detection and  response system that can react in real time to ensure that all  monitored systems are current on patches and updates and are in  compliance with the latest security configurations, as well as keep  unauthorized devices out of the network. The goals of NAC are as  follows: \nPrevent/reduce known attacks directly and zero-day indirectly \nEnforce security policy throughout the network \nUse identities to perform access control \nThe goals of NAC can be achieved through the use of strong, detailed  security policies that define all aspects of security control, filtering,  prevention, detection, and response for every device from client to  server and for every internal or external communication. \nOriginally, 802.1X (which provides port-based NAC) was thought to  embody NAC, but most supporters believe that 802.1X is only a  simple form of NAC or just one optional component in a complete \nNAC solution. \nNAC can be implemented with a preadmission philosophy or a  postadmission philosophy, or aspects of both: \nThe preadmission philosophy requires a system to meet all  current security requirements (such as patch application and  malware scanner updates) before it is allowed to communicate  with the network. \nThe postadmission philosophy allows and denies access based  on user activity, which is based on a predefined authorization  matrix. \nNAC options include using a host/system agent ( agent-based ) or  performing overall network monitoring and assessment ( agentless ). \nA typical operation of an agent-based NAC system would be to install  a NAC monitoring agent on each managed system. The NAC agent  retrieves a configuration file on a regular basis, possibly daily or  upon network connection, to check the current configuration  baseline requirements against the local system. If the system is not  compliant, it can be quarantined into a remediation subnet where it  can communicate only with the NAC server. The NAC agent can  download and apply updates and configuration files to bring the  system into compliance. Once compliance is achieved, the NAC agent  returns the system to the normal production network. \nNAC agents can be either dissolvable or permanent. A dissolvable \nNAC agent is usually written in a web/mobile language and is  downloaded and executed to each local machine when the specific  management web page is accessed (such as a captive portal). A  dissolvable NAC agent can be set to run once and then terminate. A  permanent NAC agent is installed onto the monitored system as a  persistent software background service. \nAn agentless or network monitoring and assessment NAC solution  performs port scans, service queries, and vulnerability scans against  networked systems from the NAC server to determine whether  devices are authorized and baseline compliant. An agentless system  requires an administrator to manually resolve any discovered issues. \nNAC systems can be implemented using both physical and virtual  solutions. Physical NAC appliances are dedicated hardware devices  that are deployed at key points in the network infrastructure. These  devices actively monitor and control network access based on  established policies. Virtual NAC solutions are software-based  implementations that can run on virtual machines or as part of  existing network infrastructure. They provide flexibility and  scalability, allowing organizations to deploy NAC capabilities without  dedicated hardware. \nOther issues around NAC include out-of-band versus in-band  monitoring, as well as resolving any remediation, quarantine, or  captive portal strategies. You should evaluate these and other NAC  concerns before implementation. \nFirewalls \nFirewalls are essential tools in managing, controlling, and filtering  network traffic. A firewall can be a hardware or software component  designed to protect one network segment from another. Firewalls are  deployed between areas of higher and lower trust, like a private  network and a public network (such as the Internet), or between two  network segments that have different security  levels/domains/classifications. Many commercial firewalls are  hardware-based and can be called hardware firewalls, appliance  firewalls, or network firewalls. \nA virtual firewall is a firewall created for use in a  virtualized or hypervisor environment or the cloud. A virtual  firewall is a software re-creation of an appliance firewall or a  standard host-based firewall installed into a guest OS in a VM. \nFirewalls filter traffic based on a defined set of rules, also called  filters or access control lists. They are basically a set of instructions  that are used to distinguish authorized traffic from unauthorized  and/or malicious traffic. Only authorized traffic is allowed to cross  the security barrier provided by the firewall. A typical firewall is  based on the deny-by-default or implicit deny security stance. Only  communications that meet an explicit allow exception are  transmitted toward their destination. This concept is also known as  allow listing. \nThe typical actions of a filter rule are allow, deny, drop, alert, and/or  log. Some firewalls use a first-match mechanism when applying  rules. Allow rules enable the packet to continue toward its  destination. Deny rules block the packet from going any further \n(effectively discarding it). When first-match is used, the first rule  that applies to the packet is followed, but no other rules are  considered. Thus, rules need to be placed in a priority order. A final  rule is the deny-all rule so that nothing is allowed to traverse the  firewall unless it is granted an explicit exception. However, some  firewalls perform a consolidated or accumulated result of all the  rules that match a packet. Such amalgamation firewalls do not have a  written or specific deny-all rule—instead they use implicit deny . This  method also ensures that only traffic meeting explicit allow rules \n(which is not explicitly denied) is allowed to pass. \nSometimes a firewall's rule set is referred to by the  term tuple . Tuple is a mathematical term meaning a collection of  related data items. Tuple is also used with databases, where it  references a record or row in a table. \nFirewalls are most effective against unrequested traffic, initiations  from outside the private network, and known malicious data,  messages, or packets based on content, application, protocol, port, or  source address. Most firewalls offer extensive logging, auditing, and  monitoring capabilities as well as alarms and basic IDS functions. \nA bastion host is a system specifically designed to  withstand attacks, such as a firewall appliance or a jump server. \nThe word bastion comes from medieval castle architecture. A  bastion guardhouse was positioned in front of the main entrance \n(typically on the other side of the moat from the castle, where it  controlled entrance onto the drawbridge) to serve as a first layer  of protection. Using this term to describe a host indicates that the  system is acting as a sacrificial host that will receive all inbound  attacks. \nCommon ingress filters and egress filters can be used to block  spoofed packets that often relate to malware, botnets, and other  unwanted activities. Examples include the following: \nBlocking inbound packets claiming to have an internal source  address \nBlocking outbound packets claiming to have an external source  address \nBlocking packets with source or destination addresses listed on a  block list (a list of known malicious IP addresses) \nBlocking packets that have source or destination addresses from  the local area network (LAN) but that haven't been officially  assigned to a host \nRemotely triggered black hole (RTBH) is an edge  filtering concept to discard unwanted traffic based on source or  destination address long before it reaches the destination. \nFirewalls, on their own, are typically unable to directly block viruses  or malicious code transmitted through otherwise authorized  communication channels, prevent unauthorized but accidental or  intended disclosure of information by users, prevent attacks by  malicious users already behind the firewall, or protect data after it  passes out of or into the private network. However, you can add  these features through special add-in modules or companion  products, such as antimalware scanners, DLP, and IDS tools. \nFirewall appliances are available that are preconfigured to perform  all (or most) of these add-on functions natively. These types of  firewall can be called a multifunction device (MFD), a unified threat  management (UTM) device, or a next-generation firewall (NGFW). \nIn addition to logging network traffic activity, firewalls should log  several other events: \nA reboot of the firewall \nProxies or dependencies unable to start or not starting \nProxies or other important services crashing or restarting \nChanges to the firewall configuration file \nA configuration or system error while the firewall is running \nFirewalls are only one part of an overall security solution. With a  firewall, many of the security mechanisms are concentrated in one  place, and thus a firewall can be a single point of failure. Firewall  failure is most commonly caused by human error and  misconfiguration. Firewalls provide protection only against traffic  that crosses the firewall. \nThere are several basic types of firewalls, which can be mixed to  create hybrid or complex firewall solutions: \nStatic Packet-Filtering Firewalls A static packet-filtering  firewall (aka screening router) filters traffic by examining data from  a message header. Usually, the rules are concerned with source and  destination IP address (Layer 3) and port numbers (Layer 4). This is  also a type of stateless firewall since each packet is evaluated  individually rather than in context (which is performed by a stateful  firewall). \nA stateless firewall analyzes packets on an individual  basis against the filtering access control lists (ACLs) or rules. The  context of the communication (that is, any previous packets) is  not used to make an allow or deny decision on the current packet. \nApplication-Level Firewalls An application-level firewall filters  traffic based on a single internet service, protocol, or application. \nApplication-level firewalls operate at the Application Layer (Layer 7)  of the OSI model. An example is the web application firewall (WAF). \nThis firewall may be implemented stateless or stateful. \nA web application firewall (WAF) is an appliance,  server add-on, virtual service, or system filter that defines a strict  set of communication rules for communications to and from a  website. It's intended to prevent web application attacks. \nA next-generation secure web gateway (SWG, NGSWG, NG- \nSWG) is a variation of and combination of the ideas of an NGFW  and a WAF. An SWG is a cloud-based web gateway solution that  is often tied to a subscription service that provides ongoing  updates to filters and detection databases. This cloud-based  firewall is designed to provide filtering services between CSP-  based resources and on-premises systems. An SWG/NG-SWG  often supports standard WAF functions; TLS decryption; cloud  access security broker (CASB) functions; advanced threat  protection (ATP), such as sandboxing and ML-based threat  detection; DLP; rich metadata about traffic; and detailed logging  and reporting. \nCircuit-Level Firewalls Circuit-level firewalls (aka circuit  proxies) are used to establish communication sessions between  trusted partners. In theory, they operate at the Session Layer (Layer \n5) of the OSI model (although in reality, they operate in relation to  the establishment of TCP sessions at the Transport Layer [Layer 4]). \nSOCKS (from Socket Secure, as in TCP/IP ports) is a common  implementation of a circuit-level firewall. Circuit-level firewalls focus  on the establishment of the circuit (or session), not the content of  traffic, based on simple rules for IP and port, using captive portals,  requiring port authentication via 802.1X, or more complex elements  such as context- or attribute-based access control. This is also a type  of stateless firewall. \nA TCP Wrapper is an application that can serve as a  basic firewall by restricting access to ports and resources based  on user IDs or system IDs. Using TCP Wrappers is a form of port-  based access control. \nStateful Inspection Firewalls Stateful inspection firewalls (aka  dynamic packet filtering firewalls ) evaluate the state, session, or  context of network traffic. By examining source and destination  addresses, application usage, source of origin (i.e., local or remote,  physical port, or even routed path/vector), and the relationship  between current packets and the previous packets of the same  session, stateful inspection firewalls are able to grant a broader range  of access for authorized users and activities and actively watch for  and block unauthorized users and activities. Stateful inspection  firewalls operate at OSI layers 3 and up. \nA stateful inspection firewall is aware that any valid outbound  communication (especially related to TCP) will trigger a  corresponding response or reply from the external entity. Thus, this  type of firewall automatically creates a temporary response rule for  the request. But that rule exists only as long as the conversation is  taking place. \nAdditionally, stateful inspection firewalls can retain knowledge of  previous packets in a conversation to detect unwanted or malicious  traffic that isn't noticeable or detectable when evaluating only  individual packets. This is known as context analysis or contextual  analysis. A stateful inspection firewall may also perform deep packet  inspection (DPI), which is the analysis of the payload or content of a  packet. \nDeep packet inspection (DPI) , payload inspection , or  content filtering is the means to evaluate and filter the payload  contents of a communication rather than only on the header  values. DPI can also be known as complete packet inspection and  information extraction. DPI filtering is able to block domain  names, malware, spam, malicious scripts, abusive content, or  other identifiable elements in the payload of a communication. \nDPI is often integrated with application-layer firewalls and/or  stateful inspection firewalls. \nNext-Generation Firewalls (NGFWs) A next-generation  firewall (NGFW) is a multifunction device (MFD) or unified threat  management (UTM) composed of several security features in  addition to a firewall; integrated components can include application  filtering, deep packet inspection, TLS offloading and/or inspection \n(aka TLS termination proxy), domain name and URL filtering, IDS, \nIPS, web content filtering, QoS management, bandwidth  throttling/management, NAT, VPN anchoring, authentication  services, identity management, and antivirus/antimalware scanning. \nA host-based firewall , local, software, or personal  firewall, is a security application that is installed on client  systems. A host-based firewall provides protection for the local  system from the activities of the user and from communications  from the network or the Internet. It can often limit  communications of installed applications and protocols and can  block externally initiated connections. A host-based firewall can  be a simple static filtering firewall, stateful inspection, or even an \nNGFW. \nInternal Segmentation Firewall (ISFW) An internal  segmentation firewall (ISFW) is a firewall deployed between  internal network segments or company divisions. Its purpose is to  prevent the further spread of malicious code or harmful protocols  already within the private network. With an ISFW, network  segments can be created without resorting to air gaps, VLANs, or  subnet divisions. An ISFW is commonly used in micro-segmentation  architectures. \nProxy \nA proxy server is a variation of an application-level firewall or  circuit-level firewall. A proxy server is used to mediate between  clients and servers. Proxies are most often used in the context of  providing clients on a private network with internet access while  protecting the identity of the clients. Often a proxy serves as a barrier  against external threats to internal clients by accepting requests from  clients, altering the source address of the requester, maintaining a  mapping of requests to clients, and sending the altered request  packets out. Once a reply is received, the proxy server determines  which client it is destined for by reviewing its mappings and then  sends the packets to the originally requesting client. This is  effectively NAT (see Chapter 12). In addition to features such as \nNAT, proxy servers can provide caching and site or content filtering. \nA forward proxy is a standard or common proxy that acts as an  intermediary for queries of external resources. A forward proxy  handles queries from internal clients when accessing outside  services. \nA reverse proxy provides the opposite function of a forward proxy; it  handles inbound requests from external systems to internally located  services. A reverse proxy is similar to the functions of port  forwarding and static NAT. A reverse proxy is sometimes used on the  border of a screened subnet to use private IP addresses on resource  servers but allows for visitors from the public internet. \nIf a client is not configured ( Figure 11.8, left) to send queries directly  to a proxy, but the network routes outbound traffic to a proxy  anyway, then a transparent proxy is in use. A nontransparent proxy  is in use when a client is configured ( Figure 11.8, right) to send  outbound queries directly to a proxy. The settings for a  nontransparent proxy can be set manually or using a proxy auto-  config (PAC) file. PAC can be implemented with a script or via \nDHCP. \nFIGURE 11.8 The configuration dialog boxes for a transparent (left)  versus a nontransparent (right) proxy \nContent/URL Filter \nContent filtering or content inspection is the security-filtering  function in which the contents of the application protocol payload  are inspected. Often, such inspection is based on keyword matching. \nA primary block list of unwanted terms, addresses, or URLs is used  to control what is or isn't allowed to reach a user. This is sometimes  known as deep packet inspection . Malware inspection is the use of a  malware scanner to detect unwanted software content in network  traffic. \nURL filtering , also known as web filtering , is the act of blocking  access to a site based on all or part of the URL used to request access. \nURL filtering can focus on all or part of a fully qualified domain  name (FQDN), specific pathnames, filenames, file extensions, or  entire URLs. Many URL-filtering tools can obtain updated primary \nURL block lists from vendors as well as allow administrators to add  or remove URLs from a custom list. \nA web security gateway is a device that is a web-content filter (often \nURL and content keyword–based) that also supports malware  scanning. Some web security gateways incorporate non-web features  as well, including instant messaging (IM) filtering, email filtering,  spam blocking, and spoofing detection. Thus, some are considered to  be UTMs or NGFWs. \nEndpoint Security \nManaging network security with filtering devices such as firewalls  and proxies is important, but you must not overlook the need for  endpoint security. Endpoint security is the concept that each  individual device must maintain local security, whether or not its  network or telecommunications channels also provide security. \nSometimes, this is expressed as “The end device is responsible for its  own security” or host-based security. However, a clearer perspective  is that any weakness in a network, whether on the border, on a  server, or on a client, presents a risk to all elements within the  organization. \nAs computing has evolved from a host/terminal model (where users  could be physically distributed, but all functions, activity, data, and  resources reside on a single centralized system) to a client/server  model (where users operate independent, fully functional desktop  computers but also access services and resources on networked  servers), security controls and concepts have had to evolve to follow  suit. This means that clients have computing and storage capabilities  and, typically, multiple servers do likewise. The concept of a  client/server model network is also known as a distributed system or  a distributed architecture . Thus, security must be addressed  everywhere instead of at a single centralized host. From a security  standpoint, this means that because processing and storage are  distributed on multiple clients and servers, all those computers must  be properly secured and protected. It also means that the network  links between clients and servers (and in some cases, these links may  not be purely local) must also be secured and protected. When  evaluating security architecture, be sure to include an assessment of  the needs and risks related to distributed architectures. \nDistributed architectures are prone to vulnerabilities that are  unthinkable in monolithic host/terminal systems. Desktop systems  can contain sensitive information that may be at some risk of being  exposed and must, therefore, be protected. Individual users may lack  general security savvy or awareness, and therefore, the underlying  architecture has to compensate for those deficiencies. Desktop PCs,  workstations, and laptops can provide avenues of access to critical  information systems elsewhere in a distributed environment because  users require access to networked servers and services to do their  jobs. By permitting user machines to access a network and its  distributed resources, organizations must also recognize that those  user machines can become threats if they are misused or  compromised. Such software and system vulnerabilities and threats  must be assessed and addressed properly. \nCommunications equipment can also provide unwanted points of  entry into a distributed environment. For example, modems attached  to a desktop machine that's also attached to an organization's  network can make that network vulnerable to dial-in attacks. There  is also a risk that wireless adapters on client systems can be used to  create open networks. Likewise, users who download data from the \nInternet increase the risk of infecting their own and other systems  with malicious code, Trojan horses, and so forth. Desktops, laptops,  tablets, mobile phones, and workstations—and associated disks or  other storage devices—may not be secure from physical intrusion or  theft. Finally, when data resides only on client machines, it may not  be secured with a proper backup (it's often the case that although  servers are backed up routinely, the same is not true for client  computers). \nYou should see that the foregoing litany of potential vulnerabilities in  distributed architectures means that such environments require  numerous safeguards to implement appropriate security and to  ensure that such vulnerabilities are eliminated, mitigated, or  remedied. Clients must be subjected to policies that impose  safeguards on their contents and their users' activities. \nThese include the following: \nEmail must be screened so that it cannot become a vector for  infection by malicious software; email should also be subject to  policies that govern appropriate use and limit potential liability. \nDownload/upload policies must be created so that incoming and  outgoing data is screened and suspect materials are blocked. \nSystems must be subject to robust access controls, which may  include multifactor authentication and/or biometrics to restrict  access to end-user devices and to prevent unauthorized access to  servers and services. \nRestricted user-interface mechanisms and database  management systems should be installed, and their use  required, to restrict and manage access to critical information so  that users have minimal but necessary access to sensitive  resources. \nFile encryption may be appropriate for files and data stored on  client machines (indeed, drive-level encryption is a good idea for  laptops and other mobile computing gear that is subject to loss  or theft outside an organization's premises). \nEnforce screen savers after a timeout. This will hide any  confidential materials behind a screen saver, which should then  require a valid login to regain access to the desktop,  applications, storage devices, and so forth. \nIt's essential to separate and isolate processes that run in user  and supervisory modes so that unauthorized and unwanted  access to high-privilege processes and capabilities is prevented. \nProtection domains or network segments should be created so  that the compromise of a client won't automatically compromise  an entire network. \nDisks and other sensitive materials should be clearly labeled  according to their security classification or organizational  sensitivity; procedural processes and system controls should  combine to help protect sensitive materials from unwanted or  unauthorized access. \nFiles on desktop machines, as well as files on servers, should be  backed up—ideally, using some form of centralized backup  utility that works with client agent software to identify and  capture files from clients stored in a secure backup storage  archive. \nDesktop users need regular security awareness training to  maintain proper security awareness; they also need to be  notified about potential threats and instructed on how to deal  with them appropriately. \nDesktop computers and their storage media require protection  against environmental hazards (temperature, humidity, power  loss/fluctuation, and so forth). \nDesktop computers should be included in your organization's  disaster recovery and business continuity planning because  they're potentially as important as (if not more important than)  other systems and services in getting users back to work on  other systems. \nDevelopers of custom software built-in and for distributed  environments also need to take security into account, including  using formal methods for development and deployment, such as  code libraries, change control mechanisms, configuration  management, and patch and update deployment. \nIn general, safeguarding distributed environments means  understanding the vulnerabilities to which they're subject and  applying appropriate safeguards. These can (and do) range from  technology solutions and controls to policies and procedures that  manage risk and seek to limit or avoid losses, damage, unwanted  disclosure, and so on. Configuring security on numerous endpoint  devices can be complex, time-consuming, and tedious. The use of  system imaging of a properly configured primary device will ensure  the application of a consistent baseline across the upgraded endpoint  devices. \nEndpoint detection and response (EDR) is a security mechanism  that is an evolution of traditional antimalware products, IDS, and  firewall solutions. EDR seeks to detect, record, evaluate, and respond  to suspicious activities and events, which may be caused by  problematic software or by valid and invalid users. It is a natural  extension of continuous monitoring focusing on both the endpoint  device itself and network communications reaching the local  interface. Some EDR solutions employ an on-device analysis engine,  whereas others report events back to a central analysis server or to a  cloud solution. The goal of EDR is to detect abuses that are  potentially more advanced than what can be detected by traditional  antivirus programs or HIDSs, while optimizing the response time of  incident response, discarding false positives, implementing blocking  for advanced threats, and protecting against multiple threats  occurring simultaneously and via various threat vectors. \nA few related concepts to EDR include managed detection and  response (MDR), endpoint protection platform (EPP), and extended  detection and response (XDR). MDR focuses on threat detection and  mediation but is not limited to the scope of endpoints. MDR is a  service that attempts to monitor an IT environment in real time to  quickly detect and resolve threats. Often, an MDR solution is a  combination and integration of numerous technologies, including \nSIEM, network traffic analysis (NTA), EDR, and IDS. \nEPP is a variation of EDR, much like IPS is a variation of IDS. The  focus of EPP is on four main security functions: predict, prevent,  detect, and respond. Thus, EPP is the more active prevent and  predict variation of the more passive EDR concept. \nXDR is not so much another tool as the collection and integration of  several concepts into a single solution. XDR components can vary  between vendors, but they often include EDR, MDR, and EPP  elements. Also, XDR is not solely focused on endpoints, but often  includes NTA, NIDS, and NIPS functions as well. \nFrom there, we might as well mention that a managed security  service provider (MSSP) can provide XDR solutions that are  centrally controlled and managed. MSSP solutions can be deployed  fully on-premises, fully in the cloud, or as a hybrid structure. MSSP  solutions can be overseen through an SOC, which is itself local or  remote. Typically, working with an MSSP to provide EDR, MDR, \nEPP, or XDR services can allow an organization to gain the benefits  of these advanced security products and leverage the experience and  expertise of the MSSP's staff of security management and response  professionals. \nCabling, Topology, and Transmission Media Technology \nEstablishing security on a network involves more than just managing  the operating system and software. You must also address physical  issues, including cabling, topology, and transmission media  technology. \nLANs vs. WANs \nThere are two basic types of networks: LANs and WANs. A local  area network (LAN) is a network in a limited geographical area,  typically spanning a single floor or building. Wide area network \n(WAN) is the term usually assigned to the long-distance  connections between geographically remote networks. \nTransmission Media \nTransmission media refers to the physical pathways or channels  through which data is transmitted from one location to another. The  characteristics of transmission media impact the quality and  reliability of signal propagation. The type of connectivity media  employed in a network is important to the network's design, layout,  and capabilities. Without the right transmission media, a network  may not be able to span your entire enterprise, or it may not support  the necessary traffic volume. In fact, the most common causes of  network failure (in other words, violations of availability) are cable  failures or misconfigurations. It is important for you to understand  that different types of network devices and technologies are used  with different types of cabling. Each cable type has unique useful  lengths, throughput rates, and connectivity requirements. \nPhysical protection measures, such as using secure conduits,  enclosures, and access controls, help prevent unauthorized  tampering with transmission media. Implementing encryption  technologies ensures that even if the transmission medium is  physically accessed, the data remains secure and unreadable without  the proper decryption keys. \nIn the realm of transmission media signal propagation quality,  several factors come into play: \nAttenuation: This refers to the loss of signal strength as it  travels through the medium. Over longer distances, attenuation  can significantly reduce the signal's strength, potentially leading  to degradation. \nInterference: Unwanted signals that disrupt the transmission  fall under interference. Sources such as electromagnetic  interference (EMI) and radio-frequency interference (RFI) can  disturb the signal and impact the overall quality of  communication. \nNoise: Unwanted random variations in the signal constitute  noise. Noise can distort the original signal, complicating the  accurate interpretation of transmitted data. \nJitter: The variation in latency between different packets. \nBandwidth: The range of frequencies that a medium can  support is defined as bandwidth. A higher bandwidth allows for  the transmission of more data, contributing to improved signal  quality and faster communication. \nPropagation delay or latency: The time taken for a signal to  travel from the sender to the receiver is known as propagation  delay. Propagation delay directly influences the speed of  communication, and in certain applications, minimizing this  delay is crucial. \nUnderstanding and addressing these factors are essential  components of designing reliable and efficient transmission systems,  ensuring optimal performance and data integrity in communication  networks. \nRemember that many forms of transmission media are not cables. \nThis includes wireless, Bluetooth, Zigbee, and satellites, which were  all discussed earlier in this chapter. \nCoaxial Cable \nCoaxial cable , also called coax , was a popular networking cable type  used throughout the 1970s and 1980s. In the early 1990s, its use  quickly declined because of the popularity and capabilities of  twisted-pair wiring (explained in more detail later). In the 2020s,  you are unlikely to encounter coax being used as a LAN network  cable but may still see some use of it as an audio/visual connection  cable (such as between an over-the-air antenna and your television)  or as an internet access media (such as from the wall to your cable  modem). \nCoaxial cable has a center core of copper wire surrounded by a layer  of insulation, which is in turn surrounded by a conductive braided  shielding and encased in a final insulation sheath. There are two  legacy types of coaxial cable: thinnet and thicknet. Thinnet (10Base2)  was commonly used to connect systems to backbone trunks of  thicknet cabling. Thinnet can span distances of 185 meters and  provide throughput up to 10 Mbps. Thicknet (10Base5) can span 500  meters and provide throughput up to 10 Mbps. A more modern coax  format is RG6, which is commonly used for various applications in  telecommunications, audio/video, and broadband communication  systems. \nThe most common problems with coax cable are as follows: \nBending the coax cable past its maximum arc radius and thus  breaking the center conductor \nDeploying the coax cable in length greater than its maximum  recommended length (which is 185 meters for 10Base2 or 500  meters for 10Base5) \nNot properly terminating the ends of the coax cable with a 50-  ohm BNC resistor \nNot grounding at least one end of a terminated coax cable \nBaseband and Broadband Cables \nThe naming convention used to label most network cable  technologies follows the syntax XXyyyyZZ . XX represents the  maximum speed the cable type offers, such as 10 Mbps for a 10Base2  cable. The next series of letters, yyyy , represents the baseband or  broadband aspect of the cable, such as baseband for a 10Base2 cable. \nBaseband cables can transmit only a single signal at a time, and  broadband cables can transmit multiple signals simultaneously. \nMost networking cables are baseband cables. However, when used in  specific configurations, coaxial cable can be used as a broadband  connection, such as RG6 coax used with cable modems. ZZ either  represents the maximum distance the cable can be used or acts as  shorthand to represent the technology of the cable, such as the  approximately 200 meters for 10Base2 cable (actually 185 meters,  but it's rounded up to 200) or T or TX for twisted-pair in 100BaseT  or 100BaseTX. \nTwisted-Pair \nTwisted-pair cabling is extremely thin and flexible compared to  coaxial cable. It consists of four pairs of wires that are twisted around  each other and then sheathed in a PVC insulator. If there is a metal  foil wrapper around the wires underneath the external sheath, the  wire is known as shielded twisted-pair (STP) . The foil provides  additional protection from external EMI. Twisted-pair cabling  without the foil is known as unshielded twisted-pair (UTP) . \nThe wires that make up UTP and STP are small, thin copper wires  that are twisted in pairs. The twisting of the wires provides  protection from external radio frequencies and electric and magnetic  interference and reduces crosstalk between pairs. Crosstalk occurs  when data transmitted over one set of wires is picked up by another  set of wires due to radiating electromagnetic fields produced by the  electrical current. Each wire pair within the cable is twisted at a  different rate (in other words, twists per foot); thus, the signals  traveling over one pair of wires cannot cross over onto another pair  of wires (at least within the same cable). The tighter the twist (the  more twists per foot), the more resistant the cable is to internal and  external interference and crosstalk, and thus, the capacity for  throughput (that is, higher bandwidth) is greater. \nThere are several classes of UTP cabling. The various categories are  created through the use of tighter twists of the wire pairs, variations  in the quality of the conductor, and variations in the quality of the  external shielding. Table 11.4 shows the original UTP categories. \nTABLE 11.4 UTP categories \nUTP Throughput Notes  category \nCat 1 1 Mbps Primarily used for voice. Not suitable  for networks, but usable by modems. \nCat 2 4 Mbps Original Token Ring networks and host-  to-terminal connections on mainframes. \nCat 3 10 Mbps Primarily used in Ethernet networks \n(10BaseT) and as telephone cables. \nCat 4 16 Mbps Primarily used in Token Ring networks. \nCat 5 100 Mbps Used in 100BaseTX, FDDI, and ATM  networks. \nCat 5e 1 Gbps Gigabit Ethernet (1000BaseT). \nCat 6 1 Gbps Gigabit Ethernet (10G Ethernet with 55-  meter distance limit). \nCat 6a 10 Gbps Gigabit Ethernet, 10G Ethernet. \nCat 7 10 Gbps Gigabit Ethernet, 10G Ethernet. \nCat 8 40 Gbps 10G+ Ethernet. \nThe following problems are the most common with twisted-pair  cabling: \nUsing the wrong category of twisted-pair cable for high-  throughput networking \nDeploying a twisted-pair cable longer than its maximum  recommended length (in other words, 100 meters) \nUsing UTP in environments with significant interference \nConductors \nThe distance limitations of conductor-based network cabling stem  from the resistance of the metal used as a conductor. Copper, the  most popular conductor, is one of the best and least expensive room-  temperature conductors available. However, it is still resistant to the  flow of electrons. This resistance results in a degradation of signal  strength and quality over the length of the cable. \nThe maximum length defined for each cable type indicates the point  at which the level of degradation could begin to interfere with the  efficient transmission of data. This degradation of the signal is  known as attenuation . It is often possible to use a cable segment that  is longer than the cable is rated for, but the number of errors and  retransmissions will be increased over that cable segment, ultimately  resulting in poor network performance. Attenuation is more  pronounced as the speed of the transmission increases. We  recommend that you use shorter cable lengths as the speed of the  transmission increases. \nLong cable lengths can often be supplemented through the use of  repeaters or concentrators. A repeater is a signal amplification  device, much like the amplifier for your car or home stereo. The  repeater boosts the signal strength of an incoming data stream and  rebroadcasts it through its second port. A concentrator does the  same thing except it has more than two ports. However, using more  than four repeaters (or hubs) in a row is discouraged (see the sidebar \n“5-4-3 Rule”). \n5-4-3 Rule \nThe 5-4-3 rule is used whenever Ethernet or other IEEE 802.3  shared-access networks are deployed using hubs and repeaters as  network connection devices in a tree topology (in other words, a  central trunk with various splitting branches). This rule defines  the number of repeaters/concentrators and segments that can be  used in a network design. The rule states that between any two  nodes (a node can be any type of processing entity, such as a  server, client, or router), there can be a maximum of five  segments connected by four repeaters/concentrators, and it  states that only three of those five segments can be populated (in  other words, have additional or other host or networking device  connections). \nThe 5-4-3 rule does not apply to switched networks or the use of  bridges or routers. \nFiber-Optic Cables \nAn alternative to conductor-based network cabling is fiber-optic  cable. Fiber-optic cables transmit pulses of light rather than  electricity. This gives fiber-optic cable the advantage of being  extremely fast and nearly impervious to tapping and interference. \nFiber will typically cost more to deploy than twisted pair, but its price  premium has decreased to be more in line with other deployments  and is often well worth the expense for its security, interference  resilience, and performance. Fiber can be deployed as single-mode \n(supporting a single light signal) or multimode (supporting multiple  light signals). Single-mode fiber has a thinner optical core, lower  attenuation over distance, and potentially unlimited bandwidth. It  uses a 1310 nm or 1550 nm wavelength laser, can be deployed in runs  up to 10 km without repeaters, and is typically sheathed in yellow. \nMultimode fiber has a larger optical core, higher attenuation over  distance, and bandwidth limitations (inversely related to distance),  and it uses 850 nm or 1300 nm wavelength LEDs or lasers, has a  maximum run length of 400m, and is typically sheathed in blue,  aqua, or orange. \nDense Wavelength Division Multiplexing (DWDM) is an optical  communication technology used in fiber-optic communication  systems to increase the capacity and efficiency of the network. \nDWDM enables multiple data streams or channels to be  simultaneously transmitted over a single optical fiber, each using a  different wavelength of light. This allows for the simultaneous  transmission of a large number of independent signals, significantly  increasing the overall capacity of the fiber-optic infrastructure. \nTransport Architecture \nThe transport architecture in networking encompasses several key  aspects. First, network topology refers to the physical or logical  layout of devices and connections, including configurations like bus,  ring, star, mesh, tree, and hybrid. The chosen topology influences  factors such as scalability, fault tolerance, and ease of management. \nNetwork topologies are discussed in the next section. \nSecond, transport architecture is often focused on the concept of  planes. The concept of network architecture planes refers to the  division of networking functionality and responsibilities into distinct  layers or planes, each serving a specific purpose. This separation  helps in organizing and managing the different aspects of network  operations. The three primary planes in network architecture are the  data plane, control plane, and management plane. The data plane, or  forwarding plane, is responsible for the transmission of user data  between network devices, performing tasks like packet forwarding,  switching, and routing. The control plane manages and maintains  forwarding tables used by the data plane, handling activities such as  routing protocols and decision-making on data forwarding. The  management plane is in charge of overall network device  administration, covering tasks like configuration, monitoring,  performance analysis, and network maintenance. The separation of  these planes allows for modular design, scalability, and the ability to  upgrade or modify one plane without affecting the others. \nA third critical consideration in transport architecture is the choice  between cut-through and store-and-forward switching. Cut-through  switching forwards a frame as soon as it reads the destination  address, providing low latency and suitability for low-latency  applications. On the other hand, store-and-forward switching  receives and stores the entire frame in a buffer before forwarding,  offering greater error checking and suitability for ensuring data  integrity. The selection between cut-through and store-and-forward  depends on factors such as network requirements, latency  sensitivity, and the level of error checking needed. \nUnderstanding and designing the transport architecture is essential  for optimizing network performance, managing resources efficiently,  and ensuring that the network meets its intended requirements. \nNetwork Topologies \nThe physical layout and organization of computers and networking  devices is known as the network topology. The logical topology is the  grouping of networked systems into trusted collectives. The physical  topology is not always the same as the logical topology. There are  four basic topologies of the physical layout of a network: \nRing Topology A ring topology connects each system as points  on a circle (see Figure 11.9). The connection medium acts as a  unidirectional transmission loop. Only one system can transmit data  at a time. Traffic management is performed by a token. A token is a  digital hall pass that travels around the ring until a system grabs it. A  system in possession of the token can transmit data. Data and the  token are transmitted to a specific destination. As the data travels  around the loop, each system checks to see whether it is the intended  recipient of the data. If not, it passes the token on. If so, it reads the  data. Once the data is received, the token is released and returns to  traveling around the loop until another system grabs it. If any one  segment of the loop is broken, all communication around the loop  ceases. Some implementations of ring topologies employ a fault  tolerance mechanism, such as dual loops running in opposite  directions, to prevent single points of failure. \nFIGURE 11.9 A ring topology \nBus Topology A bus topology connects each system to a trunk or  backbone cable. All systems on the bus can transmit data  simultaneously, which can result in collisions. A collision occurs  when two systems transmit data at the same time; the signals  interfere with each other. To avoid this, the systems employ a  collision avoidance mechanism that basically “listens” for any other  currently occurring traffic. If traffic is heard, the system waits a few  moments and listens again. If no traffic is heard, the system  transmits its data. When data is transmitted on a bus topology, all  systems on the network hear the data. If the data is not addressed to  a specific system, that system just ignores the data. The benefit of a  bus topology is that if a single segment fails, communications on all  other segments continue uninterrupted. However, the central trunk  line remains a single point of failure. \nThere are two types of bus topologies: linear and tree. A linear bus  topology employs a single trunk line with all systems directly  connected to it. A tree topology employs a single trunk line with  branches that can support multiple systems. Figure 11.10 illustrates  both types. The primary reason a bus is rarely if ever used today is  that it must be terminated at both ends and any disconnection can  take down the entire network. \nFIGURE 11.10 A linear bus topology and a tree bus topology \nStar Topology A star topology employs a centralized connection  device. This device can be a simple hub or switch. Each system is  connected to the central hub by a dedicated segment (see Figure \n11.11). If any one segment fails, the other segments can continue to  function. However, the central hub is a single point of failure. \nGenerally, the star topology uses less cabling than other topologies  and makes the identification of damaged cables easier. \nFIGURE 11.11 A star topology \nA logical bus can be implemented as a physical star. Ethernet is a  bus-based technology. It can be deployed as a physical star, but the  hub or switch device is actually internally a logical bus connection  device. \nMesh Topology A mesh topology connects systems to other  systems using numerous paths (see Figure 11.12). A full-mesh  topology connects each system to all other systems on the network. A  partial-mesh topology connects many systems to many other  systems. Mesh topologies provide redundant connections to systems,  allowing multiple segment failures without seriously affecting  connectivity. \nFIGURE 11.12 A mesh topology \nEthernet \nEthernet is a shared-media LAN technology (aka a broadcast  technology). That means it allows numerous devices to communicate  over the same medium but requires that the devices take turns  communicating and performing collision detection and avoidance. \nEthernet employs broadcast and collision domains (see the general  feature “Collision Domains vs. Broadcast Domains”). Ethernet is an  example of a media access methodology. \nEthernet can support full-duplex communications (in other words,  full two-way) and usually employs twisted-pair cabling. (Coaxial  cabling was originally used.) Ethernet is most often deployed on star  or bus topologies. Ethernet is based on the IEEE 802.3 standard. \nIndividual units of Ethernet data are called frames . Fast Ethernet  supports 100 Mbps throughput. Gigabit Ethernet supports 1,000 \nMbps (1 Gbps) throughput. 10 Gigabit Ethernet supports 10,000 \nMbps (10 Gbps) throughput. \nSub-Technologies \nMost networks comprise numerous technologies rather than a single  technology. For example, Ethernet is not just a single technology but  a superset of sub-technologies that support its common and expected  activity and behavior. Ethernet includes the technologies of digital  communications, synchronous communications, and baseband  communications, and it supports broadcast, multicast, unicast, and  anycast communications and Carrier-Sense Multiple Access with \nCollision Detection (CSMA/CD). \nLAN technologies may include many of the sub-technologies  described in the following sections. \nAnalog and Digital \nOne sub-technology common to many forms of network  communications is the mechanism used to actually transmit signals  over a physical medium, such as a cable. There are two types: \nAnalog communications occur with a continuous signal that  varies in frequency, amplitude, phase, voltage, and so on. The  variances in the continuous signal produce a wave shape (as  opposed to the square shape of a digital signal). The actual  communication occurs by variances in the constant signal. \nDigital communications occur through the use of a  discontinuous electrical signal and a state change or on-off  pulses. \nDigital signals are more reliable than analog signals over long  distances or when interference is present. This is because of a digital  signal's definitive information storage method employing direct  current voltage where voltage-on represents a value of 1 and voltage-  off represents a value of 0. These on-off pulses create a stream of  binary data. Analog signals become altered and corrupted because of  attenuation over long distances and interference. Since an analog  signal can have an infinite number of variations used for signal  encoding as opposed to digital signals' two states, unwanted  alterations to the signal make extraction of the data more difficult as  the degradation increases. \nSynchronous and Asynchronous \nSome communications are synchronized with some sort of clock or  timing activity. Communications are either synchronous or  asynchronous: \nSynchronous communications rely on a timing or clocking  mechanism based on either an independent clock or a  timestamp embedded in the data stream. Synchronous  communications are typically able to support very high rates of  data transfer. \nAsynchronous communications rely on stop and start delimiters  to manage the transmission of data. Because of the use of  delimiters and the stop and start nature of its transmission,  asynchronous communication is best suited for smaller amounts  of data. PSTN modems are good examples of asynchronous  communication devices. \nBaseband and Broadband \nHow many communications can occur simultaneously over a cable  segment depends on whether you use baseband technology or  broadband technology: \nBaseband technology can support only a single communication  channel. It uses a direct current applied to the cable. A current  that is at a higher level represents the binary signal of 1, and a  current that is at a lower level represents the binary signal of 0. \nBaseband is a form of digital signal. Ethernet is a baseband  technology. \nBroadband technology can support multiple simultaneous  signals. Broadband uses frequency modulation to support  numerous channels, each supporting a distinct communication  session. Broadband is suitable for high throughput rates,  especially when several channels are multiplexed. Broadband is  a form of analog signal. Cable television and cable modems,  fiber optics, satellite, DSL, T1, and T3 are examples of  broadband technologies. \nCasting Technologies \nCasting technologies determine how many destinations a single  transmission can reach: \nBroadcast technology supports communications to all possible  recipients. \nMulticast technology supports communications to multiple  specific recipients. \nUnicast technology supports only a single communication to a  specific recipient. \nAnycast technology supports communications where a single  sender transmits data to the nearest or best-suited node among  a group of potential receivers. The goal is to deliver data to the \n“nearest” or “best” node in terms of network topology or routing  metrics. \nGeocast technology supports communications where data is sent  to all devices within a specific geographical area. It is a one-to-  all communication paradigm limited to a particular geographic  region, and devices outside that area do not receive the  broadcast. \nLAN Media Access \nMedia access protocols in LANs dictate how multiple devices within  a network contend for the right to access the shared communication  medium. There are several methods used to manage and control  access to the communication medium in LANs: \nArbitration is a media access protocol where a central authority  or a predefined set of rules determines which device has the  right to access the communication medium at any given time. \nDevices interested in transmitting data request permission from  the central authority or follow established rules to access the  medium. This approach is often used in centralized network  architectures. Time Division Multiple Access (TDMA), as an  example, divides time into fixed slots, and a central authority,  such as a base station or network controller, assigns specific  time slots to each device. Devices are allowed to transmit only  during their allocated time slots, avoiding collisions. \nDeconfliction is a media access protocol that aims to avoid  collisions and conflicts by assigning specific time slots or  frequency bands to different devices for communication. Each  device is allocated a dedicated time slot or frequency range  during which it can transmit data without interference from  other devices. Time-division multiplexing (TDM) and frequency-  division multiplexing (FDM) are common techniques used for  deconfliction. \nContention-based protocols allow devices to contend for access  to the communication medium. Devices transmit data when  they have information to send and contend with other devices  for the right to transmit. When multiple devices attempt to  transmit simultaneously, collisions may occur. Contention-  based protocols often include mechanisms to detect and manage  collisions, such as Carrier Sense Multiple Access with Collision \nDetection (CSMA/CD) or Carrier Sense Multiple Access with \nCollision Avoidance (CSMA/CA). \nThe choice of a specific media access protocol depends on factors  such as network architecture, traffic patterns, and the desired trade-  off between simplicity and efficiency. \nThere are numerous LAN media access technologies that are used to  avoid or prevent transmission collisions. These technologies define  how multiple systems, all within the same collision domain, are to  communicate. Some of these technologies actively prevent collisions,  whereas others respond to collisions. \nCarrier-Sense Multiple Access (CSMA) This is an arbitration \nLAN media access technology that performs communications using  the following steps: \n1. The host listens to the LAN media to determine whether it is in  use. \n2. If the LAN media is not being used, the host transmits its  communication. \n3. The host waits for an acknowledgment. \n4. If no acknowledgment is received after a timeout period, the  host starts over at step 1. \nCSMA does not directly address collisions. If a collision occurs, the  communication would not have been successful, and thus an  acknowledgment would not be received. This causes the sending  system to retransmit the data and perform the CSMA process again. \nCarrier-Sense Multiple Access with Collision Detection \n(CSMA/CD) This is a contention-based LAN media access  technology that performs communications using the following steps: \n1. The host listens to the LAN media to determine whether it is in  use. \n2. If the LAN media is not being used, the host transmits its  communication. \n3. While transmitting, the host listens for collisions (in other  words, two or more hosts transmitting simultaneously). \n4. If a collision is detected, the host transmits a jam signal. \n5. If a jam signal is received, all hosts stop transmitting. Each host  waits a random period of time and then starts over at step 1. \nEthernet networks employ the CSMA/CD technology. CSMA/CD  responds to collisions by having each member of the collision  domain wait for a short but random period of time before starting  the process over. Unfortunately, allowing collisions to occur and  then responding or reacting to collisions causes delays in  transmissions as well as a required repetition of transmissions. This  results in about 40 percent loss in potential throughput. \nCarrier-Sense Multiple Access with Collision Avoidance \n(CSMA/CA) This is a contention-based LAN media access  technology that performs communications using the following steps: \n1. The host has two connections to the LAN media: inbound and  outbound. The host listens on the inbound connection to  determine whether the LAN media is in use. \n2. If the LAN media is not being used, the host requests permission  to transmit. \n3. If permission is not granted after a timeout period, the host  starts over at step 1. \n4. If permission is granted, the host transmits its communication  over the outbound connection. \n5. The host waits for an acknowledgment. \n6. If no acknowledgment is received after a time-out period, the  host starts over at step 1. \n802.11 wireless networking is an example of a network that employs \nCSMA/CA technologies. CSMA/CA attempts to avoid collisions by  granting only a single permission to communicate at any given time. \nThis system requires the designation of a primary system, which  responds to the requests and grants permission to send data  transmissions. \nToken Passing This is an arbitration LAN media access technology  that performs communications using a digital token. Possession of  the token allows a host to transmit data. Once its transmission is  complete, it releases the token to the next system. Token passing was  used by ring topology–based networks, such as legacy Token Ring  and Fiber Distributed Data Interface (FDDI). Token passing prevents  collisions since only the system possessing the token is allowed to  transmit data. \nPolling This is an arbitration LAN media access technology that  performs communications using a primary-secondary configuration. \nOne system is labeled as the primary system. All other systems are  labeled as secondary. The primary system polls or inquires of each  secondary system in turn whether they have a need to transmit data. \nIf a secondary system indicates a need, it is granted permission to  transmit. Once its transmission is complete, the primary system  moves on to poll the next secondary system. Mainframes often  supported polling. \nPolling addresses collisions by attempting to prevent them from  using a permission system. Polling is an inverse of the CSMA/CA  method. Both use primary and secondary systems, but although \nCSMA/CA allows the secondary system to request permissions,  polling has the primary system offer permission. Polling can be  configured to grant one system (or more) priority over other systems. \nFor example, if the standard polling pattern was 1, 2, 3, 4, then to  give system 1 priority, the polling pattern could be changed to 1, 2, 1, \n3, 1, 4. \nSummary \nThe tasks of designing, deploying, and maintaining security on a  network require intimate knowledge of the technologies involved in  networking. This includes protocols, services, communication  mechanisms, topologies, cabling, endpoints, and networking devices. \nThe OSI model is a standard against which all protocols are  evaluated. Understanding how the OSI model is used and how it  applies to real-world protocols can help system designers and system  administrators improve security. The TCP/IP model is derived  directly from the TCP/IP protocol suite and roughly maps to the OSI  model. \nMost networks employ TCP/IP as the primary protocol. IP  networking includes IPv4 and IPv6. IPv4 is the version of Internet \nProtocol that is most widely used around the world. IPv6 is being  rapidly adopted for both private and public network use. DNS and \nARP were developed to interchange or resolve between domain  names and IP addresses or IP addresses and MAC addresses,  respectively. TCP/IP supports many secure protocols, including \nIPSec, SSH, and protocols encrypted by TLS. TCP/IP is a multilayer  protocol suite that allows for flexibility, resiliency, and encryption. \nConverged protocols are common on modern networks, including \nVoIP and iSCSI. SDN and CDN have expanded the definition of  network as well as expanded the use cases for it. \nMicro-segmentation divides an internal network into numerous  subzones to allow for greater security and control of  communications, which in turn supports a zero-trust security policy. \nWireless communications occur in many forms, including cell phone, \nBluetooth (802.15.1 and Bluetooth SIG), RFID, NFC, and Wi-Fi  networking (802.11). Wireless communication is more vulnerable to  interference, eavesdropping, denial of service, and AitM attacks. \nRouters, hubs, switches, repeaters, gateways, proxies, NAC, and  firewalls are an important part of a network's security. Firewalls are  essential tools in managing, controlling, and filtering network traffic. \nEndpoint security is the concept that each individual device must  maintain local security whether or not its network or  telecommunications channels also provide security. \nA wide range of hardware components can be used to construct a  network, not the least of which is the cabling used to tie all the  devices together. Understanding the strengths and weaknesses of  each transmission media type is part of designing a secure network. \nStudy Essentials \nKnow the OSI model layers. The OSI layers are as follows: \nApplication, Presentation, Session, Transport, Network, Data Link,  and Physical. \nKnow the network container names. The network containers  are: OSI layers 7–5 protocol data unit (PDU), Layer 4 segment (TCP)  or a datagram (UDP), Layer 3 packet, Layer 2 frame, and Layer 1  bits. \nUnderstand the MAC address. Media Access Control (MAC)  address is a 6-byte (48-bit) binary address written in hexadecimal  notation, aka hardware address, physical address, the NIC address,  and the Ethernet address. The first 3 bytes (24 bits) of the address is  the organizationally unique identifier (OUI), which denotes the  vendor or manufacturer. \nUnderstand the TCP/IP model. Also known as DARPA or the \nDOD model, the model has four layers: Application (also known as \nProcess), Transport (also known as Host-to-Host), Internet \n(sometimes known as Internetworking), and Link (although the  terms Network Interface and sometimes Network Access are used). \nUnderstand DNS. The Domain Name System (DNS) is the  hierarchical naming scheme used in both public and private  networks. DNS links human-friendly fully qualified domain names \n(FQDNs) and IP addresses together. DNSSEC and DoH are DNS  security features. \nUnderstand DNS poisoning. DNS poisoning is the act of  falsifying the DNS information used by a client to reach a desired  system. It can be accomplished through a rogue DNS server,  pharming, altering a hosts file, corrupting IP configuration, DNS  query spoofing, and proxy falsification. \nKnow about ARP. Address Resolution Protocol (ARP) is  essential to the interoperability of logical and physical addressing  schemes. ARP is used to resolve IP addresses into MAC addresses. \nAlso, know about ARP poisoning. \nKnow about micro-segmentation. Micro-segmentation is  dividing up an internal network into numerous subzones, potentially  as small as a single device, such as a high-value server or even a  client or endpoint device. Each zone is separated from the others by  internal segmentation firewalls (ISFWs), subnets, or VLANs. \nKnow about edge networks. An edge network is a carefully  designed data architecture that strategically allocates computing  resources to edge devices within a network. This design helps  distribute processing power demands away from central servers,  empowering the devices to handle a significant portion of the  processing workload. \nUnderstand the various wireless technologies. Cell phones, \nBluetooth (802.15.1 and Bluetooth SIG), and Wi-Fi wireless  networking (802.11) are all called wireless technologies, even though  they are all different. Be aware of their differences, strengths, and  weaknesses. Understand the basics of securing 802.11 networking. \nKnow about RFID, NFC, satellite, narrow-band, and Zigbee. \nUnderstand site surveys. A site survey is a formal assessment  of wireless signal strength, quality, and interference using an RF  signal detector. A site survey is performed by placing a wireless base  station in a desired location and then collecting signal measurements  from throughout the area. \nUnderstand WPS attacks. Wi-Fi Protected Setup (WPS) is  intended to simplify the effort involved in adding new clients to a  secured wireless network. It operates by automatically connecting  the first new wireless client to seek the network once WPS is  triggered. \nUnderstand captive portals. A captive portal is an  authentication technique that redirects a newly connected client to a  web-based portal access control page. \nKnow wireless attacks. Attacks include war driving, wireless  scanners/crackers, rogue access points, evil twin, disassociation,  jamming, IV abuse, and replay. \nBe familiar with CDNs. A content distribution network (CDN),  or content delivery network, is a collection of resource services  deployed in numerous data centers across the Internet to provide  low latency, high performance, and high availability of the hosted  content. \nUnderstand NAC. Network access control (NAC) is the concept  of controlling access to an environment through strict adherence to  and enforcement of security policy. Know about 802.1X,  preadmission, postadmission, agent-based, and agentless. \nUnderstand the various types of firewalls. There are several  types of firewalls: static packet filtering, application-level, circuit-  level, stateful inspection, NGFW, and ISFW. Also, know about virtual  firewall, filters/rules/ACLs/tuples, bastion host, ingress, egress, \nRTBH, stateless versus stateful, WAF, SWG, TCP wrapper, DPI, and  content and URL filtering. \nKnow about proxies. A proxy server is used to mediate between  clients and servers. Proxies are most often used in the context of  providing clients on a private network with internet access while  protecting the identity of the clients. Know about forward, reverse,  transparent, and nontransparent. \nUnderstand endpoint security. Endpoint security is the  concept that each individual device must maintain local security  whether or not its network or telecommunications channels also  provide security. Endpoint detection and response (EDR) is a  combination of firewall, intrusion detection system (IDS), and  antimalware. Managed detection and response (MDR) combines \nEDR with Security information and event management (SIEM),  network traffic analysis (NTA), and network IDS. Endpoint  protection platform (EPP) is an intrusion prevention system (IPS)  variant of EDR. Extended detection and response (XDR) is the  combination of EDR, MDR, and EPP often with cloud-based remote  monitoring and analysis. \nBe familiar with the common LAN technologies. The most  common LAN technology is Ethernet. Also, be familiar with analog  versus digital communications; synchronous versus asynchronous  communications; duplexing; baseband versus broadband  communications; broadcast, multicast, unicast, anycast, and geocast  communications; CSMA, CSMA/CD, and CSMA/CA; token passing;  and polling. \nWritten Lab \n1. Name the layers of the OSI model and their numbers from top to  bottom. \n2. Name three problems with cabling and the methods to  counteract those issues. \n3. What are the various technologies employed by wireless devices  to maximize their use of the available radio frequencies? \n4. Discuss methods used to secure 802.11 wireless networking. \n5. Name eight Application-Layer protocols and their ports \n(indicate whether the ports are TCP or UDP). \nReview Questions \n1. Dorothy is using a network sniffer to evaluate network  connections. She focuses on the initialization of a TCP session. \nWhat is the first phase of the TCP three-way handshake  sequence? \nA. SYN flagged packet \nB. ACK flagged packet \nC. FIN flagged packet \nD. SYN/ACK flagged packet \n2. UDP is a connectionless protocol that operates at the Transport \nLayer of the OSI model and uses ports to manage simultaneous  connections. Which of the following terms is also related to \nUDP? \nA. Bits \nB. Logical addressing \nC. Data reformatting \nD. Simplex \n3. Which of the following is a means for IPv6 and IPv4 to be able to  coexist on the same network? (Choose all that apply.) \nA. Dual stack \nB. Tunneling \nC. IPSec \nD. NAT-PT \nE. IP sideloading \n4. Security configuration guidelines issued by your CISO require  that all HTTP communications be secure when communicating  with internal web services. Which of the following is true in  regards to using TLS? (Choose all that apply.) \nA. Allows for use of TCP port 443 \nB. Prevents tampering, spoofing, and eavesdropping \nC. Requires two-way authentication \nD. Is backward compatible with SSL sessions \nE. Can be used as a VPN solution \n5. Your network supports TCP/IP. TCP/IP is a multilayer protocol. \nIt is primarily based on IPv4, but the organization is planning on  deploying IPv6 within the next year. What is both a benefit and  a potentially harmful implication of multilayer protocols? \nA. Throughput \nB. Encapsulation \nC. Hash integrity checking \nD. Logical addressing \n6. A new VoIP system is being deployed at a government  contractor organization. They require high availability of five  nines of uptime for the voice communication system. They are  also concerned about introducing new vulnerabilities into their  existing data network structure. The IT infrastructure is based  on fiber optics and supports over 1 Gbps to each device; the  network often reaches near full saturation on a regular basis. \nWhat option will provide the best outcome of performance,  availability, and security for the VoIP service? \nA. Create a new VLAN on the existing IT network for the VoIP  service. \nB. Replace the current switches with routers and increase the  interface speed to 1,000 Mbps. \nC. Implement a new, separate network for the VoIP system. \nD. Deploy flood guard protections on the IT network. \n7. Micro-segmentation is dividing up an internal network in  numerous subzones, potentially as small as a single device, such  as a high-value server or even a client or endpoint device. Which  of the following is true in regard to micro-segmentation? \n(Choose all that apply.) \nA. It is the assignment of the cores of a CPU to perform  different tasks. \nB. It can be implemented using ISFWs. \nC. Transactions between zones are filtered. \nD. It supports edge and fog computing management. \nE. It can be implemented with virtual systems and virtual  networks. \n8. A new startup company is designing a sensor that needs to  connect wirelessly to a PC or IoT hub to transmit its gathered  data to a local application or cloud service for data analysis. The  company wants to ensure that all transferred data from the  device cannot be disclosed to unauthorized entities. The device  is also intended to be located within 1 meter of the PC or IoT hub  it communicates with. Which of the following concepts is the  best choice for this device? \nA. Zigbee \nB. Bluetooth \nC. GEO \nD. 5G \n9. James has been hired to be a traveling repair technician. He will  be visiting customers all over the country to provide support  services. He has been issued a portable workstation with 4G and \n5G data service. What are some concerns when using this  capability? (Choose all that apply.) \nA. Eavesdropping \nB. Rogue towers \nC. Data speed limitations \nD. Reliability of establishing a connection \nE. Compatibility with cloud services \nF. Unable to perform duplex communications \n10. A new startup company needs to optimize delivery of high-  definition media content to its customers. They are planning the  deployment of resource service hosts in numerous data centers  across the world to provide low latency, high performance, and  high availability of the hosted content. What technology is likely  being implemented? \nA. VPN \nB. CDN \nC. SDN \nD. CCMP \n11. Which of the following is a true statement about ARP poisoning  or MAC spoofing? \nA. MAC spoofing is used to overload the memory of a switch. \nB. ARP poisoning is used to falsify the physical address of a  system to impersonate that of another authorized device. \nC. MAC spoofing relies on ICMP communications to traverse  routers. \nD. ARP poisoning can use unsolicited or gratuitous replies. \n12. An organization stores group project data files on a central SAN. \nMany projects have numerous files in common but are  organized into separate project containers. A member of the  incident response team is attempting to recover files from the \nSAN after a malware infection. However, many files are unable  to be recovered. What is the most likely cause of this issue? \nA. Using Fibre Channel \nB. Performing real-time backups \nC. Using file encryption \nD. Deduplication \n13. Jim was tricked into clicking on a malicious link contained in a  spam email message. This caused malware to be installed on his  system. The malware initiated a MAC flooding attack. Soon, \nJim's system and everyone else's in the same local network  began to receive all transmissions from all other members of the  network as well as communications from other parts of the next-  to-local members. The malware took advantage of what  condition in the network? \nA. Social engineering \nB. Network segmentation \nC. ARP queries \nD. Weak switch configuration \n14. A ______________ is an intelligent hub because it knows the  hardware addresses of the systems connected on each outbound  port. Instead of repeating traffic on every outbound port, it  repeats traffic only out of the port on which the destination is  known to exist. \nA. Repeater \nB. Switch \nC. Bridge \nD. Router \n15. What type of security zone can be positioned so that it operates  as a buffer between the secured private network and the Internet  and can host publicly accessible services? \nA. Honeypot \nB. Screened subnet \nC. Extranet \nD. Intranet \n16. An organization wants to use a wireless network internally, but  they do not want any possibility of external access or detection. \nWhat security tool should be used? \nA. Air gap \nB. Faraday cage \nC. Biometric authentication \nD. Screen filters \n17. Neo is the security manager for the southern division of the  company. He thinks that deploying a NAC will assist in  improving network security. However, he needs to convince the \nCISO of this at a presentation next week. Which of the following  are goals of NAC that Neo should highlight? (Choose all that  apply.) \nA. Reduce social engineering threats \nB. Detect rogue devices \nC. Map internal private addresses to external public addresses \nD. Distribute IP address configurations \nE. Reduce zero-day attacks \nF. Confirm compliance with updates and security settings \n18. The CISO wants to improve the organization's ability to manage  and prevent malware infections. Some of her goals are to (1)  detect, record, evaluate, and respond to suspicious activities and  events, which may be caused by problematic software or by valid  and invalid users, (2) collect event information and report it to a  central ML analysis engine, and (3) detect abuses that are  potentially more advanced than what can be detected by  traditional antivirus or HIDSs. The solution needs to be able to  reduce response and remediation time, reduce false positives,  and manage multiple threats simultaneously. What solution is  the CISO wanting to implement? \nA. EDR \nB. NGFW \nC. WAF \nD. XSRF \n19. A(n) _________________ firewall is able to make access  control decisions based on the content of communications as  well as the parameters of the associated protocol and software. \nA. Application-level \nB. Stateful inspection \nC. Circuit-level \nD. Static packet filtering \n20. Which of the following is true regarding appliance firewalls? \n(Choose all that apply.) \nA. They are able to log traffic information. \nB. They are able to block new phishing scams. \nC. They are able to issue alarms based on suspected attacks. \nD. They are unable to prevent internal attacks. ",
  "elements": {
    "summaries": [
      "The tasks of designing, deploying, and maintaining security on a network require intimate knowledge of the technologies involved in networking. This includes protocols, services, communication mechanisms, topologies, cabling, endpoints, and networking devices. The OSI model is a standard against which all protocols are evaluated. Understanding how the OSI model is used and how it applies to real-world protocols can help system designers and system administrators improve security. The TCP/IP model is derived directly from the TCP/IP protocol suite and roughly maps to the OSI model. Most networks employ TCP/IP as the primary protocol. IP networking includes IPv4 and IPv6. IPv4 is the version of Internet Protocol that is most widely used around the world. IPv6 is being rapidly adopted for both private and public network use. DNS and ARP were developed to interchange or resolve between domain names and IP addresses or IP addresses and MAC addresses, respectively. TCP/IP supports many secure protocols, including IPSec, SSH, and protocols encrypted by TLS. TCP/IP is a multilayer protocol suite that allows for flexibility, resiliency, and encryption. Converged protocols are common on modern networks, including VoIP and iSCSI. SDN and CDN have expanded the definition of network as well as expanded the use cases for it. Micro-segmentation divides an internal network into numerous subzones to allow for greater security and control of communications, which in turn supports a zero-trust security policy. Wireless communications occur in many forms, including cell phone, Bluetooth (802.15.1 and Bluetooth SIG), RFID, NFC, and Wi-Fi networking (802.11). Wireless communication is more vulnerable to interference, eavesdropping, denial of service, and AitM attacks. Routers, hubs, switches, repeaters, gateways, proxies, NAC, and firewalls are an important part of a network's security. Firewalls are essential tools in managing, controlling, and filtering network traffic. Endpoint security is the concept that each individual device must maintain local security whether or not its network or telecommunications channels also provide security. A wide range of hardware components can be used to construct a network, not the least of which is the cabling used to tie all the devices together. Understanding the strengths and weaknesses of each transmission media type is part of designing a secure network. Study Essentials Know the OSI model layers. The OSI layers are as follows: Application, Presentation, Session, Transport, Network, Data Link, and Physical. Know the network container names. The network containers are: OSI layers 7–5 protocol data unit (PDU), Layer 4 segment (TCP) or a datagram (UDP), Layer 3 packet, Layer 2 frame, and Layer 1 bits. Understand the MAC address. Media Access Control (MAC) address is a 6-byte (48-bit) binary address written in hexadecimal notation, aka hardware address, physical address, the NIC address, and the Ethernet address. The first 3 bytes (24 bits) of the address is the organizationally unique identifier (OUI), which denotes the vendor or manufacturer. Understand the TCP/IP model. Also known as DARPA or the DOD model, the model has four layers: Application (also known as Process), Transport (also known as Host-to-Host), Internet (sometimes known as Internetworking), and Link (although the terms Network Interface and sometimes Network Access are used). Understand DNS. The Domain Name System (DNS) is the hierarchical naming scheme used in both public and private networks. DNS links human-friendly fully qualified domain names (FQDNs) and IP addresses together. DNSSEC and DoH are DNS security features. Understand DNS poisoning. DNS poisoning is the act of falsifying the DNS information used by a client to reach a desired system. It can be accomplished through a rogue DNS server, pharming, altering a hosts file, corrupting IP configuration, DNS query spoofing, and proxy falsification. Know about ARP. Address Resolution Protocol (ARP) is essential to the interoperability of logical and physical addressing schemes. ARP is used to resolve IP addresses into MAC addresses. Also, know about ARP poisoning. Know about micro-segmentation. Micro-segmentation is dividing up an internal network into numerous subzones, potentially as small as a single device, such as a high-value server or even a client or endpoint device. Each zone is separated from the others by internal segmentation firewalls (ISFWs), subnets, or VLANs. Know about edge networks. An edge network is a carefully designed data architecture that strategically allocates computing resources to edge devices within a network. This design helps distribute processing power demands away from central servers, empowering the devices to handle a significant portion of the processing workload. Understand the various wireless technologies. Cell phones, Bluetooth (802.15.1 and Bluetooth SIG), and Wi-Fi wireless networking (802.11) are all called wireless technologies, even though they are all different. Be aware of their differences, strengths, and weaknesses. Understand the basics of securing 802.11 networking. Know about RFID, NFC, satellite, narrow-band, and Zigbee. Understand site surveys. A site survey is a formal assessment of wireless signal strength, quality, and interference using an RF signal detector. A site survey is performed by placing a wireless base station in a desired location and then collecting signal measurements from throughout the area. Understand WPS attacks. Wi-Fi Protected Setup (WPS) is intended to simplify the effort involved in adding new clients to a secured wireless network. It operates by automatically connecting the first new wireless client to seek the network once WPS is triggered. Understand captive portals. A captive portal is an authentication technique that redirects a newly connected client to a web-based portal access control page. Know wireless attacks. Attacks include war driving, wireless scanners/crackers, rogue access points, evil twin, disassociation, jamming, IV abuse, and replay. Be familiar with CDNs. A content distribution network (CDN), or content delivery network, is a collection of resource services deployed in numerous data centers across the Internet to provide low latency, high performance, and high availability of the hosted content. Understand NAC. Network access control (NAC) is the concept of controlling access to an environment through strict adherence to and enforcement of security policy. Know about 802.1X, preadmission, postadmission, agent-based, and agentless. Understand the various types of firewalls. There are several types of firewalls: static packet filtering, application-level, circuit- level, stateful inspection, NGFW, and ISFW. Also, know about virtual firewall, filters/rules/ACLs/tuples, bastion host, ingress, egress, RTBH, stateless versus stateful, WAF, SWG, TCP wrapper, DPI, and content and URL filtering. Know about proxies. A proxy server is used to mediate between clients and servers. Proxies are most often used in the context of providing clients on a private network with internet access while protecting the identity of the clients. Know about forward, reverse, transparent, and nontransparent. Understand endpoint security. Endpoint security is the concept that each individual device must maintain local security whether or not its network or telecommunications channels also provide security. Endpoint detection and response (EDR) is a combination of firewall, intrusion detection system (IDS), and antimalware. Managed detection and response (MDR) combines EDR with Security information and event management (SIEM), network traffic analysis (NTA), and network IDS. Endpoint protection platform (EPP) is an intrusion prevention system (IPS) variant of EDR. Extended detection and response (XDR) is the combination of EDR, MDR, and EPP often with cloud-based remote monitoring and analysis. Be familiar with the common LAN technologies. The most common LAN technology is Ethernet. Also, be familiar with analog versus digital communications; synchronous versus asynchronous communications; duplexing; baseband versus broadband communications; broadcast, multicast, unicast, anycast, and geocast communications; CSMA, CSMA/CD, and CSMA/CA; token passing; and polling."
    ],
    "reviewQuestions": [],
    "writtenLabs": []
  }
}