{
  "id": "chapter_18",
  "content": "\nChapter 18 \nDisaster Recovery Planning \nTHE CISSP TOPICS COVERED IN THIS CHAPTER \nINCLUDE: \nDomain 6.0: Security Assessment and Testing \n6.3 Collect security process data (e.g., technical and  administrative) \n6.3.5 Training and awareness \n6.3.6 Disaster recovery (DR) and Business Continuity \n(BC) \nDomain 7.0: Security Operations \n7.10 Implement recovery strategies \n7.10.1 Backup storage strategies (e.g., cloud storage,  onsite, offsite) \n7.10.2 Recovery site strategies (e.g., cold versus hot,  resource capacity agreements) \n7.10.3 Multiple processing sites \n7.10.4 System resilience, high availability (HA), \nQuality of Service (QoS), and fault tolerance \n7.11 Implement disaster recovery (DR) processes \n7.11.1 Response \n7.11.2 Personnel \n7.11.3 Communications (i.e., methods) \n7.11.4 Assessment \n7.11.5 Restoration \n7.11.6 Training and awareness \n7.11.7 Lessons learned \n7.12 Test disaster recovery plan (DRP) \n7.12.1 Read-through/tabletop \n7.12.2 Walkthrough \n7.12.3 Simulation \n7.12.4 Parallel \n7.12.5 Full interruption \n7.12.6 Communications (e.g., stakeholders, test status,  regulators) \nIn Chapter 3, “Business Continuity Planning,” you learned the  essential elements of business continuity planning (BCP)—the art of  helping your organization assess priorities and design resilient  processes that will allow continued operations in the event of a  disaster. \nDisaster recovery planning (DRP) is the technical complement to the  business-focused BCP exercise. It includes the technical controls that  prevent disruptions and facilitate the restoration of service as quickly  as possible after a disruption occurs. \nTogether, the disaster recovery and business continuity plans kick in  and guide the actions of emergency-response personnel until the end  goal is reached—which is to see the business restored to full  operating capacity in its primary operations facilities. \nWhile reading this chapter, you may notice many areas of overlap  between the BCP and DRP processes. Our discussion of specific  disasters provides information on how to handle them from both \nBCP and DRP points of view. Although the ISC2 CISSP objectives  draw a distinction between these two areas, most organizations  simply have a single team to address both business continuity and  disaster recovery concerns. In many organizations, the discipline  known as business continuity management (BCM) encompasses \nBCP, DRP, and crisis management under a single umbrella. \nThe Nature of Disaster \nDisaster recovery planning brings order to the chaos that surrounds  the interruption of an organization's normal activities. By its very  nature, a disaster recovery plan is designed to cover situations  where tensions are already high and cooler heads may not naturally  prevail. Picture the circumstances in which you might find it  necessary to implement DRP measures—a hurricane destroys your  main operations facility; a fire devastates your main processing  center; terrorist activity closes off access to a major metropolitan  area. Any event that stops, prevents, or interrupts an organization's  ability to perform its work tasks (or threatens to do so) is considered  a disaster. The moment that IT becomes unable to support mission-  critical processes is the moment DRP kicks in to manage the  restoration and recovery procedures. \nA disaster recovery plan should be set up so that it can almost run on  autopilot. The DRP should also be designed to reduce decision-  making activities during a disaster as much as possible. Essential  personnel should be well trained in their duties and responsibilities  in the wake of a disaster and also know the steps they need to take to  get the organization up and running as soon as possible. We'll begin  by analyzing some of the possible disasters that might strike your  organization and the particular threats that they pose. Many of these  were mentioned in Chapter 3, but we'll now explore them in further  detail. \nTo plan for natural and unnatural disasters in the workplace, you  must first understand their various forms, as explained in the  following sections. \nNatural Disasters \nNatural disasters reflect the occasional fury of our habitat—violent  occurrences that result from changes in the earth's surface or  atmosphere that are beyond human control. In some cases, such as  hurricanes, scientists have developed sophisticated predictive  models that provide ample warning before a disaster strikes. Others,  such as earthquakes, can cause devastation at a moment's notice. A  disaster recovery plan should provide mechanisms for responding to  both types of disasters, either with a gradual buildup of response  forces or as an immediate reaction to a rapidly emerging crisis. \nEarthquakes \nEarthquakes are caused by the shifting of seismic plates and can  occur almost anywhere in the world without warning. However, they  are far more likely to occur along known fault lines that exist in many  areas of the world. A well-known example is the San Andreas Fault,  which poses a significant risk to portions of the western United \nStates. If you live in a region along a fault line where earthquakes are  likely, your DRP should address the procedures your business will  implement should a seismic event interrupt your normal activities. \nYou might be surprised by some of the regions of the world where  earthquakes are considered possible. The U.S. Geological Survey  considers the following states to have the highest earthquake hazard  risk, with Alaska, California, and Hawaii having a higher hazard risk: \nAlaska \nArkansas \nCalifornia \nHawaii \nIdaho \nIllinois \nKentucky \nMissouri \nMontana \nNevada \nOregon \nSouth Carolina \nTennessee \nUtah \nWashington \nWyoming \nHowever, it is extremely important to recognize that seismic risk is  not uniform across a state. Figure 18.1 provides a more granular  seismic risk map. If you examine this map, you'll discover that some  areas in these high-risk states actually have very low localized risk,  whereas there are areas in almost every state where earthquake risk  is significant. \nFIGURE 18.1 Seismic hazard map \nSource: U.S. Geological Survey / Public Domain. \nFloods \nFlooding can occur almost anywhere in the world at any time of the  year. Some flooding results from the gradual accumulation of  rainwater in rivers, lakes, and other bodies of water that then  overflow their banks and flood the community. Other floods, known  as flash floods , strike when a sudden severe storm dumps more  rainwater on an area than the ground can absorb in a short period of  time. Floods can also occur when dams are breached. Large waves  caused by seismic activity, or tsunamis , combine the awesome power  and weight of water with flooding, as we saw during the 2011  tsunami in Japan. This tsunami amply demonstrated the enormous  destructive capabilities of water and the havoc it can wreak on  various businesses and economies when it triggered an  unprecedented nuclear disaster at Fukushima. \nAccording to government statistics, flooding is responsible for  approximately $8 billion (that's billion with a B ) in damage to  businesses and homes each year in the United States. It's important  that your DRP make appropriate response plans for the eventuality  that a flood may strike your facilities. \nWhen you evaluate a firm's risk of damage from  flooding to develop business continuity and disaster recovery  plans, it's also a good idea to check with responsible individuals  and ensure that your organization has sufficient insurance in  place to protect it from the financial impact of a flood. In the \nUnited States, most general business policies do not cover flood  damage, and you should investigate obtaining specialized  government-backed flood insurance under the Federal \nEmergency Management Agency's (FEMA) National Flood \nInsurance Program. Outside the U.S., commercial insurance  providers may offer these policies. \nAlthough flooding is theoretically possible in almost any region of  the world, it is much more likely to occur in certain areas. FEMA's \nNational Flood Insurance Program is responsible for completing a  flood risk assessment for the entire United States and providing this  data to citizens in graphical form. You can view flood maps at  http://msc.fema.gov/portal . \nThis site also provides valuable information on recorded  earthquakes, hurricanes, windstorms, hailstorms, and other natural  disasters to help you prepare your organization's risk assessment. \nFigure 18.2 shows a flood map for a portion of the downtown region  of Miami, Florida. When viewing flood maps like the example shown  in Figure 18.2, you'll find that they often combine several different  types of confusing terminology. First, the shading indicates the  likelihood of a flood occurring in an area. Areas shaded with the  darkest color are described as falling within the 100-year floodplain . \nThis means that the government estimates the chance of flooding in  that area are 1 in 100, or 1.0 percent. Those unshaded lie within the \n500-year floodplain , meaning that there is a 1 in 500, or 0.2 percent  annual risk of flood. And those shaded more lightly lie between the \n100-year floodplain and the 500-year floodplain. \nThese maps also contain information about the impact of a flood,  measured in terms of the depth of flooding expected during a  flooding event. Those are described as zones having many different  letter codes, which you will not need to memorize for the CISSP  exam. \nFIGURE 18.2 Flood hazard map for Miami–Dade County, Florida \nFor a more detailed tutorial on reading flood maps and current map  information, visit www.fema.gov/sites/default/files/documents/how-  to-read-flood-insurance-rate-map-tutorial.pdf . \nStorms \nStorms come in many forms and pose diverse risks to a business. \nProlonged periods of intense rainfall bring the risk of flash flooding,  as described in the previous section. Hurricanes and tornadoes come  with the threat of high wind speeds that undermine the structural  integrity of buildings and turn everyday objects such as trees, lawn  furniture, and even vehicles into deadly missiles. Hailstorms bring a  rapid onslaught of destructive ice chunks falling from the sky. Many  storms also bring the risk of lightning, which can cause severe  damage to sensitive electronic components. For this reason, your  business continuity plan should detail appropriate mechanisms to  protect against lightning-induced damage, and your disaster  recovery plan should include adequate provisions for power outages  and equipment damage that might result from a lightning strike. \nNever underestimate the damage that a single storm can do. \nIn 2017, the Category 4 Atlantic hurricane Harvey marked one of the  costliest, deadliest, and strongest hurricanes ever to make landfall in  the continental United States. It bore a path of destruction through \nTexas, destroying both natural and human-made features. The total  economic impact stemming from the damage Harvey caused is  estimated at more than $125 billion, and it directly resulted in 68  deaths. Storm damage continues to result in devastating costs,  partially driven by inflation in building costs and partially driven by  climate change. In 2022, climate and weather disasters amounted to \n$165 billion. \nIf you live in an area susceptible to a certain type of  severe storm, it's important to regularly monitor weather  forecasts from responsible government agencies. For example,  disaster recovery specialists in hurricane-prone areas should  periodically check the website of the National Weather Service's \nNational Hurricane Center ( www.nhc.noaa.gov ) during hurricane  season. This website allows you to monitor Atlantic and Pacific  storms that may pose a risk to your region before word about  them hits the local news. This knowledge lets you begin a gradual  and proactive response to the storm before time runs out. \nFires \nFires can start for a variety of reasons, both natural and human-  made, but both forms can be equally devastating. During the \nBCP/DRP process, you should evaluate the risk of fire and  implement at least basic measures to mitigate that risk and prepare  the business for recovery from a catastrophic fire in a critical facility. \nSome regions of the world are susceptible to wildfires during the  warm season. These fires, once started, spread in somewhat  predictable patterns, and fire experts working with meteorologists  can produce relatively accurate forecasts of a wildfire's potential  path. It is important, of course, to remember that wildfires can  behave unpredictably and require constant vigilance. In 2018, the \nCamp Fire in California destroyed the town of Paradise within 4  hours of ignition. \nThe damage caused by forest fires continues to increase, driven by  climate change. In 2020, the state of California experienced over \n9,600 fires burning over 4.3 million acres of the state. To put that in  context, 4 percent of the land area of the state of California burned in  a single year. In 2023, a significant wildfire affected Maui, causing  widespread damage and over a hundred deaths. This terrible event  underscores the escalating threat of wildfires. It is a reminder of the  necessity for robust fire risk assessment and preparedness as part of  any comprehensive business continuity and disaster recovery  planning effort. \nAs with many other types of large-scale natural  disasters, you can obtain valuable information about impending  threats on the web. In the United States, the National Interagency \nFire Center posts daily fire updates and forecasts on its website:  www.nifc.gov/fireInfo/nfn.htm . Other countries have similar  warning systems in place. \nPandemics \nPandemics pose a significant health and safety risk to society and  have the potential to disrupt business operations in a manner unlike  many other disasters. Rather than causing physical damage,  pandemics threaten the safety of individuals and prevent them from  gathering in large numbers, shutting down offices and other  facilities. \nThe COVID-19 coronavirus pandemic was the most severe example  to occur in the past century, but numerous other smaller outbreaks  have occurred, including the SARS outbreak, avian flu, and swine flu. \nMajor outbreaks like COVID-19 may be infrequent, but the severity  of this risk requires careful planning, including building contingency  plans for how businesses will operate in a pandemic response mode  and what types of insurance may or may not provide coverage in  response to a pandemic. \nOther Natural Events \nSome regions of the world are prone to localized types of natural  disasters. During the BCP/DRP process, your assessment team  should analyze all of your organization's operating locations and  gauge the impact that such events might have on your business. For  example, many parts of the world are subject to volcanic eruptions. If  you conduct operations in an area in close proximity to an active or  dormant volcano, your DRP should probably address this  eventuality. Other localized natural occurrences include monsoons in \nAsia, tsunamis in the South Pacific, avalanches in mountainous  regions, and mudslides in the western United States. \nIf your business is geographically diverse, it is prudent to include  local emergency response experts on your planning team. At the very  least, make use of local resources such as government emergency  preparedness teams, civil defense organizations, and insurance claim  offices to help guide your efforts. These organizations possess a  wealth of knowledge and are usually more than happy to help you  prepare your organization for the unexpected—after all, every  organization that successfully weathers a natural disaster is one less  organization that requires a portion of their valuable recovery  resources after disaster strikes. \nHuman-Made Disasters \nOur advanced civilization has become increasingly dependent on  complex interactions between technological, logistical, and natural  systems. The same complex interactions that make our sophisticated  society possible also present a number of potential vulnerabilities  from both intentional and unintentional human-made disasters . In  the following sections, we'll examine a few of the more common  disasters to help you analyze your organization's vulnerabilities when  preparing a business continuity plan and disaster recovery plan. \nFires \nEarlier in the chapter, we explained how some regions of the world  are susceptible to wildfires during the warm season, and these types  of fires can be described as natural disasters. Many smaller-scale  fires result from human action—be it carelessness, faulty electrical  wiring, improper fire protection practices, arson, or other reasons. \nStudies from the Insurance Information Institute indicate that there  are at least 1,000 building fires in the United States every day . If  such a fire strikes your organization, do you have the proper  preventive measures in place to quickly contain it? If the fire  destroys your facilities, how quickly does your disaster recovery plan  allow you to resume operations elsewhere? \nActs of Terrorism \nSince the terrorist attacks on September 11, 2001, businesses are  increasingly concerned about risks posed by terrorist threats. These  attacks caused many small businesses to fail because they did not  have business continuity/disaster recovery plans in place that were  adequate to ensure their continued viability. Many larger businesses  experienced significant losses that caused severe long-term damage. \nThe Insurance Information Institute issued a study one year after the  attacks that estimated the total damage from the attacks in New York \nCity at $40 billion (yes, that's with a B again). \nGeneral business insurance may not properly cover  an organization against acts of terrorism. In years past, most  policies either covered acts of terrorism or didn't mention them  explicitly. After suffering catastrophic terrorism-related losses,  many insurance companies responded by amending policies to  exclude losses from terrorist activity. Policy riders and  endorsements are sometimes available, but often at extremely  high cost. If your business continuity or disaster recovery plan  includes insurance as a means of financial recovery (as it  probably should!), you'd be well advised to check your policies  and contact your insurance professionals to ensure that you're  still covered. \nTerrorist acts pose a unique challenge to DRP teams because of their  unpredictable nature. Prior to the September 11, 2001, terrorist  attacks, few DRP teams considered the threat of an airplane crashing  into their corporate headquarters significant enough to merit  mitigation. Many companies are asking themselves a number of \n“what if” questions regarding terrorist activity. In general, these  questions are healthy because they promote dialogue between  business elements regarding potential threats. On the other hand,  disaster recovery planners must emphasize solid risk-management  principles and ensure that resources aren't overallocated to terrorist  threats to the detriment of other DRP/BCP activities that protect  against more likely threats. \nBombings/Explosions \nExplosions can result from a variety of human-made occurrences. \nExplosive gases from leaks might fill a room/building and later ignite  and cause a damaging blast. In many areas, bombings are also cause  for concern. From a disaster planning perspective, the effects of  bombings and explosions are like those caused by a large-scale fire. \nHowever, planning to avoid the impact of a bombing is much more  difficult and relies on the physical security measures we covered in \nChapter 10, “Physical Security Requirements.” \nPower Outages \nEven the most basic disaster recovery plan contains provisions to  deal with the threat of a short power outage. Critical business  systems are often protected by uninterruptible power supply (UPS)  devices to keep them running at least long enough to shut down or  long enough to get emergency generators up and working. Even so,  could your organization keep operating during a sustained power  outage? \nAfter Hurricane Harvey made landfall in 2017, millions of people in \nTexas lost power. Similar power outages occurred in 2020 in  response to the California wildfires. Does your business continuity  plan include provisions to keep your business viable during a  prolonged period without power? If so, what is your planning  horizon? Do you need enough fuel and other supplies to last for 48  hours? Seven days? Does your disaster recovery plan make ample  preparations for the timely restoration of power even if the  commercial power grid remains unavailable? All of these decisions  should be made based on the requirements in your business  continuity and disaster recovery plans. \nCheck your UPSs regularly. These critical devices are  often overlooked until they become necessary. Many UPSs  contain self-testing mechanisms that report problems  automatically, but it's still a good idea to subject them to regular  testing. Also, be sure to audit the number and type of devices  plugged into each UPS. It's amazing how many people think it's  okay to add “just one more system” to a UPS, and you don't want  to be surprised when the device can't handle the load during a  real power outage! \nToday's technology-driven organizations depend increasingly on  electric power, so your BCP/DRP team should consider provisioning  alternative power sources that can run business systems for an  extended period of time. An adequate backup generator could make  a huge difference when the survival of your business is at stake. \nNetwork, Utility, and Infrastructure Failures \nWhen planners consider the impact that utility outages may have on  their organizations, they naturally think first about the impact of a  power outage. However, keep other utilities in mind, too. Do any of  your critical business systems rely on water, sewers, natural gas, or  other utilities? Also consider regional infrastructure such as  highways, airports, and railroads. Any of these systems can suffer  failures that might not be related to weather or other conditions  described in this chapter. Many businesses depend on one or more of  these infrastructure elements to move people or materials. Their  failure can paralyze your business's ability to continue functioning. \nYou must also think about your internet connectivity as a utility  service. Do you have sufficient redundancy in your connectivity  options to survive or recover quickly from a disaster? If you have  redundant providers, do they have any single points of failure? For  example, do they both enter your building in a single fiber conduit  that could be severed? If there are no alternative fiber ingress points,  can you supplement a fiber connection with wireless connectivity? \nDo your alternate processing sites have sufficient network capacity to  carry the full burden of operations in the event of a disaster? \nIf you quickly answered “no” to the question  whether you have critical business systems that rely on water,  sewers, natural gas, or other utilities, think again. Do you  consider people a critical business system? If a major storm  knocks out the water supply to your facilities and you need to  keep those facilities up and running, can you supply your  employees with enough drinking water to meet their needs? \nWhat about your fire protection systems? If any of them are  water-based, is there a holding tank system in place that contains  ample water to extinguish a serious building fire if the public  water system is unavailable? Fires often cause serious damage in  areas ravaged by storms, earthquakes, and other disasters that  might also interrupt the delivery of water. \nHardware/Software Failures \nLike it or not, computer systems fail. Hardware components simply  wear out and refuse to continue performing, or they suffer physical  damage. Software systems contain bugs or fall prey to improper or  unexpected inputs. For this reason, BCP/DRP teams must provide  adequate redundancy in their systems. If zero downtime is a  mandatory requirement, one solution is to use fully redundant  failover servers in separate locations attached to separate  communications links and infrastructures (also designed to operate  in a failover mode). If one server is damaged or destroyed, the other  will instantly take over the processing load. For more information on  this concept, see the section “Remote Mirroring,” later in this  chapter. \nBecause of financial constraints, it isn't always feasible to maintain  fully redundant systems. In those circumstances, the BCP/DRP team  should address how replacement parts can be quickly obtained and  installed. As many parts as possible should be kept in a local parts  inventory for quick replacement; this is especially true for hard-to-  find parts that must otherwise be shipped in. After all, how many  organizations could do without telephones for three days while a  critical private branch exchange (PBX) component is en route from  an overseas location to be installed on-site? \nNYC Blackout \nOn August 14, 2003, the lights went out in New York City and in  large areas of the northeastern and midwestern United States  when a series of cascading failures caused the collapse of a major  power grid. \nFortunately, security professionals in the New York area were  ready. Many businesses had already updated their disaster  recovery plans and took steps to ensure their continued  operations in the wake of a disaster. This blackout served to test  those plans, and many organizations were able to continue  operating on alternate power sources or to transfer control  seamlessly to off-site data-processing centers. \nAlthough this blackout occurred at the turn of the century, the  lessons learned still offer insight for BCP/DRP teams around the  world today. The lessons we continue to take away today include  the following: \nEnsure that alternate processing sites are far enough away  from your main site that they are unlikely to be affected by  the same disaster. \nRemember that threats to your organization are both  internal and external. Your next disaster may come from a  terrorist attack, a building fire, or malicious code running  loose on your network. Take steps to ensure that your  alternate sites are segregated from the main facility to  protect against all of these threats. \nDisasters don't usually come with advance warning. If real-  time operations are critical to your organization, be sure that  your backup sites are ready to assume primary status at a  moment's notice. \nStrikes/Picketing \nWhen designing your business continuity and disaster recovery  plans, don't forget about the importance of the human factor in  emergency planning. One form of human-made disaster that is often  overlooked is the possibility of a strike or other labor crisis. If a large  number of your employees walk out at the same time, what impact  would that have on your business? How long would you be able to  sustain operations without the regular full-time employees that staff  a certain area? Your BCP and DRP teams should address these  concerns and provide alternative plans should a labor crisis occur. \nLabor issues normally fall outside the purview of cybersecurity  teams, offering a great example of an issue that should be included in  a disaster recovery plan but requires input and leadership from other  business functions, such as human resources and operations. \nTheft/Vandalism \nEarlier, we talked about the threat that terrorist activities pose to an  organization. Theft and vandalism represent the same kind of threat  on a much smaller scale. In most cases, however, there's a far greater  chance that your organization will be affected by theft or vandalism  than by a terrorist attack. The theft or destruction of a critical  infrastructure component, such as scrappers stealing copper wires or  vandals destroying sensors, can negatively impact critical business  functions. \nInsurance provides some financial protection against these events \n(subject to deductibles and limitations of coverage), but acts of this  kind can cause serious damage to your business, on both a short-  term and a long-term basis. Your business continuity and disaster  recovery plans should include adequate preventive measures to  control the frequency of these occurrences as well as contingency  plans to mitigate the effects theft and vandalism have on ongoing  operations. \nTheft of infrastructure is becoming increasingly  common as scrappers target copper in air-conditioning systems,  plumbing, and power subsystems. It's a common mistake to  assume that fixed infrastructure is unlikely to be a theft target. \nOff-site Challenges to Security \nThe constant threat of theft and vandalism is the bane of  information security professionals worldwide. Personally  identifiable information, proprietary or trade secrets, and other  forms of confidential data are just as interesting to those who  create and possess them as they are to direct competitors and  other unauthorized parties. Here's an example. \nAaron knows the threats to confidential data firsthand, working  as a security officer for a prominent and highly visible computing  enterprise. His chief responsibility is to keep sensitive  information from exposure to various elements and entities. \nBethany is one of his more troublesome employees because she's  constantly taking her notebook computer off- site without  properly securing its contents. \nEven a casual smash-and-grab theft attempt could put thousands  of client contacts and their confidential business dealings at risk  of being leaked and possibly sold to malicious parties. Aaron  knows the potential dangers, but Bethany just doesn't seem to  care. \nThis poses the question: How might you better inform, train, or  advise Bethany so that Aaron does not have to relieve her of her  position should her notebook be stolen? Bethany must come to  understand and appreciate the importance of keeping sensitive  information secure. It may be necessary to emphasize the  potential loss and exposure that comes with losing such data to  wrongdoers, competitors, or other unauthorized third parties. It  may suffice to point out to Bethany that the employee handbook  clearly states that employees whose behavior leads to the  unauthorized disclosure or loss of information assets are subject  to loss of pay or termination. If such behavior recurs after a  warning, Bethany should be rebuked and reassigned to a position  where she can't expose sensitive or proprietary information—that  is, if she's not fired on the spot. \nKeep in mind the impact that theft may have on  your operations when planning your parts inventory. It's a good  idea to keep extra inventory of items with a high pilferage rate,  such as RAM chips and mobile devices. It's also a good idea to  keep such materials in secure storage and to require employees to  sign such items out whenever they are used. \nUnderstand System Resilience, High \nAvailability, and Fault Tolerance \nTechnical controls that add to system resilience and fault tolerance  directly affect availability, one of the core goals of the CIA Triad \n(confidentiality, integrity, and availability). A primary goal of system  resilience and fault tolerance is to eliminate single points of failure in  critical business systems. \nA single point of failure (SPOF) is any component that can cause an  entire system to fail. If a computer has data on a single disk, failure  of the disk can cause the computer to fail, so the disk is a single point  of failure. If a database-dependent website includes multiple web  servers all served by a single database server, the database server is a  single point of failure. \nSystem resilience refers to the ability of a system to maintain an  acceptable level of service during an adverse event. This could be a  hardware fault managed by fault-tolerant components, or it could be  an attack managed by other controls such as effective intrusion  prevention systems. In some contexts, it refers to the ability of a  system to return to a previous state after an adverse event. For  example, if a primary server in a failover cluster fails, fault tolerance  ensures that the system fails over to another server. System  resilience implies that the cluster can fail back to the original server  after the original server is repaired. \nFault tolerance is the ability of a system to suffer a fault but continue  to operate. Fault tolerance is achieved by adding redundant  components, such as additional disks within a properly configured \nRAID array or additional servers within a failover clustered  configuration. \nHigh availability is the use of redundant technology components to  allow a system to quickly recover from a failure after experiencing a  brief disruption. High availability is often achieved through the use  of load balancing and failover servers. \nTechnology professionals measure the objective and effectiveness of  these controls by the percentage of the time that a system is  available. For example, a fairly low availability threshold would be to  specify that a system must be available 99.9 percent of the time (or \n“three nines” of availability). This means that the system may only  experience 0.1 percent of downtime during whatever period is  measured. If you apply this metric to a 30-day month of system  operation, 99.9 percent availability would require less than 44  minutes of downtime. If you move to a 99.999 percent (or “five  nines”) requirement, the system would only be permitted 26 seconds  of downtime per month. \nOf course, the stronger your availability requirement, the more  difficult it will be to meet. Achieving higher availability targets on a  consistent basis requires the use of high availability, fault tolerance,  and system resilience controls. \nProtecting Hard Drives \nA common way that fault tolerance and system resilience is added for  computers is with a RAID array. A RAID array includes two or more  disks, and most RAID configurations will continue to operate even  after one of the disks fails. Some of the common RAID configurations  are as follows: \nRAID-0 This is also called striping . It uses two or more disks and  improves the disk subsystem performance, but it does not provide  fault tolerance. \nRAID-1 This is also called mirroring . It uses two disks, which both  hold the same data. If one disk fails, the other disk includes the data  so that a system can continue to operate after a single disk fails. \nDepending on the hardware used and which drive fails, the system  may be able to continue to operate without intervention, or the  system may need to be manually configured to use the drive that  didn't fail. \nRAID-5 This is also called striping with parity . It uses three or  more disks with the equivalent of one disk holding parity  information. This parity information is distributed and allows the  reconstruction of data through mathematical calculations if a single  disk is lost. If any single disk fails, the RAID array will continue to  operate, though it will be slower. \nRAID-6 This offers an alternative approach to disk striping with  parity. It functions in the same manner as RAID-5 but with dual  distributed parity stored on the equivalent of two disks, protecting  against the failure of two separate disks but requiring a minimum of  four disks to implement. \nRAID-10 This is also known as RAID 1 + 0 or a stripe of mirrors ,  and it is configured as two or more mirrors (RAID-1), with each  mirror configured in a striped (RAID-0) configuration. It uses at  least four disks but can support more as long as an even number of  disks are added. It will continue to operate even if multiple disks fail,  as long as at least one drive in each mirror continues to function. For  example, if it had three mirrored sets (called M1, M2, and M3 for this  example) it would have a total of six disks. If one drive in M1, one in \nM2, and one in M3 all failed, the array would continue to operate. \nHowever, if two drives in any of the mirrors failed, such as both  drives in M1, the entire array would fail. \nFault tolerance is not the same as a backup. \nOccasionally, management may balk at the cost of backup tapes  and point to the RAID array, saying that the data is already  backed up. However, if a catastrophic hardware failure destroys a \nRAID array, all the data is lost unless a backup exists. Similarly, if  an accidental deletion or corruption destroys data, it cannot be  restored if a backup doesn't exist. \nBoth software- and hardware-based RAID solutions are available. \nSoftware-based systems require the operating system to manage the  disks in the array and can reduce overall system performance. They  are relatively inexpensive, since they don't require any additional  hardware other than the additional disk(s). Hardware RAID systems  are generally more efficient and reliable. Although a hardware RAID  is more expensive, the benefits outweigh the costs when used to  increase availability of a critical component. \nHardware-based RAID arrays typically include spare drives that can  be logically added to the array. For example, a hardware-based \nRAID-5 could include five disks, with three disks in a RAID-5 array  and two spare disks. If one disk fails, the hardware senses the failure  and logically swaps out the faulty drive with a good spare. \nAdditionally, most hardware-based arrays support hot swapping ,  allowing technicians to replace failed disks without powering down  the system. A cold-swappable RAID requires the system to be  powered down to replace a faulty drive. \nProtecting Servers \nFault tolerance can be added for critical servers with failover  clusters. A failover cluster includes two or more servers, and if one of  the servers fails, another server in the cluster can take over its load in  an automatic process called failover . Failover clusters can include  multiple servers (not just two), and they can also provide fault  tolerance for multiple services or applications. \nAs an example of a failover cluster, consider Figure 18.3. It shows  multiple components put together to provide reliable web access for  a heavily accessed website that uses a database. DB1 and DB2 are  two database servers configured in a failover cluster. At any given  time, only one server will function as the active database server, and  the second server will be inactive. For example, if DB1 is the active  server it will perform all the database services for the website. DB2  monitors DB1 to ensure it is operational, and if DB2 senses a failure  in DB1, it will cause the cluster to automatically fail over to DB2. \nIn Figure 18.3, you can see that both DB1 and DB2 have access to the  data in the database. This data is stored on a RAID array, providing  fault tolerance for the disks. \nAdditionally, the three web servers are configured in a network load-  balancing cluster. The load balancer can be hardware- or software-  based, and it balances the client load across the three servers. It  makes it easy to add additional web servers to handle increased load  while also balancing the load among all the servers. If any of the  servers fail, the load balancer can sense the failure and stop sending  traffic to that server. Although network load balancing is primarily  used to increase the scalability of a system so that it can handle more  traffic, it also provides a measure of fault tolerance. \nFIGURE 18.3 Failover cluster with network load balancing \nIf you're running your servers in the cloud, you may be able to take  advantage of fault tolerance services offered by your cloud provider. \nFor example, many IaaS providers offer load-balancing services that  automatically scale resources on an as-needed basis. These services  also incorporate health checking that can automatically restart  servers that are not functioning properly. \nSimilarly, when designing cloud environments, be sure to consider  the availability of data centers in different regions of the world. If  you are already load-balancing multiple servers, you may be able to  place those servers in different geographic regions and availability  zones within those regions to add resiliency in addition to scalability. \nFailover clusters are not the only method of fault  tolerance for servers. Some systems provide automatic fault  tolerance for servers, allowing a server to fail without losing  access to the provided service. For example, in a Microsoft  domain with two or more domain controllers, each domain  controller will regularly replicate Active Directory data with the  others so that all the domain controllers have the same data. If  one fails, computers within the domain can still find the other  domain controller(s) and the network can continue to operate. \nSimilarly, many database server products include methods to  replicate database content with other servers so that all servers  have the same content. Three of these methods—electronic  vaulting, remote journaling, and remote mirroring—are discussed  later in this chapter. \nProtecting Power Sources \nFault tolerance can be added for power sources with a UPS, a  generator, or both. In general, a UPS provides battery-supplied  power for a short period of time, between 5 and 30 minutes, and a  generator provides long-term power. The goal of a UPS is to provide  power long enough to complete a logical shutdown of a system, or  until a generator is powered on and providing stable power. \nGenerators provide power to systems during long-term power  outages. The length of time that a generator will provide power is  dependent on the fuel, and it's possible for a site to stay on generator  power as long as it has fuel and the generator remains functional. \nGenerators also require a steady fuel supply—they commonly use  diesel fuel, natural gas, or propane. In addition to making sure that  you have sufficient fuel on hand, you should take steps to ensure that  you can be delivered fuel on a regular basis in the event of an  extended emergency. Remember, if the disaster is widespread, there  will be significant demand for a limited fuel supply. If you have  contracts in place with suppliers, you're much more likely to receive  fuel in a timely manner. \nA more detailed discussion of power issues appeared in Chapter 10. \nTrusted Recovery \nTrusted recovery provides assurances that after a failure or crash, the  system is just as secure as it was before the failure or crash occurred. \nDepending on the failure, the recovery may be automated or require  manual intervention by an administrator. However, in either case  systems can be designed to ensure that they support trusted  recovery. \nSystems can be designed so that they fail in a fail-secure state or a  fail-open state. A fail-secure system will default to a secure state in  the event of a failure, blocking all access, and therefore, allowing the  system to fail securely. A fail-open system will fail in an open state,  granting all access. The choice is dependent on whether security or  availability is more important after a failure. A complete discussion  of these topics appeared in Chapter 8, “Principles of Security Models, \nDesign, and Capabilities.” \nTwo elements of the recovery process are addressed to implement a  trusted solution. The first element is failure preparation. This  includes system resilience and fault-tolerant methods in addition to  a reliable backup solution. The second element is the process of  system recovery. The system should be forced to reboot into a single-  user, nonprivileged state. This means that the system should reboot  so that a normal user account can be used to log in and so that the  system does not grant unauthorized access to users. System recovery  also includes the restoration of all affected files and services actively  in use on the system at the time of the failure or crash. Any missing  or damaged files are restored, any changes to classification labels are  corrected, and settings on all security critical files are then verified. \nThe Common Criteria include a section on trusted recovery that is  relevant to system resilience and fault tolerance. Specifically, it  defines four types of trusted recovery: \nManual Recovery If a system fails, it does not fail in a secure  state. Instead, an administrator is required to manually perform the  actions necessary to implement a secured or trusted recovery after a  failure or system crash. \nAutomated Recovery The system is able to perform trusted  recovery activities to restore itself against at least one type of failure. \nFor example, a hardware RAID provides automated recovery against  the failure of a hard drive but not against the failure of the entire  server. Some types of failures will require manual recovery. \nAutomated Recovery without Undue Loss This is similar to  automated recovery in that a system can restore itself against at least  one type of failure. However, it includes mechanisms to ensure that  specific objects are protected to prevent their loss. A method of  automated recovery that protects against undue loss would include  steps to restore data or other objects. It may include additional  protection mechanisms to restore corrupted files, rebuild data from  transaction logs, and verify the integrity of key system and security  components. \nFunction Recovery Systems that support function recovery are  able to automatically recover specific functions. This state ensures  that the system is able to successfully complete the recovery for the  functions, or that the system will be able to roll back the changes to  return to a secure state. \nQuality of Service \nQuality of service (QoS) controls protect the availability of data  networks under load. Many different factors contribute to the quality  of the end-user experience, and QoS attempts to manage all of those  factors to create an experience that meets business requirements. \nSome of the factors contributing to QoS are as follows: \nBandwidth The network capacity available to carry  communications. \nLatency The time it takes a packet to travel from source to  destination. \nJitter The variation in latency between different packets. \nPacket Loss Some packets may be lost between source and  destination, requiring retransmission. \nInterference Electrical noise, faulty equipment, and other factors  may corrupt the contents of packets. \nIn addition to controlling these factors, QoS systems often prioritize  certain traffic types that have low tolerance for interference and/or  have high business requirements. For example, a QoS device might  be programmed to prioritize videoconference traffic from the  executive conference room over video streaming from an intern's  computer. QoS may also include specific security requirements, such  as requiring encryption for certain types of traffic. \nRecovery Strategy \nWhen a disaster interrupts your business, your disaster recovery plan  should kick in nearly automatically and begin providing support for  recovery operations. The disaster recovery plan should be designed  so that the first employees on the scene can immediately begin the  recovery effort in an organized fashion, even if members of the  official DRP team have not yet arrived on-site. In the following  sections, we'll cover critical subtasks involved in crafting an effective  disaster recovery plan that can guide rapid restoration of regular  business processes and resumption of activity at the primary  business location. \nIn addition to improving your response capabilities, purchasing  insurance can reduce the impact of financial losses. When selecting  insurance, be sure to purchase sufficient coverage to enable you to  recover from a disaster. Simple value coverage may be insufficient to  encompass actual replacement costs. If your property insurance  includes an actual cash value (ACV) clause, then your damaged  property will be compensated based on the fair market value of the  items on the date of loss, less all accumulated depreciation since the  time of their purchase. The important point here is that unless you  have a replacement cost clause in your insurance coverage, your  organization is likely to have to pay out of pocket as a result of any  losses it might sustain. Many insurance providers offer cybersecurity  liability policies that specifically cover breaches of confidentiality,  integrity, and availability. \nValuable paper insurance coverage provides protection for inscribed,  printed, and written documents and manuscripts and other printed  business records. However, it does not cover damage to paper money  and printed security certificates. \nBusiness Unit and Functional Priorities \nTo recover your business operations with the greatest possible  efficiency, you must engineer your disaster recovery plan so that  those business units with the highest priority are recovered first. You  must identify and prioritize critical business functions as well so that  you can define which functions you want to restore after a disaster or  failure and in what order. The business impact analysis (BIA) you  developed during your business continuity work is an excellent  resource when performing this task. \nTo achieve this goal, the DRP team must first identify the critical  business units that are vital to achieving your organization's mission  and agree on an order of prioritization, and they must do likewise  with business functions. And take note: Not all critical business  functions will necessarily be carried out in critical business units, so  the final results of this analysis will very probably comprise a  superset of critical business units plus other select units. \nIf this process sounds familiar, it should! This is very much like the  prioritization task the BCP team performs during the business  impact assessment discussed in Chapter 3. In fact, most  organizations will complete a BIA as part of their business continuity  planning process. This analysis identifies vulnerabilities, develops  strategies to minimize risk, and ultimately produces a BIA report  that describes the potential risks that an organization faces and  identifies critical business units and functions. A BIA also identifies  costs related to failures that include loss of cash flow, equipment  replacement, salaries paid to clear work backlogs, profit losses,  opportunity costs from the inability to attract new business, and so  forth. Such failures are assessed in terms of potential impacts on  finances, personnel, safety, legal compliance, contract fulfillment,  and quality assurance, preferably in monetary terms to make impacts  comparable and to set budgetary expectations. With all this BIA  information in hand, you should use the resulting documentation as  the basis for this prioritization task. \nAt a minimum, the output from this task should be a simple listing of  business units in priority order. However, a more detailed list,  broken down into specific business processes listed in order of  priority, would be a much more useful deliverable. This business  process–oriented list is more reflective of real-world conditions, but  it requires considerable additional effort. It will, however, greatly  assist in the recovery effort—after all, not every task performed by  the highest-priority business unit will be of the highest priority. You  might find that it would be best to restore the highest-priority unit to \n50 percent capacity and then move on to lower-priority units to  achieve some minimum operating capacity across the organization  before attempting a full recovery effort. \nBy the same token, the same exercise must be completed for critical  business processes and functions. Not only can these things involve  multiple business units and cross the lines between them, but they  also define the operational elements that must be restored in the  wake of a disaster or other business interruption. Here also, the final  result should be a checklist of items in priority order, each with its  own risk and cost assessment, and a corresponding set of recovery  objectives and milestones. As discussed in Chapter 3, these include  the mean time to repair (MTTR), maximum tolerable downtime \n(MTD), recovery time objective (RTO), and recovery point objective \n(RPO). Business continuity planners can analyze these metrics to  identify situations that require intervention and additional controls. \nCrisis Management \nIf a disaster strikes your organization, panic is likely to set in. The  best way to combat this is with an organized disaster recovery plan. \nThe individuals in your business who are most likely to first notice an  emergency situation (such as security guards and technical  personnel) should be fully trained in disaster recovery procedures  and know the proper notification procedures and immediate  response mechanisms. \nMany things that normally seem like common sense (such as calling  emergency services in the event of a fire) may slip the minds of  panicked employees seeking to flee an emergency. The best way to  combat this is with continuous training on disaster recovery  responsibilities. Returning to the fire example, all employees should  be trained to activate the fire alarm or contact emergency officials  when they spot a fire (after, of course, taking appropriate measures  to protect themselves). After all, it's better that the fire department  receive 10 different phone calls reporting a fire at your organization  than it is for everyone to assume that someone else already took care  of it. \nCrisis management steps in to cover crises of all forms. These may  include more commonplace disasters, such as a facility fire, or more  extraordinary events, such as a global pandemic. Organizations may  also activate their crisis management programs for events with little  impact on technology, such as a public relations disaster. \nCrisis management is a science and an art form. If your training  budget permits, investing in crisis training for your key employees is  a good idea. This ensures that at least some of your employees know  how to handle emergency situations properly and can provide all-  important “on-the-scene” leadership to panic-stricken coworkers. \nEmergency Communications \nWhen a disaster strikes, it is important that the organization be able  to communicate internally as well as with the outside world. A  disaster of any significance is easily noticed, but if an organization is  unable to keep the outside world informed of its recovery status, the  public is apt to fear the worst and assume that the organization is  unable to recover. It is also essential that the organization be able to  communicate internally during a disaster so that employees know  what is expected of them—whether they are to return to work or  report to another location, for instance. \nEmployees participating in disaster recovery efforts should be  instructed to refer media inquiries to the public relations team. You  don't want employees naively providing unvarnished assessments of  the situation based on partial information to the media and then  having those assessments wind up in print. \nIn some cases, the circumstances that brought about the disaster to  begin with may have also damaged some or all normal means of  communications. A violent storm or an earthquake may have also  knocked out telecommunications systems; at that point, it's too late  to try to figure out other means of communicating both internally  and externally. \nWorkgroup Recovery \nWhen designing a disaster recovery plan, it's important to keep your  goal in mind—the restoration of workgroups to the point that they  can resume their activities in their usual work locations. It's easy to  get sidetracked and think of disaster recovery as purely an IT effort  focused on restoring systems and processes to working order. \nTo facilitate this effort, it's sometimes best to develop separate  recovery facilities for different workgroups. For example, if you have  several subsidiary organizations that are in different locations and  that perform tasks similar to the tasks that workgroups at your office  perform, you may want to consider temporarily relocating those  workgroups to the other facility and having them communicate  electronically and via telephone with other business units until  they're ready to return to the main operations facility. \nLarger organizations may have difficulty finding recovery facilities  capable of handling the entire business operation. This is another  example of a circumstance in which independent recovery of  different workgroups is appropriate. \nAlternate Processing Sites \nOne of the most important elements of the disaster recovery plan is  the selection of alternate processing sites to be used when the  primary sites are unavailable. Many options are available when  considering recovery facilities, limited only by the creative minds of  disaster recovery planners and available resources. In the following  sections, we cover several types of sites commonly used in disaster  recovery planning: cold sites, warm sites, hot sites, mobile sites, and  cloud computing. \nOrganizations building fully resilient processes may  use more than one alternate processing site in their disaster  recovery plan. Using multiple processing sites increases  geographic diversity and resilience. \nCold Sites \nCold sites are standby facilities large enough to handle the  processing load of an organization and equipped with appropriate  functioning electrical and environmental support systems. They may  be large warehouses, empty office buildings, or other similar  structures. However, a cold site has no computing facilities \n(hardware or software) preinstalled and also has no active  broadband communications links. Many cold sites do have at least a  few copper telephone lines, and some sites may have standby links  that can be activated with minimal notification. \nCold Site Setup \nA cold site setup is well depicted in the film Boiler Room , which  involves a chop-shop investment firm telemarketing bogus  pharmaceutical investment deals to prospective clients. In this  fictional case, the “disaster” is human-made, but the concept is  much the same, even if the timing is quite different. \nUnder threat of exposure and a pending law enforcement raid,  the firm establishes a nearby building that is empty, save for a  few banks of phones on dusty concrete floors in a mock-up of a  cold recovery site. Granted, this work is both fictional and illegal,  but it illustrates a very real and legitimate reason for maintaining  a redundant failover recovery site for the purpose of business  continuity. \nResearch the various forms of recovery sites, and then consider  which among them is best suited for your particular business  needs and budget. A cold site is the least expensive option and  perhaps the most practical. A warm site contains the data links  and preconfigured equipment necessary to begin restoring  operations but no usable data or information. The most expensive  option is a hot site, which fully replicates your existing business  infrastructure and is ready to take over for the primary site on  short notice. \nThe major advantage of a cold site is its relatively low cost—there's  no computing base to maintain and no monthly telecommunications  bill when the site is idle. However, the drawbacks of such a site are  obvious—there is a tremendous lag between the time the decision is  made to activate the site and the time when that site is ready to  support business operations. Servers and workstations must be  brought in and configured. Data must be restored from backup tapes. \nCommunications links must be activated or established. The time to  activate a cold site is often measured in weeks, making a quick  recovery close to impossible and often yielding a false sense of  security. It's also worth observing that the substantial time, effort,  and expense required to activate and transfer operations to a cold  site make this approach the most difficult to test. \nHot Sites \nA hot site is the exact opposite of the cold site. In this configuration,  a backup facility is maintained in constant working order, with a full  complement of servers, workstations, and communications links  ready to assume primary operations responsibilities. The servers and  workstations are all preconfigured and loaded with appropriate  operating system and application software. \nThe data on the primary site servers is periodically or continuously  replicated to corresponding servers at the hot site, ensuring that the  hot site has up-to-date data. Depending on the bandwidth available  between the sites, hot site data may be replicated instantaneously. If  that is the case, operators could move operations to the hot site at a  moment's notice. If it's not the case, disaster recovery managers have  three options to activate the hot site: \nIf there is sufficient time before the primary site must be shut  down, they can force replication between the two sites right  before the transition of operational control. \nIf replication is impossible, managers may carry backup tapes of  the transaction logs from the primary site to the hot site and  manually reapply any transactions that took place since the last  replication. \nIf there are no available backups and it isn't possible to force  replication, the disaster recovery team may simply accept the  loss of some portion of the data. This should only be done when  the loss is within the organization's recovery point objective \n(RPO). \nThe advantages of a hot site are obvious—the level of disaster  recovery protection provided by this type of site is unsurpassed. \nHowever, the cost is extremely high. Maintaining a hot site  essentially doubles an organization's budget for hardware, software,  and services and requires the use of additional employees to  maintain the site. \nIf you use a hot site, never forget that it has copies of  your production data. Be sure to provide that site with the same  level of technical and physical security controls you provide at  your primary site. \nIf an organization wants to maintain a hot site but wants to reduce  the expense of equipment and maintenance, it might opt to use a  shared hot site facility managed by an outside contractor. However,  the inherent danger in these facilities is that they may be overtaxed  in the event of a widespread disaster and be unable to service all  clients simultaneously. If your organization considers such an  arrangement, be sure to investigate these issues thoroughly, both  before signing the contract and periodically during the contract term. \nAnother method of reducing the expense of a hot site is to use the hot  site as a development or test environment. Developers can replicate  data to the hot site in real time both for test purposes and to provide  a live replica of the production environment. This reduces costs by  having the hot site provide a useful service to the organization even  when it is not actively being used for disaster operations. \nWarm Sites \nWarm sites occupy the middle ground between hot and cold sites for  disaster recovery specialists. They always contain the equipment and  data circuits necessary to rapidly establish operations. As with hot  sites, this equipment is usually preconfigured and ready to run  appropriate applications to support an organization's operations. \nUnlike hot sites, however, warm sites do not typically contain copies  of the client's data. The main requirement in bringing a warm site to  full operational status is the transportation of appropriate backup  media to the site and restoration of critical data on the standby  servers. \nActivation of a warm site typically takes at least 12 hours from the  time a disaster is declared. This does not mean that any site that can  be activated in less than 12 hours qualifies as a hot site, however;  switchover times for most hot sites are often measured in seconds or  minutes, and complete cutovers seldom take more than an hour or  two. \nWarm sites avoid significant telecommunications and personnel  costs inherent in maintaining a near-real-time copy of the  operational data environment. Like hot sites and cold sites, warm  sites may also be obtained on a shared facility basis. If you choose  this option, be sure that you have a “no lockout” policy written into  your contract guaranteeing you the use of an appropriate facility  even during a period of high demand. It's a good idea to take this  concept one step further and physically inspect the facilities and the  contractor's operational plan to reassure yourself that the facility will  indeed be able to back up the “no lockout” guarantee should push  ever come to shove. \nMobile Sites \nMobile sites are nonmainstream alternatives to traditional recovery  sites. They typically consist of self-contained trailers or other easily  relocated units. These sites include all the environmental control  systems necessary to maintain a safe computing environment. Larger  corporations sometimes maintain these sites on a “fly-away” basis,  ready to deploy them to any operating location around the world via  air, rail, sea, or surface transportation. Smaller firms might contract  with a mobile site vendor in their local area to provide these services  on an as-needed basis. \nIf your disaster recovery plan depends on a workgroup  recovery strategy, mobile sites are an excellent way to implement  that approach. They are often large enough to accommodate  entire (small!) workgroups. \nMobile sites are usually configured as cold sites or warm sites,  depending on the disaster recovery plan they are designed to  support. It is also possible to configure a mobile site as a hot site, but  this is unusual because you seldom know in advance where a mobile  site will need to be deployed. \nHardware Replacement Options \nOne thing to consider when determining mobile sites and  recovery sites in general is hardware replacement supplies. There  are basically two options for hardware replacement supplies. One  option is to employ “in-house” replacement, whereby you store  extra and duplicate equipment at a different but nearby location \n(that is, a warehouse on the other side of town). ( In-house here  means you own it already, not that it is necessarily housed under  the same roof as your production environment.) If you have a  hardware failure or a disaster, you can immediately pull the  appropriate equipment from your stash. The other option is an \nSLA-type agreement with a vendor to provide quick response and  delivery time in the event of a disaster. However, even a 4-, 12-, \n24-, or 48-hour replacement hardware contract from a vendor  does not provide a reliable guarantee that delivery will actually  occur. There are too many uncontrollable variables to rely on this  second option as your sole means of recovery. \nCloud Computing \nMany organizations now turn to cloud computing as their preferred  disaster recovery option. Infrastructure-as-a-service (IaaS)  providers, such as Amazon Web Services (AWS), Microsoft Azure,  and Google Cloud, offer on-demand service at low cost. Companies  wishing to maintain their own data centers may choose to use these \nIaaS cloud providers as backup service providers. Storing ready-to-  run images with cloud providers is often quite cost effective and  allows the organization to avoid incurring most of the operating cost  until the cloud site activates in a disaster. \nOrganizations that already operate their technology resources in the  cloud don't get a free pass on disaster recovery. They must also think  about how they will handle issues that arise within their cloud  environment. They should then design and configure their use of  cloud services to take advantage of redundancy options, geographic  dispersion, and similar considerations. \nOrganizations relying on cloud computing for their disaster recovery  plan should consider entering into a resource capacity agreement  with their cloud providers. This agreement ensures that the cloud  provider will provide the resources needed to support disaster  recovery operations. \nMutual Assistance Agreements \nMutual assistance agreements (MAAs) are also called reciprocal  agreements . They provide an alternate processing option that  doesn't require significant capital investment. Under an MAA, two  organizations pledge to assist each other in the event of a disaster by  sharing computing facilities or other technological resources. They  appear to be extremely cost effective at first glance—it's not  necessary for either organization to maintain expensive alternate  processing sites (such as the hot sites, warm sites, cold sites, and  mobile processing sites described in the previous sections). Indeed,  many MAAs are structured to provide one of the levels of service  described. In the case of a cold site, each organization may simply  maintain some open space in their processing facilities for the other  organization to use in the event of a disaster. In the case of a hot site,  the organizations may host fully redundant servers for each other. \nHowever, many drawbacks inherent to MAAs prevent their  widespread use: \nMAAs are difficult to enforce. The parties might trust each other  to provide support in the event of a disaster. However, when  push comes to shove, the nonvictim might renege on the  agreement. A victim may have legal remedies available, but this  doesn't help the immediate disaster recovery effort. \nCooperating organizations should be located in relatively close  proximity to each other to facilitate transportation of employees  between sites. However, proximity means that both  organizations may be vulnerable to the same threats. An MAA  won't do you any good if an earthquake levels your city and  destroys processing sites for both participating organizations. \nConfidentiality concerns often prevent businesses from placing  their data in the hands of others. These may be legal concerns \n(such as in the handling of healthcare or financial data) or  business concerns (such as trade secrets or other intellectual  property issues). \nDespite these concerns, an MAA may be a good disaster recovery  solution for an organization, especially in cases where the agreement  is between two internal units or subsidiaries of the same  organization who have an incentive to cooperate. \nDatabase Recovery \nMany organizations rely on databases to process and track  operations, sales, logistics, and other activities vital to their  continued viability. For this reason, it's essential that you include  database recovery techniques in your disaster recovery plans. It's a  wise idea to have a database specialist on the DRP team who can  provide input as to the technical feasibility of various ideas. After all,  you shouldn't allocate several hours to restore a database backup  when it's impossible to complete a restoration in less than half a day. \nIn the following sections, we'll cover the three main techniques used  to create off-site copies of database content: electronic vaulting,  remote journaling, and remote mirroring. Each one has specific  benefits and drawbacks, so you'll need to analyze your organization's  computing requirements and available resources to select the option  best suited to your firm and within the boundaries of your RPO. \nSelecting solutions that lose data beyond your RPO pose  unwarranted risk, whereas selecting those that are more aggressive  than your RPO may incur unnecessary costs. \nElectronic Vaulting \nIn an electronic vaulting scenario, database backups are moved to a  remote site using bulk transfers. The remote location may be a  dedicated alternative recovery site (such as a hot site) or simply an  off-site location managed within the company or by a contractor for  the purpose of maintaining backup data. \nIf you use electronic vaulting, remember that there may be a  significant delay between the time you declare a disaster and the  time your database is ready for operation with current data. If you  decide to activate a recovery site, technicians will need to retrieve the  appropriate backups from the electronic vault and apply them to the  soon-to-be production servers at the recovery site. \nBe careful when considering vendors for an  electronic vaulting contract. Definitions of electronic vaulting  vary widely within the industry. Don't settle for a vague promise  of “electronic vaulting capability.” Insist on a written definition of  the service that will be provided, including the storage capacity,  bandwidth of the communications link to the electronic vault,  and the time necessary to retrieve vaulted data in the event of a  disaster. \nAs with any type of backup scenario, be certain to periodically test  your electronic vaulting setup. A great method for testing backup  solutions is to give disaster recovery personnel a “surprise test,”  asking them to restore data from a certain day. \nIt's important to know that electronic vaulting  introduces the potential for significant data loss. In the event of a  disaster, you will only be able to recover information as of the  time of the last vaulting operation. \nRemote Journaling \nWith remote journaling , data transfers are performed in a more  expeditious manner. Data transfers still occur in a bulk transfer  mode, but they occur on a more frequent basis, usually once every  hour and sometimes more frequently. Unlike electronic vaulting  scenarios, where entire database backup files are transferred, remote  journaling setups transfer copies of the database transaction logs  containing the transactions that occurred since the previous bulk  transfer. \nRemote journaling is similar to electronic vaulting in that transaction  logs transferred to the remote site are not applied to a live database  server but are maintained in a backup device. When a disaster is  declared, technicians retrieve the appropriate transaction logs and  apply them to the production database, bringing the database up to  the current production state. \nRemote Mirroring \nRemote mirroring is the most advanced database backup solution. \nNot surprisingly, it's also the most expensive! Remote mirroring goes  beyond the technology used by remote journaling and electronic  vaulting; with remote mirroring, a live database server is maintained  at the backup site. The remote server receives copies of the database  modifications at the same time they are applied to the production  server at the primary site. Therefore, the mirrored server is ready to  take over an operational role at a moment's notice. \nRemote mirroring is a popular database backup strategy for  organizations seeking to implement a hot site. However, when  weighing the feasibility of a remote mirroring solution, be sure to  take into account the infrastructure and personnel costs required to  support the mirrored server, as well as the processing overhead that  will be added to each database transaction on the mirrored server. \nCloud-based database platforms may include  redundancy capabilities as a built-in feature. If you operate  databases in the cloud, consider investigating these options to  simplify your disaster recovery planning efforts, but be sure to  understand the limitations of the specific service you consider! \nRecovery Plan Development \nOnce you've established your business unit priorities and have a  good idea of the appropriate alternative recovery sites for your  organization, it's time to put pen to paper and begin drafting a true  disaster recovery plan. Don't expect to sit down and write the full  plan in one sitting. It's likely that the DRP team will go through  many draft documents before reaching a final written document that  satisfies the operational needs of critical business units and falls  within the resource, time, and expense constraints of the disaster  recovery budget and available personnel. \nIn the following sections, we explore some important items to  include in your disaster recovery plan. Depending on the size of your  organization and the number of people involved in the DRP effort, it  may be a good idea to maintain multiple types of plan documents,  intended for different audiences. The following list includes various  types of documents worth considering: \nExecutive summary providing a high-level overview of the plan \nDepartment-specific plans \nTechnical guides for IT personnel responsible for implementing  and maintaining critical backup systems \nChecklists for individuals on the disaster recovery team \nFull copies of the plan for critical disaster recovery team  members \nUsing custom-tailored documents becomes especially important  when a disaster occurs or is imminent. Personnel who need to  refresh themselves on the disaster recovery procedures that affect  various parts of the organization will be able to refer to their  department-specific plans. Critical disaster recovery team members  will have checklists to help guide their actions amid the chaotic  atmosphere of a disaster. IT personnel will have technical guides  helping them get the alternate sites up and running. Finally,  managers and public relations personnel will have a simple  document that walks them through a high-level view of the  coordinated symphony that is an active disaster recovery effort  without requiring interpretation from team members busy with tasks  directly related to that effort. \nVisit the Professional Practices library at  http://drii.org/resources/professionalpractices/EN to  examine a collection of documents that explain how to work  through and document your planning processes for BCP and  disaster recovery. Other good standard documents in this area  include the BCI Good Practice Guidelines (GPG) \n( www.thebci.org/resource/good-practice-guidelines--gpg--  edition-7-0.html ), ISO 27001:2022 \n( www.iso.org/standard/27001 ), and NIST SP 800-34— \nContingency Planning Guide for Federal Information Systems \n( www.nist.gov/privacy-framework/nist-sp-800-34 ). \nEmergency Response \nA disaster recovery plan should contain simple yet comprehensive  instructions for essential personnel to follow immediately upon  recognizing that a disaster is in progress or is imminent. These  instructions will vary widely depending on the nature of the disaster,  the type of personnel responding to the incident, and the time  available before facilities need to be evacuated and/or equipment  shut down. For example, instructions for a large-scale fire will be  much more concise than the instructions for how to prepare for a  hurricane that is still 48 hours away from a predicted landfall near  an operational site. Emergency-response plans are often put together  in the form of checklists provided to responders. When designing  such checklists, keep one essential design principle in mind: arrange  the checklist tasks in order of priority, with the most important task  first. \nIt's essential to remember that these checklists will be executed in  the midst of a crisis. It is extremely likely that responders will not be  able to complete the entire checklist, especially in the event of a  short-notice disaster. For this reason, you should put the most  essential tasks first on the checklist. The lower an item on the list, the  lower the likelihood that it will be completed before an  evacuation/shutdown takes place. \nAmong these essential tasks is the formal declaration of a disaster. \nThe response plan should include clear criteria for activation of the  disaster recovery plan, define who has the authority to declare a  disaster, and then discuss notification procedures, as discussed in  the next section. \nPersonnel and Communications \nA disaster recovery plan should also contain a list of personnel to  contact in the event of a disaster. Usually, this includes key members  of the DRP team as well as personnel who execute critical disaster  recovery tasks throughout the organization. This response checklist  should include alternate means of contact (e.g., pager numbers,  mobile numbers) as well as backup contacts for each role should the  primary contact be incommunicado or unable to reach the recovery  site for one reason or another. \nThe Power of Checklists \nChecklists are invaluable tools in the face of disaster. They  provide a sense of order amid the chaotic events surrounding a  disaster. Do what you must to ensure that response checklists  provide first responders with a clear plan to protect life and  property and ensure the continuity of operations. \nA checklist for response to a building fire might include the  following steps: \n1. Activate the building alarm system. \n2. Ensure that an orderly evacuation is in progress. \n3. If reasonable to do so, consider fighting the fire with  available fire extinguishers or other fire suppression  equipment. \n4. After leaving the building, use a mobile telephone to call  emergency services (911 in the United States) to ensure that  emergency authorities received the alarm notification. \nProvide additional information on any required emergency  response. \n5. Ensure that any injured personnel receive appropriate  medical treatment. \n6. Activate the organization's disaster recovery plan to ensure  continuity of operations. \nAssessment \nWhen the disaster recovery team arrives on-site, one of their first  tasks is to assess the situation. This normally occurs in a rolling  fashion, with the first responders performing a simple assessment to  triage activity and get the disaster response under way. As the  incident progresses, more detailed assessments will take place to  gauge the effectiveness of disaster recovery efforts and prioritize the  assignment of resources. \nBackups and Storage Strategies \nBackups play an important role in the disaster recovery plan. They  are copies of data stored on tape, disk, the cloud, or other media as a  last-ditch recovery option. If a natural or human-made disaster  causes data loss, administrators may turn to backups to recover lost  data. \nYour disaster recovery plan (especially the technical guide) should  fully address the backup strategy pursued by your organization. \nIndeed, this is one of the most important elements of any business  continuity plan and disaster recovery plan. \nMany system administrators are already familiar with various types  of backups, so you'll benefit by bringing one or more individuals with  specific technical expertise in this area onto the BCP/DRP team to  provide expert guidance. There are three main types of backups: \nFull Backups As the name implies, full backups store a complete  copy of the data contained on the protected device. Full backups  duplicate every file on the system regardless of the setting of the  archive bit. Once a full backup is complete, the archive bit on every  file is reset, turned off, or set to 0. \nIncremental Backups Incremental backups store only those  files that have been modified since the time of the most recent full or  incremental backup. Only files that have the archive bit turned on,  enabled, or set to 1 are duplicated. Once an incremental backup is  complete, the archive bit on all duplicated files is reset, turned off, or  set to 0. \nDifferential Backups Differential backups store all files that  have been modified since the time of the most recent full backup. \nOnly files that have the archive bit turned on, enabled, or set to 1 are  duplicated. However, unlike full and incremental backups, the  differential backup process does not change the archive bit. \nSome operating systems do not actually use an  archive bit to achieve this goal and instead analyze file system  timestamps. This difference in implementation doesn't affect the  types of data stored by each backup type. \nThe most important difference between incremental and differential  backups is the time needed to restore data in the event of an  emergency. If you use a combination of full and differential backups,  you will need to restore only two backups—the most recent full  backup and the most recent differential backup. On the other hand, if  your strategy combines full backups with incremental backups, you  will need to restore the most recent full backup as well as all  incremental backups performed since that full backup. The trade-off  is the time required to create the backups—differential backups don't  take as long to restore, but they take longer to create than  incremental ones. \nThe storage of the backup media is equally critical. It may be  convenient to store backup media in or near the primary operations  center to easily fulfill user requests for backup data, but you'll  definitely need to keep copies of the media in at least one off-site  location to provide redundancy should your primary operating  location be suddenly destroyed. One common strategy used by many  organizations is to store backups in a cloud service that is itself  geographically redundant. This allows the organization to retrieve  the backups from any location after a disaster. Note that using  geographically diverse sites may introduce new regulatory  requirements when the information resides in different jurisdictions. \nUsing Backups \nIn case of system failure, many companies use one of two  common methods to restore data from backups. In the first  situation, they run a full backup on Monday night and then run  differential backups every other night of the week. If a failure  occurs Saturday morning, they restore Monday's full backup and  then restore only Friday's differential backup. In the second  situation, they run a full backup on Monday night and run  incremental backups every other night of the week. If a failure  occurs Saturday morning, they restore Monday's full backup and  then restore each incremental backup in original chronological  order. \nMost organizations adopt a backup strategy that utilizes more than  one of the three backup types along with a media rotation scheme. \nBoth allow backup administrators access to a sufficiently large range  of backups to complete user requests and provide fault tolerance  while minimizing the amount of money that must be spent on  backup media. A common strategy is to perform full backups over  the weekend and incremental or differential backups on a nightly  basis. The specific method of backup and all of the particulars of the  backup procedure are dependent on your organization's fault-  tolerance requirements, as defined by your RPO values. If you are  unable to survive minor amounts of data loss, your ability to tolerate  faults is low. However, if hours or days of data can be lost without  serious consequence, your tolerance of faults is high. You should  design your backup solution accordingly. \nThe Oft-Neglected Backup \nBackups are probably the least practiced and most neglected  preventive measure known to protect against computing  disasters. A comprehensive backup of all operating system and  personal data on workstations happens less frequently than for  servers or mission-critical machines, but they all serve an equal  and necessary purpose. \nDamon, an information professional, learned this the hard way  when he lost months of work following a natural disaster that  wiped out the first floor at an information brokering firm. He  never used the backup facilities built into his operating system or  any of the shared provisions established by his administrator, \nCarol. \nCarol has been there and done that, so she knows a thing or two  about backup solutions. She has established incremental backups  on her production servers and differential backups on her  development servers, and she's never had an issue restoring lost  data. \nThe toughest obstacle to a solid backup strategy is human nature,  so a simple, transparent, and comprehensive strategy is the most  practical. Differential backups require only two container files \n(the latest full backup and the latest differential) and can be  scheduled for periodic updates at some specified interval. That's  why Carol elects to implement this approach and feels ready to  restore from her backups any time she's called on to do so. \nDisk-to-Disk Backup \nOver the past decade, disk storage has become increasingly  inexpensive. With drive capacities now measured in terabytes, tape  and optical media can't cope with data volume requirements  anymore. Many enterprises now use disk-to-disk (D2D) backup  solutions for some portion of their disaster recovery strategy. \nMany backup technologies are designed around the tape paradigm. \nVirtual tape libraries (VTLs) support the use of disks with this  model by using software to make disk storage appear as tapes to  backup software. \nOne important note: organizations seeking to adopt an entirely disk-  to-disk approach must remember to maintain geographical diversity. \nSome of those disks have to be located off-site. Many organizations  solve this problem by hiring managed service providers to manage  remote backup locations. \nCloud Storage \nCloud storage provides a flexible and scalable solution for backups,  offering remote, geographically diverse data storage. It mitigates the  risk of data loss due to local disasters by enabling data retrieval from  any location. Cloud backups often incorporate redundancy and can  be more cost-effective, eliminating the need for physical storage  management. Regulatory considerations apply when storing data  across jurisdictions, making compliance an integral part of cloud  storage strategy in disaster recovery planning. \nBackup Best Practices \nNo matter what the backup solution, media, or method, you must  address several common issues with backups. For instance, backup  and restoration activities can be bulky and slow. Such data  movement can significantly affect the performance of a network,  especially during regular production hours. Thus, backups should be  scheduled during the low peak periods (for example, at night). \nThe amount of backup data increases over time. This causes the  backup (and restoration) processes to take longer each time you  perform a backup. Each backup also consumes more space on the  backup media. Thus, you need to build sufficient capacity to handle a  reasonable amount of growth over a reasonable amount of time into  your backup solution. What is reasonable all depends on your  environment and budget. \nWith periodic backups (that is, backups that are run every 24 hours),  there is always the potential for data loss up to the length of the  period. Murphy's law dictates that a server never crashes  immediately after a successful backup. Instead, it is always just  before the next backup begins. To avoid the problem with periods,  you may deploy some form of real-time continuous backup, such as \nRAID, clustering, or server mirroring. \nOnly include necessary information in backups. For example, it  might not be important to store operating system files in routine  backups. Do you really need hundreds of copies of the operating  system? The answer to this question should be influenced by your  recovery objectives. If your RTO dictates a rapid recovery capability,  the storage cost of maintaining many copies of the operating system  may be justified by the fact that it makes restoring the entire system  from a stored image quite fast. If you can tolerate a longer recovery  time, you might be able to reduce your storage costs by eliminating  the backup of redundant files. \nFinally, remember to test your organization's recovery processes. \nOrganizations often rely on the fact that their backup software  reports a successful backup and fail to attempt recovery until it's too  late to detect a problem. This is one of the biggest causes of backup  failures. \nTape Rotation \nThere are several commonly used tape rotation strategies for  backups: the Grandfather-Father-Son (GFS) strategy, the Tower of \nHanoi strategy, and the Six Cartridge Weekly Backup strategy. These  strategies can be fairly complex, especially with large tape sets. They  can be implemented manually using a pencil and a calendar or  automatically by using either commercial backup software or a fully  automated hierarchical storage management (HSM) system. An \nHSM system is an automated robotic backup jukebox consisting of \n32 or 64 optical or tape backup devices. All the drive elements within  an HSM system are configured as a single drive array (a bit like \nRAID). \nDetails about various tape rotations are beyond the  scope of this book, but if you want to learn more about them,  search by their names on the Internet. \nSoftware Escrow Arrangements \nA software escrow arrangement is a unique tool used to protect a  company against the failure of a software developer to provide  adequate support for its products or against the possibility that the  developer will go out of business and no technical support will be  available for the product. \nFocus your efforts on negotiating software escrow  agreements with those suppliers you fear may go out of business  because of their size. It's not likely that you'll be able to negotiate  such an agreement with a firm such as Microsoft, unless you are  responsible for an extremely large corporate account with serious  bargaining power. On the other hand, it's equally unlikely that a  firm of Microsoft's magnitude will go out of business, leaving end  users high and dry. \nIf your organization depends on custom-developed software or  software products produced by a small firm, you may want to  consider developing this type of arrangement as part of your disaster  recovery plan. Under a software escrow agreement, the developer  provides copies of the application source code to an independent  third-party organization. This third party then maintains updated  backup copies of the source code in a secure fashion. The agreement  between the end user and the developer specifies “trigger events,”  such as the failure of the developer to meet terms of a service-level  agreement (SLA) or the liquidation of the developer's firm. When a  trigger event takes place, the third party releases copies of the  application source code to the end user. The end user can then  analyze the source code to resolve application issues or implement  software updates. \nUtilities \nAs discussed in previous sections of this chapter, your organization is  reliant on several utilities to provide critical elements of your  infrastructure (e.g., electric power, water, natural gas, sewer service). \nYour disaster recovery plan should contain contact information and  procedures to troubleshoot these services if problems arise during a  disaster. \nLogistics and Supplies \nThe logistical problems surrounding a disaster recovery operation  are immense. You will suddenly face the problem of moving large  numbers of people, equipment, and supplies to alternate recovery  sites. It's also possible that the people will be living at those sites for  an extended period of time and that the disaster recovery team will  be responsible for providing them with food, water, shelter, and  appropriate facilities. Your disaster recovery plan should contain  provisions for this type of operation if it falls within the scope of your  expected operational needs. \nRecovery vs. Restoration \nIt is sometimes useful to separate disaster recovery tasks from  disaster restoration tasks. This is especially true when a recovery  effort is expected to take a significant amount of time. A disaster  recovery team may be assigned to implement and maintain  operations at the recovery site, and a salvage team is assigned to  restore the primary site to operational capacity. Make these  allocations according to the needs of your organization and the types  of disasters you face. \nRecovery and restoration are separate concepts. In  this context, recovery involves bringing business operations and  processes back to a working state. Restoration involves bringing a  business facility and environment back to a workable state. \nThe recovery team members have a very short time frame in which to  operate. They must put the DRP into action and restore IT  capabilities as swiftly as possible. If the recovery team fails to restore  business processes within the MTD/RTO, then the company fails. \nOnce the original site is deemed safe for people, the salvage team  members begin their work. Their job is to restore the company to its  full original capabilities and, if necessary, to the original location. If  the original location is no longer in existence, a new primary spot is  selected. The salvage team must rebuild or repair the IT  infrastructure. Since this activity is basically the same as building a  new IT system, the return activity from the alternate/recovery site to  the primary/original site is itself a risky activity. Fortunately, the  salvage team has more time to work than the recovery team. \nThe salvage team must ensure the reliability of the new IT  infrastructure. This is done by returning the least mission-critical  processes to the restored original site to stress-test the rebuilt  network. As the restored site shows resiliency, more important  processes are transferred. A serious vulnerability exists when  mission-critical processes are returned to the original site. The act of  returning to the original site could cause a disaster of its own. \nTherefore, the state of emergency cannot be declared over until full  normal operations have returned to the restored original site. \nAt the conclusion of any disaster recovery effort, the time will come  to restore operations at the primary site and terminate any  processing sites operating under the disaster recovery agreement. \nYour DRP should specify the criteria used to determine when it is  appropriate to return to the primary site and guide the DRP recovery  and salvage teams through an orderly transition. \nTraining, Awareness, and Documentation \nAs with a business continuity plan, it is essential that you provide  training to all personnel who will be involved in the disaster recovery  effort. The level of training required will vary according to an  individual's role in the effort and their position within the company. \nWhen designing a training plan, consider including the following  elements: \nOrientation training for all new employees \nInitial training for employees taking on a new disaster recovery  role for the first time \nDetailed refresher training for disaster recovery team members \nBrief awareness refreshers for all other employees (can be  accomplished as part of other meetings and through a medium  like email newsletters sent to all employees) \nLoose-leaf binders are an excellent way to store  disaster recovery plans. You can distribute single-page changes to  the plan without destroying an entire forest! \nThe disaster recovery plan should also be fully documented. Earlier  in this chapter, we discussed several of the documentation options  available to you. Be sure you implement the necessary  documentation programs and modify the documentation as changes  to the plan occur. Because of the rapidly changing nature of the  disaster recovery and business continuity plans, you might consider  publication on a secured portion of your organization's intranet. \nYour DRP should be treated as an extremely sensitive document and  provided to individuals on a compartmentalized, need-to-know basis  only. Individuals who participate in the plan should understand their  roles fully, but they do not need to know or have access to the entire  plan. Of course, it is essential to ensure that key DRP team members  and senior management have access to the entire plan and  understand the high-level implementation details. You certainly  don't want this knowledge to rest in the mind of only one individual. \nRemember that a disaster may render your intranet  unavailable. If you choose to distribute your disaster recovery and  business continuity plans through an intranet, be sure you  maintain an adequate number of printed copies of the plan at  both the primary and alternate sites and maintain only the most  current copy! \nTesting and Maintenance \nEvery disaster recovery plan must be tested on a periodic basis to  ensure that the plan's provisions are viable and that it meets an  organization's changing needs. The types of tests that you conduct  will depend on the types of recovery facilities available to you, the  culture of your organization, and the availability of disaster recovery  team members. The six main test types—read-throughs, tabletops,  walk-throughs, simulation tests, parallel tests, and full-interruption  tests—are discussed in the remaining sections of this chapter. \nFor more information on this topic, consult NIST SP \n800-84—Guide to Test, Training, and Exercise Programs for IT \nPlans and Capabilities , available at  http://csrc.nist.gov/pubs/sp/800/84/final . \nRead-Through \nThe read-through is one of the simplest tests to conduct, but it's also  one of the most critical. In this test, you distribute copies of disaster  recovery plans to the members of the disaster recovery team for  review. This lets you accomplish three goals simultaneously: \nIt ensures that key personnel are aware of their responsibilities  and have that knowledge refreshed periodically. \nIt provides individuals with an opportunity to review the plans  for obsolete information and update any items that require  modification because of changes within the organization. \nIn large organizations, it helps identify situations in which key  personnel have left the company and nobody bothered to  reassign their disaster recovery responsibilities. This is also a  good reason why disaster recovery responsibilities should be  included in job descriptions. \nTabletop \nDuring a tabletop , members of the disaster recovery team gather in a  large conference room and role-play a disaster scenario. Usually, the  exact scenario is known only to the test moderator, who presents the  details to the team at the meeting. The team members then refer to  their copies of the disaster recovery plan and discuss the appropriate  responses to that particular type of disaster. \nWalk-Through \nWalk-throughs may vary in their scope and intent. Some exercises  include taking physical actions or at least considering their impact on  the exercise. For example, a walk-through might require that  everyone leave the building and return home to participate in the  exercise. \nSimulation Test \nIn simulation tests , disaster recovery team members are presented  with a scenario and asked to develop an appropriate response. \nUnlike with the tests previously discussed, some of these response  measures are then tested. This may involve the interruption of  noncritical business activities and the use of some operational  personnel. \nParallel Test \nParallel tests represent the next level in testing and involve  relocating personnel to the alternate recovery site and implementing  site activation procedures. The employees relocated to the site  perform their disaster recovery responsibilities just as they would for  an actual disaster. The only difference is that operations at the main  facility are not interrupted. That site retains full responsibility for  conducting the day-to-day business of the organization. \nFull-Interruption Test \nFull-interruption tests operate like parallel tests, but they involve  actually shutting down operations at the primary site and shifting  them to the recovery site. These tests involve a significant risk, since  they require the operational shutdown of the primary site and  transfer to the recovery site, followed by the reverse process to  restore operations at the primary site. For this reason, full-  interruption tests are extremely difficult to arrange, and you often  encounter resistance from management. \nLessons Learned \nAt the conclusion of any disaster recovery operation or other security  incident, the organization should conduct a lessons learned session. \nThe lessons learned process is designed to provide everyone involved  with the incident response effort an opportunity to reflect on their  individual roles in the incident and the team's response overall. It is  an opportunity to improve the processes and technologies used in  incident response to better respond to future security crises. \nThe most common way to conduct lessons learned is to gather  everyone in the same room, or connect them via videoconference or  telephone, and ask a trained facilitator to lead a lessons learned  session. Ideally, this facilitator should have played no role in the  incident response, leaving them with no preconceived notions about  the response. The facilitator should be a neutral party who simply  helps guide the conversation. \nTime is of the essence with the lessons learned session because, as  time passes, details quickly become fuzzy and memories are lost. The  more quickly you conduct a lessons learned session, the more likely  it is that you will receive valuable feedback that can help guide future  responses. \nIn SP 800-61, NIST offers a series of questions to use in the lessons  learned process. They include the following: \nExactly what happened and at what times? \nHow well did staff and management perform in dealing with the  incident? \nWere documented procedures followed? \nWere the procedures adequate? \nWhat information was needed sooner? \nWere any steps or actions taken that might have inhibited the  recovery? \nWhat would the staff and management do differently the next  time a similar incident occurs? \nHow could information sharing with other organizations have  been improved? \nWhat corrective actions can prevent similar incidents in the  future? \nWhat precursors or indicators should be watched for in the  future to detect similar incidents? \nWhat additional tools or resources are needed to detect, analyze,  and mitigate future incidents? \nThe responses to these questions, if given honestly, will provide  valuable insight into the state of the organization's incident response  program. They can help provide a road map of future improvements  designed to bolster disaster recovery. The facilitator should work  with the team leader to document the lessons learned in a report that  includes suggested process improvement actions. \nMaintenance \nRemember that a disaster recovery plan is a living document. As  your organization's needs change, you must adapt the disaster  recovery plan to meet those changed needs to follow suit. You will  discover many necessary modifications by using a well-organized  and coordinated testing plan. Minor changes may often be made  through a series of telephone conversations or emails, whereas major  changes may require one or more meetings of the full disaster  recovery team. \nA disaster recovery planner should refer to the organization's  business continuity plan as a template for its recovery efforts. This  and all the supportive material may need to comply with applicable  regulations and reflect current business needs. Business processes  such as payroll and order generation should contain specified  metrics mapped to related IT systems and infrastructure. \nMost organizations apply formal change management processes so  that whenever the IT infrastructure changes, all relevant  documentation is updated and checked to reflect such changes. \nRegularly scheduled fire drills and dry runs to ensure that all  elements of the DRP are used properly to keep staff trained present a  perfect opportunity to integrate changes into regular maintenance  and change management procedures. Design, implement, and  document changes each time you go through these processes and  exercises. Know where everything is, and keep each element of the \nDRP working properly. In case of an emergency, use your recovery  plan. Finally, make sure the staff stays trained to keep their skills  sharp—for existing support personnel—and use simulated exercises  to bring new people up to speed quickly. \nTest Communications \nBefore embarking on any test, it's essential to inform all stakeholders  about what to expect. This includes giving them an idea of the  scheduled timing, the potential impacts, and the overarching goals of  the test. By doing so, you not only ensure that business operations  continue smoothly, but you're also managing and setting accurate  expectations. \nDuring the test, especially ones that might disrupt normal operations  like full-interruption tests, giving regular updates becomes crucial. \nStakeholders need to be kept in the loop about the progress, any  challenges faced, and any deviations from the expected end time. \nSuch transparency not only keeps everyone informed but also helps  in building trust. \nPost-test, a debriefing session provides an opportunity for discussing  the outcomes of the test, highlighting both the successes and  pinpointing areas that need improvement. It provides closure to the  current test and paves the way for future enhancements. \nMany industries and regions have stringent regulations dictating the  details of disaster recovery plan testing. Keeping regulators informed  is not just about compliance, but it also underscores the  organization's commitment to resilience and good governance. \nFurthermore, maintaining comprehensive records and sharing them  as required reinforces this commitment and keeps the regulatory  relationship transparent. \nSummary \nDisaster recovery planning is critical to a comprehensive information  security program. DRPs serve as a valuable complement to business  continuity plans and ensure that the proper technical controls are in  place to keep the business functioning and to restore service after a  disruption. \nIn this chapter, you learned about the different types of natural and  human-made disasters that may impact your business. You also  explored the types of recovery sites and backup strategies that  bolster your recovery capabilities. \nAn organization's disaster recovery plan is one of the most important  documents under the purview of security professionals. It should  provide guidance to the personnel responsible for ensuring the  continuity of operations in the face of disaster. The DRP provides an  orderly sequence of events designed to activate alternate processing  sites while simultaneously restoring the primary site to operational  status. Once you've successfully developed your DRP, you must train  personnel on its use, ensure that you maintain accurate  documentation, and conduct periodic tests to keep the plan fresh in  the minds of responders. \nStudy Essentials \nKnow the common types of natural disasters that may  threaten an organization. Natural disasters that commonly  threaten organizations include earthquakes, floods, storms, fires,  pandemics, tsunamis, and volcanic eruptions. \nKnow the common types of human-made disasters that  may threaten an organization. Explosions, electrical fires,  terrorist acts, power outages, other utility failures, infrastructure  failures, hardware/software failures, labor difficulties, theft, and  vandalism are all common human-made disasters. \nBe familiar with the common types of recovery facilities. \nThe common types of recovery facilities are cold sites, warm sites,  hot sites, mobile sites, cloud computing, and multiple sites. Be sure  you understand the benefits and drawbacks of each such facility. \nExplain the potential benefits behind mutual assistance  agreements as well as the reasons they are not commonly  implemented in businesses today. Mutual assistance  agreements (MAAs) provide an inexpensive alternative to disaster  recovery sites, but they are not commonly used because they are  difficult to enforce. Organizations participating in an MAA may also  be shut down by the same disaster, and MAAs raise confidentiality  concerns. \nUnderstand the technologies that may assist with database  backup. Databases benefit from three backup technologies. \nElectronic vaulting is used to transfer database backups to a remote  site as part of a bulk transfer. In remote journaling, data transfers  occur on a more frequent basis. With remote mirroring technology,  database transactions are mirrored at the backup site in real time. \nExplain the common processes used in disaster recovery  programs. These programs should take a comprehensive  approach to planning and include considerations related to the initial  response effort, personnel involved, communication among the team  members and with internal and external entities, assessment of  response efforts, and restoration of services. DR programs should  also include training and awareness efforts to ensure personnel  understand their responsibilities and lessons learned sessions to  continuously improve the program. \nKnow the six types of disaster recovery plan tests and the  impact each has on normal business operations. The six  types of disaster recovery plan tests are read-throughs, tabletops,  walk-throughs, simulation tests, parallel tests, and full-interruption  tests. Read-throughs are purely paperwork exercises, whereas  tabletops and walk-throughs involve project team meetings. They  have no impact on business operations. Simulation tests may shut  down noncritical business units. Parallel tests involve relocating  personnel but do not affect day-to-day operations. Full-interruption  tests involve shutting down primary systems and shifting  responsibility to the recovery facility. \nWritten Lab \n1. What are some of the main concerns businesses have when  considering adopting a mutual assistance agreement? \n2. List and explain the six types of disaster recovery tests. \n3. Explain the differences between the three types of backup  strategies discussed in this chapter. \n4. Describe how cloud computing influences disaster recovery  programs. \nReview Questions \n1. James is working with his organization's leadership to help them  understand the role that disaster recovery plays in their  cybersecurity strategy. The leaders are confused about the  differences between disaster recovery and business continuity. \nWhat is the end goal of disaster recovery planning? \nA. Preventing business interruption \nB. Setting up temporary business operations \nC. Restoring normal business activity \nD. Minimizing the impact of a disaster \n2. Kevin is attempting to determine an appropriate backup  frequency for his organization's database server and wants to  ensure that any data loss is within the organization's risk  appetite. Which one of the following security process metrics  would best assist him with this task? \nA. RTO \nB. MTD \nC. RPO \nD. MTBF \n3. Brian's organization recently suffered a disaster and wants to  improve their disaster recovery program based upon their  experience. Which one of the following activities will best assist  with this task? \nA. Training programs \nB. Awareness efforts \nC. BIA review \nD. Lessons learned \n4. Adam is reviewing the fault tolerance controls used by his  organization and realizes that they currently have a single point  of failure in the disks used to support a critical server. Which  one of the following controls can provide fault tolerance for  these disks? \nA. Load balancing \nB. RAID \nC. Clustering \nD. High availability (HA) pairs \n5. Brad is helping to design a disaster recovery strategy for his  organization and is analyzing possible storage locations for  backup data. He is not certain where the organization will  recover operations in the event of a disaster and would like to  choose an option that allows them the flexibility to easily  retrieve data from any DR site. Which one of the following  storage locations provides the best option for Brad? \nA. Primary data center \nB. Field office \nC. Cloud computing \nD. IT manager's home \n6. Which of the following statements about business continuity  planning and disaster recovery planning are correct? (Choose all  that apply.) \nA. Business continuity planning is focused on keeping  business functions uninterrupted when a disaster strikes. \nB. Organizations can choose whether to develop business  continuity planning or disaster recovery planning plans. \nC. Business continuity planning picks up where disaster  recovery planning leaves off. \nD. Disaster recovery planning guides an organization through  recovery of normal operations at the primary facility. \n7. Tonya is reviewing the flood risk to her organization and learns  that their primary data center resides within a 100-year  floodplain. What conclusion can she draw from this  information? \nA. The last flood of any kind to hit the area was more than 100  years ago. \nB. The odds of a flood at this level are 1 in 100 in any given  year. \nC. The area is expected to be safe from flooding for at least 100  years. \nD. The last significant flood to hit the area was more than 100  years ago. \n8. Randi is designing a disaster recovery mechanism for her  organization's critical business databases. She selects a strategy  where an exact, up-to-date copy of the database is maintained at  an alternative location. What term describes this approach? \nA. Transaction logging \nB. Remote journaling \nC. Electronic vaulting \nD. Remote mirroring \n9. Bryn runs a corporate website and currently uses a single server,  which is capable of handling the site's entire load. She is  concerned, however, that an outage on that server could cause  the organization to exceed its RTO. What action could she take  that would best protect against this risk? \nA. Install dual power supplies in the server. \nB. Replace the server's hard drives with RAID arrays. \nC. Deploy multiple servers behind a load balancer. \nD. Perform regular backups of the server. \n10. Carl recently completed his organization's annual business  continuity plan refresh and is now turning his attention to the  disaster recovery plan. What output from the business  continuity plan can he use to prepare the business unit  prioritization task of disaster recovery planning? \nA. Vulnerability analysis \nB. Business impact analysis \nC. Risk management \nD. Continuity planning \n11. Nolan is considering the use of several different types of  alternate processing facility for his organization's data center. \nWhich one of the following alternative processing sites takes the  longest time to activate but has the lowest cost to implement? \nA. Hot site \nB. Mobile site \nC. Cold site \nD. Warm site \n12. Ingrid is concerned that one of her organization's data centers  has been experiencing a series of momentary power outages. \nWhich one of the following controls would best preserve their  operating status? \nA. Generator \nB. Dual-power supplies \nC. UPS \nD. Redundant network links \n13. Which one of the following items is a characteristic of hot sites  but not a characteristic of warm sites? \nA. Communications circuits \nB. Workstations \nC. Servers \nD. Current data \n14. Harry is conducting a disaster recovery test. He moved a group  of personnel to the alternate recovery site where they are  mimicking the operations of the primary site but do not have  operational responsibility. What type of disaster recovery test is  he performing? \nA. Read-through \nB. Walk-through \nC. Simulation test \nD. Parallel test \n15. What type of document will help public relations specialists and  other individuals who need a high-level summary of disaster  recovery efforts while they are underway? \nA. Executive summary \nB. Technical guides \nC. Department-specific plans \nD. Checklists \n16. What disaster recovery planning tool can be used to protect an  organization against the failure of a critical software firm to  provide appropriate support for their products? \nA. Differential backups \nB. Business impact assessment \nC. Incremental backups \nD. Software escrow agreement \n17. What type of backup involves always storing copies of all files  modified since the most recent full backup? \nA. Differential backups \nB. Partial backup \nC. Incremental backups \nD. Database backup \n18. You operate a grain processing business and are developing your  restoration priorities. Which one of the following systems would  likely be your highest priority? \nA. Order-processing system \nB. Fire suppression system \nC. Payroll system \nD. Website \n19. What combination of backup strategies provides the fastest  backup restoration time? \nA. Full backups and differential backups \nB. Partial backups and incremental backups \nC. Full backups and incremental backups \nD. Incremental backups and differential backups \n20. What type of disaster recovery plan test fully evaluates  operations at the backup facility but does not shift primary  operations responsibility from the main site? \nA. Walk-through \nB. Parallel test \nC. Full-interruption test \nD. Simulation test ",
  "elements": {
    "summaries": [
      "Disaster recovery planning is critical to a comprehensive information security program. DRPs serve as a valuable complement to business continuity plans and ensure that the proper technical controls are in place to keep the business functioning and to restore service after a disruption. In this chapter, you learned about the different types of natural and human-made disasters that may impact your business. You also explored the types of recovery sites and backup strategies that bolster your recovery capabilities. An organization's disaster recovery plan is one of the most important documents under the purview of security professionals. It should provide guidance to the personnel responsible for ensuring the continuity of operations in the face of disaster. The DRP provides an orderly sequence of events designed to activate alternate processing sites while simultaneously restoring the primary site to operational status. Once you've successfully developed your DRP, you must train personnel on its use, ensure that you maintain accurate documentation, and conduct periodic tests to keep the plan fresh in the minds of responders. Study Essentials Know the common types of natural disasters that may threaten an organization. Natural disasters that commonly threaten organizations include earthquakes, floods, storms, fires, pandemics, tsunamis, and volcanic eruptions. Know the common types of human-made disasters that may threaten an organization. Explosions, electrical fires, terrorist acts, power outages, other utility failures, infrastructure failures, hardware/software failures, labor difficulties, theft, and vandalism are all common human-made disasters. Be familiar with the common types of recovery facilities. The common types of recovery facilities are cold sites, warm sites, hot sites, mobile sites, cloud computing, and multiple sites. Be sure you understand the benefits and drawbacks of each such facility. Explain the potential benefits behind mutual assistance agreements as well as the reasons they are not commonly implemented in businesses today. Mutual assistance agreements (MAAs) provide an inexpensive alternative to disaster recovery sites, but they are not commonly used because they are difficult to enforce. Organizations participating in an MAA may also be shut down by the same disaster, and MAAs raise confidentiality concerns. Understand the technologies that may assist with database backup. Databases benefit from three backup technologies. Electronic vaulting is used to transfer database backups to a remote site as part of a bulk transfer. In remote journaling, data transfers occur on a more frequent basis. With remote mirroring technology, database transactions are mirrored at the backup site in real time. Explain the common processes used in disaster recovery programs. These programs should take a comprehensive approach to planning and include considerations related to the initial response effort, personnel involved, communication among the team members and with internal and external entities, assessment of response efforts, and restoration of services. DR programs should also include training and awareness efforts to ensure personnel understand their responsibilities and lessons learned sessions to continuously improve the program. Know the six types of disaster recovery plan tests and the impact each has on normal business operations. The six types of disaster recovery plan tests are read-throughs, tabletops, walk-throughs, simulation tests, parallel tests, and full-interruption tests. Read-throughs are purely paperwork exercises, whereas tabletops and walk-throughs involve project team meetings. They have no impact on business operations. Simulation tests may shut down noncritical business units. Parallel tests involve relocating personnel but do not affect day-to-day operations. Full-interruption tests involve shutting down primary systems and shifting responsibility to the recovery facility."
    ],
    "reviewQuestions": [],
    "writtenLabs": []
  }
}