{
  "id": "chapter_4",
  "content": "\nChapter 4 \nLaws, Regulations, and Compliance \nTHE CISSP TOPICS COVERED IN THIS CHAPTER \nINCLUDE: \nDomain 1.0: Security and Risk Management \n1.4 Understand legal, regulatory, and compliance issues  that pertain to information security in a holistic context \n1.4.1 Cybercrimes and data breaches \n1.4.2 Licensing and Intellectual Property  requirements \n1.4.3 Import/export controls \n1.4.4 Transborder data flow \n1.4.5 Issues related to privacy (e.g., General Data \nProtection Regulation (GDPR), California Consumer \nPrivacy Act, Personal Information Protection Law, \nProtection of Personal Information Act) \n1.4.6 Contractual, legal, industry standards, and  regulatory requirements \nThe world of compliance is a complex and dynamic landscape of  legal and regulatory matters for information technology and  cybersecurity professionals. National, state, and local governments  have all passed overlapping laws regulating different components of  cybersecurity in a patchwork manner. This leads to an incredibly  confusing landscape for security professionals, who must reconcile  the laws of multiple jurisdictions. Things become even more  complicated for multinational companies, which must navigate the  variations between international laws as well. \nLaw enforcement agencies have tackled the issue of cybercrime with  gusto in recent years. The legislative branches of governments  around the world have at least attempted to address issues of  cybercrime. Many law enforcement agencies have full-time, well-  trained computer crime investigators with advanced security  training. Agencies without full-time investigators should know where  to turn when they require this sort of experience. \nIn this chapter, we'll cover the various types of laws that deal with  computer security issues. We'll examine the legal issues surrounding  computer crime, privacy, intellectual property, and a number of  other related topics. We'll also cover basic investigative techniques,  including the pros and cons of calling in assistance from law  enforcement. \nCategories of Laws \nThree main categories of laws play a role in the U.S. legal system. \nEach is used to cover a variety of circumstances, and the penalties for  violating laws in the different categories vary widely. In the following  sections, you'll learn how criminal law, civil law, and administrative  law interact to form the complex web of our justice system. \nCriminal Law \nCriminal law forms the bedrock of the body of laws that preserve the  peace and keep our society safe. Many high-profile court cases  involve matters of criminal law; these are the laws that the police and  other law enforcement agencies concern themselves with. Criminal  law contains prohibitions against acts such as murder, assault,  robbery, and arson. Penalties for violating criminal statutes fall in a  range that includes mandatory hours of community service,  monetary penalties in the form of fines (small and large), and  deprivation of civil liberties in the form of prison sentences. \nDon't Underestimate Technology Crime Investigators \nA good friend of one of the authors is a technology crime  investigator for the local police department. He often receives  cases of computer abuse involving threatening emails and  website postings. \nRecently, he shared a story about a bomb threat that had been  emailed to a local high school. The perpetrator sent a threatening  note to the school principal declaring that the bomb would  explode at 1 p.m. and warning him to evacuate the school. The  author's friend received the alert at 11 a.m., leaving him with only  two hours to investigate the crime and advise the principal on the  best course of action. \nHe quickly began issuing emergency subpoenas to internet  service providers and traced the email to a computer in the school  library. At 12:15 p.m., he confronted the suspect with surveillance  tapes showing him at the computer in the library as well as audit  logs conclusively proving that he had sent the email. The student  quickly admitted that the threat was nothing more than a ploy to  get out of school a couple of hours early. His explanation? “I  didn't think there was anyone around here who could trace stuff  like that.” \nHe was wrong. \nA number of criminal laws serve to protect society against computer  crime. In later sections of this chapter, you'll learn how some laws,  such as the Computer Fraud and Abuse Act (CFAA), the Electronic \nCommunications Privacy Act (ECPA), and the Identity Theft and \nAssumption Deterrence Act (ITADA) (among others), provide  criminal penalties for serious cases of computer crime. Technically  savvy prosecutors teamed with concerned law enforcement agencies  have dealt serious blows to the “hacking underground” by using the  court system to slap lengthy prison terms on offenders guilty of what  used to be considered harmless pranks. \nIn the United States, legislative bodies at all levels of government  establish criminal laws through elected representatives. At the  federal level, both the House of Representatives and the Senate must  pass criminal law bills by a majority vote (in most cases), and then  the president must normally sign it in order for the bill to become  law. Once passed, these laws then become federal law and apply in  all cases where the federal government has jurisdiction (mainly cases  that involve interstate commerce, cases that cross state boundaries,  or cases that are offenses against the federal government itself). If  federal jurisdiction does not apply, state authorities handle the case  using laws passed in a similar manner by state legislators. \nAll federal and state laws must comply with the ultimate authority  that dictates how the U.S. system of government works—the U.S. \nConstitution. All laws are subject to judicial review by regional courts  with the right of appeal all the way to the Supreme Court of the \nUnited States. If a court finds that a law is unconstitutional, it has  the power to strike it down and render it invalid. \nKeep in mind that criminal law is a serious matter. If you find  yourself involved—as a witness, defendant, or victim—in a matter  where criminal authorities become involved, you'd be well advised to  seek advice from an attorney familiar with the criminal justice  system and specifically with matters of computer crime. It's not wise  to “go it alone” in such a complex system. \nCivil Law \nCivil laws form the bulk of the U.S. body of laws. They are designed  to provide for an orderly society and govern matters that are not  crimes but that require an impartial arbiter to settle between  individuals and organizations. Examples of the types of matters that  may be judged under civil law include contract disputes, real estate  transactions, employment matters, and estate/probate procedures. \nCivil laws also are used to create the framework of government that  the executive branch uses to carry out its responsibilities. These laws  provide budgets for governmental activities and lay out the authority  granted to the executive branch to create administrative laws (see the  next section). \nCivil laws are enacted in the same manner as criminal laws. They  must pass through the legislative process before enactment and are  subject to the same constitutional parameters and judicial review  procedures. At the federal level, both criminal and civil laws are  embodied in the United States Code (USC). \nThe major difference between civil laws and criminal laws is the way  in which they are enforced. Usually, law enforcement authorities do  not become involved in matters of civil law beyond taking action  necessary to restore order. In a criminal prosecution, the  government, through law enforcement investigators and prosecutors,  brings action against a person accused of a crime. In civil matters, it  is incumbent upon the person who thinks they have been wronged to  obtain legal counsel and file a civil lawsuit against the person they  think is responsible for their grievance. The government (unless it is  the plaintiff or defendant) does not take sides in the dispute or argue  one position or the other. The only role of the government in civil  matters is to provide the judges, juries, and court facilities used to  hear civil cases and to play an administrative role in managing the  judicial system in accordance with the law. \nAs with criminal law, it is best to obtain legal assistance if you think  you need to file a civil lawsuit or if someone files a civil lawsuit  against you. Although civil law does not impose the threat of  imprisonment, the losing party may face severe financial penalties. \nYou don't need to look any further than the daily news for examples \n—multimillion-dollar cases against tobacco companies, major  corporations, and wealthy individuals are filed every day. \nAdministrative Law \nThe executive branch of the U.S. government charges numerous  agencies with wide-ranging responsibilities to ensure that  government functions effectively. It is the duty of these agencies to  abide by and enforce the criminal and civil laws enacted by the  legislative branch. However, as can be easily imagined, criminal and  civil law can't possibly lay out rules and procedures that should be  followed in every possible situation. Therefore, executive branch  agencies have some leeway to enact administrative law, in the form  of executive orders, policies, procedures, and regulations that govern  the daily operations of the agency. Administrative law covers topics  as mundane as the procedures to be used within a federal agency to  obtain a desk telephone to more substantial issues such as the  immigration policies that will be used to enforce the laws passed by \nCongress. Administrative law is published in the Code of Federal \nRegulations (CFR). \nAlthough administrative law does not require an act of the legislative  branch to gain the force of law, it must comply with all existing civil  and criminal laws. Government agencies may not implement  regulations that directly contradict existing laws passed by the  legislature. Furthermore, administrative laws (and the actions of  government agencies) must also comply with the U.S. Constitution  and are subject to judicial review. \nTo understand compliance requirements and procedures, you must  be fully versed in the complexities of the law. From administrative  law to civil law to criminal law (and, in some countries, even  religious law), navigating the regulatory environment is a daunting  task. You should focus on the generalities of law, regulations,  investigations, and compliance as they affect organizational security  efforts. Specifically, you will need to: \nUnderstand legal and regulatory issues that pertain to  information security in a holistic concept. \nDetermine compliance and other requirements that apply to  your organization. \nHowever, it is your responsibility to seek out professional help (i.e.,  an attorney) to guide and support you in your efforts to maintain  legal and legally supportable security. \nLaws \nIn this section, we'll examine a number of laws that relate to  information technology. We'll examine several U.S. laws. We'll also  look briefly at several high-profile non-U.S. laws, such as the \nEuropean Union's General Data Protection Regulation (GDPR). \nRegardless, if you operate in an environment that involves foreign  jurisdictions, you should retain local legal counsel to guide you  through the system. \nEvery information security professional should have  a basic understanding of the law as it relates to information  technology. However, the most important lesson to be learned is  knowing when it's necessary to call in an attorney. If you think  you're in a legal “gray area,” it's best to seek professional advice. \nComputer Crime \nThe first computer security issues addressed by legislators were  those involving computer crime. Early computer crime prosecutions  were attempted under traditional criminal law, and many were  dismissed because judges thought that applying traditional law to  this modern type of crime was too far a stretch. Legislators  responded by passing specific statutes that defined computer crime  and laid out specific penalties for various crimes. In the following  sections, we'll cover several of those statutes. \nThe U.S. laws discussed in this chapter are federal laws. \nBut keep in mind that almost every state in the union has also  enacted some form of legislation regarding computer security  issues. Because of the global reach of the Internet, most computer  crimes cross state lines and, therefore, fall under federal  jurisdiction and are prosecuted in the federal court system. \nHowever, in some circumstances, state laws can be more  restrictive than federal laws and impose harsher penalties. \nComputer Fraud and Abuse Act \nThe Counterfeit Access Device and Computer Fraud and Abuse Act of \n1984 was the first major piece of cybercrime-specific legislation in  the United States. This act was then amended in 1986 to create the  modern Computer Fraud and Abuse Act (CFAA), which has since  been amended periodically. Congress had earlier enacted computer  crime law as part of the Comprehensive Crime Control Act (CCCA) of \n1984, but the CFAA was carefully written to exclusively cover  computer crimes that crossed state boundaries to avoid infringing on  states' rights and treading on thin constitutional ice. The major  provisions of the original CCCA made it a crime to perform the  following: \nAccess classified information or financial information in a  federal system without authorization or in excess of authorized  privileges. \nAccess a computer used exclusively by the federal government  without authorization. \nUse a federal computer to perpetrate a fraud (unless the only  object of the fraud was to gain use of the computer itself). \nCause malicious damage to a federal computer system in excess  of $1,000. \nModify medical records in a computer when doing so impairs or  may impair the examination, diagnosis, treatment, or medical  care of an individual. \nTraffic in computer passwords if the trafficking affects interstate  commerce or involves a federal computer system. \nWhen Congress passed the CFAA, it raised the threshold of damage  from $1,000 to $5,000 but also dramatically altered the scope of the  regulation. Instead of merely covering federal computers that  processed sensitive information, the act was changed to cover all \n“federal interest” computers. This widened the coverage of the act to  include the following: \nAny computer used exclusively by the U.S. government \nAny computer used exclusively by a financial institution \nAny computer used by the government or a financial institution  when the offense impedes the ability of the government or  institution to use that system \nAny combination of computers used to commit an offense when  they are not all located in the same state \nBe sure you're able to briefly describe the purpose of  each law discussed in this chapter. \nCFAA Amendments \nIn 1994, Congress recognized that the face of computer security had  drastically changed since the CFAA was last amended in 1986 and  made a number of sweeping changes to the act. Collectively, these  changes are referred to as the Computer Abuse Amendments Act of \n1994 and included the following provisions: \nOutlawed the creation of any type of malicious code that might  cause damage to a computer system \nModified the CFAA to cover any computer used in interstate  commerce rather than just “federal interest” computer systems \nAllowed for the imprisonment of offenders, regardless of  whether they actually intended to cause damage \nProvided legal authority for the victims of computer crime to  pursue civil action to gain injunctive relief and compensation for  damages \nSince the initial CFAA amendments in 1994, Congress passed  additional amendments in 1996, 2001, 2002, and 2008 as part of  other cybercrime legislation. We'll discuss those as they come up in  this chapter. \nAlthough the CFAA may be used to prosecute a variety of computer  crimes, it is also criticized by many in the security and privacy  community as an overbroad law. Under some interpretations, the \nCFAA criminalizes the violation of a website's terms of service. This  law was used to prosecute Aaron Swartz for downloading a large  number of academic research papers from a database accessible on  the MIT network. Swartz died by suicide in 2013 and inspired the  drafting of a CFAA amendment that would have excluded the  violation of website terms of service from the CFAA. That bill,  dubbed Aaron's Law, never reached a vote on the floor of Congress. \nOngoing legislative and judicial actions may affect the broad  interpretations of the CFAA in the United States. For example, in the \n2020 case Sandvig v. Barr , a federal court ruled that the CFAA did  not apply to the violations of the terms of use of a website because  that would effectively allow website operators to define the  boundaries of criminal activity. In 2021, the U.S. Supreme Court  ruled in the case, Van Buren v. United States , that someone violates \nCFAA if they first access a computer system that they are authorized  to access but then obtain information from files, folders, or databases  that they are not authorized to access. \nNational Information Infrastructure Protection Act of 1996 \nIn 1996, the U.S. Congress passed yet another set of amendments to  the Computer Fraud and Abuse Act designed to further extend the  protection it provides. The National Information Infrastructure \nProtection Act (NIIPA) included the following main new areas of  coverage: \nBroadens the CFAA to cover computer systems used in  international commerce in addition to systems used in interstate  commerce \nExtends similar protections to portions of the national  infrastructure other than computing systems, such as railroads,  gas pipelines, electric power grids, and telecommunications  circuits \nTreats any intentional or reckless act that causes damage to  critical portions of the national infrastructure as a felony \nFederal Information Security Management Act of 2002 \nThe Federal Information Security Management Act (FISMA), passed  in 2002, requires that federal agencies implement an information  security program that covers the agency's operations. FISMA also  requires that government agencies include the activities of  contractors in their security management programs. FISMA repealed  and replaced two earlier laws: the Computer Security Act of 1987 and  the Government Information Security Reform Act of 2000. \nThe National Institute of Standards and Technology (NIST),  responsible for developing the FISMA implementation guidelines,  outlines the following elements of an effective information security  program: \nPeriodic assessments of risk, including the magnitude of harm  that could result from the unauthorized access, use, disclosure,  disruption, modification, or destruction of information and  information systems that support the operations and assets of  the organization \nPolicies and procedures that are based on risk assessments,  cost-effectively reducing information security risks to an  acceptable level and ensuring that information security is  addressed throughout the life cycle of each organizational  information system \nSubordinate plans for providing adequate information security  for networks, facilities, information systems, or groups of  information systems, as appropriate \nSecurity awareness training to inform personnel (including  contractors and other users of information systems that support  the operations and assets of the organization) of the information  security risks associated with their activities and their  responsibilities in complying with organizational policies and  procedures designed to reduce these risks \nPeriodic testing and evaluation of the effectiveness of  information security policies, procedures, practices, and security  controls to be performed with a frequency depending on risk,  but no less than annually \nA process for planning, implementing, evaluating, and  documenting remedial actions to address any deficiencies in the  information security policies, procedures, and practices of the  organization \nProcedures for detecting, reporting, and responding to security  incidents \nPlans and procedures to ensure continuity of operations for  information systems that support the operations and assets of  the organization \nFISMA places a significant burden on federal agencies and  government contractors, who must develop and maintain substantial  documentation of their FISMA compliance activities. \nFederal Cybersecurity Laws of 2014 \nIn 2014, President Barack Obama signed a series of bills into law that  modernized the federal government's approach to cybersecurity  issues. \nThe first of these was the Federal Information Security \nModernization Act of 2014, which amended the 2002 version of \nFISMA. The 2014 FISMA modified the rules of the 2002 FISMA by  centralizing federal cybersecurity responsibility with the Department  of Homeland Security (DHS). There are two exceptions to this  centralization: defense-related cybersecurity issues remain the  responsibility of the secretary of defense, and the director of national  intelligence bears responsibility for intelligence-related issues. \nSecond, Congress passed the Cybersecurity Enhancement Act of \n2014, which charges NIST with responsibility for coordinating  nationwide work on voluntary cybersecurity standards. This act was  amended in 2022 to create an ongoing and voluntary public/private  partnership to improve cybersecurity, strengthen cybersecurity  research and development, develop the cybersecurity workforce, and  build public cybersecurity awareness. \nNIST produces the 800 series of Special Publications related to  computer security in the federal government. These are useful for all  security practitioners and are available for free online at  http://csrc.nist.gov/publications/sp800 . \nThe following are commonly used NIST standards: \nNIST SP 800-53: Security and Privacy Controls for \nInformation Systems and Organizations . This standard is  required for use in federal computing systems and is also  commonly used as an industry cybersecurity benchmark. \nNIST SP 800-171: Protecting Controlled Unclassified \nInformation in Nonfederal Systems and Organizations . \nCompliance with this standard's security controls (which are  quite similar to those found in NIST 800-53) is often included as  a contractual requirement by government agencies. Federal  contractors must often comply with NIST SP 800-171. \nThe NIST Cybersecurity Framework (CSF) is a set of standards  designed to serve as a voluntary risk-based framework for  securing information and systems. \nThe third law from this wave of new requirements was the National \nCybersecurity Protection Act of 2014. This law charged the \nDepartment of Homeland Security with establishing a national  cybersecurity and communications integration center. The role of  this center is to serve as the interface between federal agencies and  civilian organizations for sharing cybersecurity risks, incidents,  analysis, and warnings. \nIntellectual Property (IP) \nAmerica's role in the global economy is shifting away from a  manufacturer of goods and toward a provider of services. This trend  also shows itself in many of the world's large industrialized nations. \nWith this shift toward providing services, intellectual property (IP)  takes on an increasingly important role in many firms. Indeed, it is  arguable that the most valuable assets of many large multinational  companies are simply the brand names that we've all come to  recognize. Company names such as Dell, Procter & Gamble, and \nMerck bring instant credibility to any product. Publishing  companies, movie producers, and artists depend on their creative  output to earn their livelihood. Many products depend on secret  recipes or production techniques—take the legendary secret formula  for Coca-Cola or KFC's secret blend of herbs and spices, for example. \nThese intangible assets are collectively referred to as intellectual  property (IP), and a whole host of laws exist to protect the rights of  their owners. After all, it simply wouldn't be fair if a bookstore  bought only one copy of each author's book and made copies for all  of its customers—that would deprive the author of the benefits of  their labor. In the following sections, we'll explore the laws  surrounding the four major types of intellectual property—  copyrights, trademarks, patents, and trade secrets. We'll also discuss  how these concepts specifically concern information security  professionals. Many countries protect (or fail to protect) these rights  in different ways, but the basic concepts ring true throughout the  world. \nSome countries are notorious for violating IP rights  and are world renowned for their blatant disregard of copyright  and patent law. If you're planning to do business in countries  where this is a problem, you should definitely consult with an  attorney who specializes in this area. \nCopyright and the Digital Millennium Copyright Act \nCopyright law guarantees the creators of “original works of  authorship” protection against the unauthorized duplication of their  work. Eight broad categories of works qualify for copyright  protection: \nLiterary works \nMusical works \nDramatic works \nPantomimes and choreographic works \nPictorial, graphical, and sculptural works \nMotion pictures and other audiovisual works \nSound recordings \nArchitectural works \nThere is precedent for copyrighting computer software—it's done  under the scope of literary works. However, it's important to note  that copyright law protects only the expression inherent in computer  software—that is, the actual source code. It does not protect the ideas  or process behind the software. There has also been some question  over whether copyrights can be extended to cover the “look and feel”  of a software package's graphical user interface. Court decisions have  gone in both directions on this matter; if you will be involved in this  type of issue, you should consult a qualified intellectual property  attorney to determine the current state of legislation and case law. \nThere is a formal procedure to obtain a copyright that involves  sending copies of the protected work along with an appropriate  registration fee to the U.S. Copyright Office. For more information  on this process, visit the office's website at www.copyright.gov . \nHowever, officially registering a copyright is not a prerequisite for  copyright enforcement. Indeed, the law states that the creator of a  work has an automatic copyright from the instant the work is  created. If you can prove in court that you were the creator of a work \n(perhaps by publishing it), you will be protected under copyright law. \nOfficial registration merely provides the government's  acknowledgment that they received your work on a specific date. \nCopyright ownership always defaults to the creator of a work. The  exceptions to this policy are works for hire. A work is considered “for  hire” when it is made for an employer during the normal course of an  employee's workday. For example, when an employee in a company's  public relations department writes a press release, the press release  is considered a work for hire. A work may also be considered a work  for hire when it is made as part of a written contract declaring it as  such. \nCurrent copyright law provides for a lengthy period of protection. \nWorks by one or more authors are protected until 70 years after the  death of the last surviving author. Works for hire and anonymous  works are provided protection for 95 years from the date of first  publication or 120 years from the date of creation, whichever is  shorter. \nIn 1998, Congress recognized the rapidly changing digital landscape  that was stretching the reach of existing copyright law. To help meet  this challenge, it enacted the hotly debated Digital Millennium \nCopyright Act (DMCA). The DMCA also serves to bring U.S.  copyright law into compliance with terms of two World Intellectual \nProperty Organization (WIPO) treaties. \nThe first major provision of the DMCA is the prohibition of attempts  to circumvent copyright protection mechanisms placed on a  protected work by the copyright holder. This clause was designed to  protect copy-prevention mechanisms placed on digital media such as  compact discs (CDs) and digital video discs (DVDs). The DMCA  provides for penalties of up to $1 million and 10 years in prison for  repeat offenders. Nonprofit institutions such as libraries and schools  are exempted from this provision. \nThe DMCA also limits the liability of Internet service providers \n(ISPs) when their circuits are used by criminals violating the  copyright law. The DMCA recognizes that ISPs have a legal status  similar to the “common carrier” status of telephone companies and  does not hold them liable for the “transitory activities” of their users. \nTo qualify for this exemption, the service provider's activities must  meet the following requirements (quoted directly from the Digital \nMillennium Copyright Act of 1998, U.S. Copyright Office Summary, \nDecember 1998): \nThe transmission must be initiated by a person other than the  provider. \nThe transmission, routing, provision of connections, or copying  must be carried out by an automatic technical process without  selection of material by the service provider. \nThe service provider must not determine the recipients of the  material. \nAny intermediate copies must not ordinarily be accessible to  anyone other than anticipated recipients and must not be  retained for longer than reasonably necessary. \nThe material must be transmitted with no modification to its  content. \nThe DMCA also exempts activities of service providers related to  system caching, search engines, and the storage of information on a  network by individual users. However, in those cases, the service  provider must take prompt action to remove copyrighted materials  upon notification of the infringement. \nCongress also included provisions in the DMCA that allow the  creation of backup copies of computer software and any  maintenance, testing, or routine usage activities that require  software duplication. These provisions apply only if the software is  licensed for use on a particular computer, the usage is in compliance  with the license agreement, and any such copies are immediately  deleted when no longer required for a permitted activity. \nFinally, the DMCA spells out the application of copyright law  principles to the streaming of audio and/or video content over the \nInternet. The DMCA states that these uses are to be treated as \n“eligible nonsubscription transmissions.” \nTrademarks \nCopyright laws are used to protect creative works; there is also  protection for trademarks , which are words, slogans, and logos used  to identify a company and its products or services. For example, a  business might obtain a copyright on its sales brochure to ensure  that competitors can't duplicate its sales materials. That same  business might also seek to obtain trademark protection for its  company name and the names of specific products and services that  it offers to its clients. \nThe main objective of trademark protection is to avoid confusion in  the marketplace while protecting the intellectual property rights of  people and organizations. As with copyright protection, trademarks  do not need to be officially registered to gain protection under the  law. If you use a trademark in the course of your public activities, you  are automatically protected under any relevant trademark law and  can use the ™ symbol to show that you intend to protect words or  slogans as trademarks. If you want official recognition of your  trademark, you can register it with the United States Patent and \nTrademark Office (USPTO). This process generally requires an  attorney to perform a due diligence comprehensive search for  existing trademarks that might preclude your registration. The entire  registration process can take more than a year from start to finish. \nOnce you've received your registration certificate from the USPTO,  you can denote your mark as a registered trademark with the ®  symbol. \nOne major advantage of trademark registration is that you may  register a trademark that you intend to use but are not necessarily  already using. This type of application is called an intent to use  application and conveys trademark protection as of the date of filing  provided that you actually use the trademark in commerce within a  certain time period. If you opt not to register your trademark with  the PTO, your protection begins only when you first use the  trademark. \nThe acceptance of a trademark application in the United States  depends on these two main requirements: \nThe trademark must not be confusingly similar to another  trademark—you should determine this during your attorney's  due diligence search. There will be an open opposition period  during which other companies may dispute your trademark  application. \nThe trademark should not be descriptive of the goods and  services that you will offer. For example, “Mike's Software \nCompany” would not be a good trademark candidate because it  describes the product produced by the company. The USPTO  may reject an application if it considers the trademark  descriptive. \nIn the United States, trademarks are granted for an initial period of \n10 years and can be renewed for unlimited successive 10-year  periods. \nPatents \nUtility patents protect the intellectual property rights of inventors. \nThey provide a period of 20 years from the time of the invention \n(from the date of initial application) during which the inventor is  granted exclusive rights to use the invention (whether directly or via  licensing agreements). At the end of the patent exclusivity period, the  invention is in the public domain available for anyone to use. \nPatents have three main requirements: \nThe invention must be new. Inventions are patentable only if  they are original ideas. \nThe invention must be useful. It must actually work and  accomplish some sort of task. \nThe invention must not be obvious. You could not, for example,  obtain a patent for your idea to use a drinking cup to collect  rainwater. This is an obvious solution. You might, however, be  able to patent a specially designed cup that optimizes the  amount of rainwater collected while minimizing evaporation. \nProtecting Software \nThere is some ongoing controversy over how the intellectual  property contained in software should be protected. Software  seems to clearly qualify for copyright protection, but litigants  have disputed this notion in court. \nSimilarly, companies have applied for and received patents  covering the way that their software “inventions” function. \nCryptographic algorithms, such as RSA and Diffie–Hellman, both  enjoyed patent protection at one point. This, too, is a situation  that poses some legal controversy. \nIn the technology field, patents have long been used to protect  hardware devices and manufacturing processes. There is plenty of  precedent on the side of inventors in those areas. Recent patents  have also been issued covering software programs and similar  mechanisms, but these patents have become somewhat controversial  because many of them are viewed by the technical community as  overly broad. The issuance of these broad patents led to the evolution  of businesses that exist solely as patent holding companies that  derive their revenue by engaging in legal action against companies  that they feel infringe upon the patents held in their portfolio. These  companies are known by many in the technology community under  the derogatory name “patent trolls.” \nDesign and Plant Patents \nThe patents described in this section are utility patents, a type of  patent that protects the intellectual property around how an  invention functions. \nInventors may also take advantage of design patents. These  patents cover the appearance of an invention and last for only 15  years. They do not protect the idea of an invention, only the form  of the invention, so they are generally seen as a weaker form of  intellectual property protection than utility patents, but they are  also easier to obtain. \nA third type of patent, plant patents, cover new species of plants  that are created by people. Those aren't normally very relevant to  cybersecurity matters, unless you work in an agricultural  industry! \nTrade Secrets \nMany companies have intellectual property that is absolutely critical  to their business, and significant damage would result if it were  disclosed to competitors and/or the public—in other words, trade  secrets . We previously mentioned two examples of this type of  information from popular culture—the secret formula for Coca-Cola  and KFC's “secret blend of herbs and spices.” Other examples are  plentiful; a manufacturing company may want to keep secret a  certain manufacturing process that only a few key employees fully  understand, or a statistical analysis company might want to  safeguard an advanced model developed for in-house use. \nTwo of the previously discussed intellectual property tools—  copyrights and patents—could be used to protect this type of  information, but with these two major disadvantages: \nFiling a copyright or patent application requires that you  publicly disclose the details of your work or invention. This  automatically removes the “secret” nature of your property and  may harm your firm by removing the mystique surrounding a  product or by allowing unscrupulous competitors to copy your  property in violation of international intellectual property laws. \nCopyrights and patents both provide protection for a limited  period of time. Once your legal protection expires, other firms  are free to use your work at will (and they have all the details  from the public disclosure you made during the application  process!). \nThere actually is an official process regarding trade secrets. By their  nature you don't register them with anyone; you keep them to  yourself. To preserve trade secret status, you must implement  adequate controls within your organization to ensure that only  authorized personnel with a need to know the secrets have access to  them. You must also ensure that anyone who does have this type of  access is bound by a nondisclosure agreement (NDA) that prohibits  them from sharing the information with others and provides  penalties for violating the agreement. Consult an attorney to ensure  that the agreement lasts for the maximum period permitted by law. \nIn addition, you must take steps to demonstrate that you value and  protect your intellectual property. Failure to do so may result in the  loss of trade secret protection. \nTrade secret protection is one of the best ways to protect computer  software. As discussed in the previous section, patent law does not  provide adequate protection for computer software products. \nCopyright law protects only the actual text of the source code and  doesn't prohibit others from rewriting your code in a different form  and accomplishing the same objective. If you treat your source code  as a trade secret, it keeps it out of the hands of your competitors in  the first place. This is the technique used by large software  development companies such as Microsoft to protect their core base  of intellectual property. \nEconomic Espionage \nTrade secrets are often the crown jewels of major corporations,  and the U.S. government recognized the importance of protecting  this type of intellectual property when Congress enacted the \nEconomic Espionage Act of 1996. This law has these two major  provisions: \nAny individual found guilty of stealing trade secrets from a \nU.S. corporation with the intention of benefiting a foreign  government or agent may be fined up to $500,000 and  imprisoned for up to 15 years. Organizations found guilty  may be fined up to $10,000,000. \nAny individual found guilty of stealing trade secrets under  other circumstances may be fined and imprisoned for up to \n10 years. Organizations found guilty may be fined up to \n$5,000,000. \nThe terms of the Economic Espionage Act give true teeth to the  intellectual property rights of trade secret owners. Enforcing this  law requires that companies take adequate steps to ensure that  their trade secrets are well protected and not accidentally placed  into the public domain. \nThe law was extended by the Defend Trade Secrets Act of 2016. \nThe original Economic Espionage Act required that the  government bring criminal enforcement charges. The Defend \nTrade Secrets Act added a civil right of action, allowing  companies to file a civil suit in federal court claiming theft of  trade secrets. \nSoftware Licensing \nAs the software industry has evolved, so too have the complexities  surrounding software licensing. Today's security professionals must  navigate a landscape of diverse licensing options and agreements. \nHere are some contemporary software licensing types: \nPerpetual Licenses This type of license allows users to pay a  onetime fee for the software and use it indefinitely without any  time limitations. Typically, support and updates might require  additional fees. \nSubscription Licenses Unlike perpetual licenses,  subscription licenses are time-bound. Users pay a recurring fee  to use the software, often monthly or annually. This often  includes updates and support as part of the subscription. \nOpen-Source Licenses Open-source software is usually free  to use, modify, and distribute. However, there are various open  source licenses, each with its conditions, like the GNU General \nPublic License (GPL) or the MIT License. \nFreeware Software that is available free of charge. It might  come with restrictions on usage or lack features available in a  paid version. \nEnterprise License Agreements (ELAs) These are  comprehensive agreements between software vendors and large  organizations. ELAs allow for the deployment of software  throughout the organization under favorable terms, often at a  discounted price. \nEnd-User License Agreements (EULAs) EULAs define  the rights and restrictions that apply when using the software. \nThese are typically presented during the installation or initial  setup process. \nConcurrent Use Licenses This allows a set number of users  to access the software at the same time. Once the limit is  reached, additional users must wait until a slot becomes  available. \nNamed User Licenses This type of license is tied to specific  users, typically identified by their login credentials, ensuring  only designated individuals can access the software. \nCloud Services License Agreements These agreements  pertain to software-as-a-service (SaaS) provided over the \nInternet. Users often encounter them when registering for  online services. The agreement might present as a link to terms  or flash legal information on the screen, requiring user  affirmation before accessing the service. \nIndustry groups provide guidance and enforcement  activities regarding software licensing. You can get more  information from their websites. One major group is the Software \nAlliance at http://bsa.org . \nImport/Export \nThe federal government recognizes that the very same computers  and encryption technologies that drive the Internet and e-commerce  can be extremely powerful tools in the hands of a military force. For  this reason, during the Cold War, the government developed a  complex set of regulations governing the export of sensitive  hardware and software products to other nations. The regulations  include the management of transborder data flow of new  technologies, intellectual property, and personally identifiable  information (PII). \nUntil recently, it was difficult to export high-powered computers  outside the United States, except to a select handful of allied nations. \nThe controls on exporting encryption software were even more  severe, rendering it virtually impossible to export any encryption  technology outside the country. Recent changes in federal policy  have relaxed these restrictions and provided for more open  commerce. \nTwo sets of federal regulations governing imports and exports are of  particular interest to cybersecurity professionals: \nThe International Traffic in Arms Regulations (ITAR) controls  the manufacture, export, and import of items that are  specifically designated as military and defense items, including  technical information related to those items. The items covered  under ITAR appear on a list called the United States Munitions \nList (USML), maintained in 22 CFR 121. \nThe Export Administration Regulations (EAR) cover a broader  set of items that are designed for commercial use but may have  military applications. Items covered by EAR appear on the \nCommerce Control List (CCL) maintained by the U.S. \nDepartment of Commerce. Notably, EAR includes an entire  category covering information security products. \nCountries of Concern \nCurrently, U.S. firms can export high-performance computing  systems to virtually any country without receiving prior approval  from the government. There are exceptions to this rule for countries  designated by the Department of Commerce's Bureau of Industry  and Security (BIS) as countries of concern based on the fact that they  pose a threat of nuclear proliferation, they are classified as state  sponsors of terrorism, or other concerns. These countries include \nCuba, Iran, North Korea, and Syria. \nYou can find a list of countries and their  corresponding computer export tiers on the Department of \nCommerce's website at www.bis.doc.gov . \nEncryption Export Controls \nThe Department of Commerce's Bureau of Industry and Security \n(BIS) sets forth regulations on the export of encryption products  outside the United States. Under previous regulations, it was  virtually impossible to export even relatively low-grade encryption  technology outside the United States. This placed U.S. software  manufacturers at a great competitive disadvantage to foreign firms  that faced no similar regulations. After a lengthy lobbying campaign  by the software industry, the president directed the Commerce \nDepartment to revise its regulations to foster the growth of the \nAmerican security software industry. \nIf you're thinking to yourself, “These regulations are  confusing and overlapping,” you're not alone! Export controls are  a highly specialized area of the law that require expert legal  advice if you encounter them in your work. \nCurrent regulations now designate the categories of retail and mass  market security software. The rules now permit firms to submit these  products for review by the Commerce Department, but the review is  supposed to take no longer than 30 days. After successful completion  of this review, companies may freely export these products. \nHowever, government agencies often exceed legislated deadlines,  and companies must either wait until the review is complete or take  the matter to court in an attempt to force a decision. \nPrivacy \nThe right to privacy has for years been a hotly contested issue in the \nUnited States. The main source of this contention is that the \nConstitution's Bill of Rights does not explicitly provide for a right to  privacy. However, this right has been upheld by numerous courts  and is vigorously pursued by organizations such as the American \nCivil Liberties Union (ACLU). \nEuropeans have also long been concerned with their privacy. Indeed,  countries such as Switzerland are world renowned for their ability to  keep financial secrets. Later in this chapter, we'll examine how the \nEuropean Union (EU) data privacy laws impact companies and \nInternet users. \nU.S. Privacy Law \nAlthough there is no explicit constitutional guarantee of privacy, a  myriad of federal laws (many enacted in recent years) are designed  to protect the private information the government maintains about  citizens as well as key portions of the private sector such as financial,  educational, and healthcare institutions. In the following sections,  we'll examine a number of these federal laws. \nFourth Amendment The basis for privacy rights is in the \nFourth Amendment to the U.S. Constitution. It reads as follows: \nThe right of the people to be secure in their persons, houses,  papers, and effects, against unreasonable searches and  seizures, shall not be violated, and no Warrants shall issue,  but upon probable cause, supported by Oath or affirmation,  and particularly describing the place to be searched, and the  persons or things to be seized. \nThe direct interpretation of this amendment prohibits  government agents from searching private property without a  warrant and probable cause. The courts have expanded their  interpretation of the Fourth Amendment to include protections  against wiretapping and other invasions of privacy. \nPrivacy Act of 1974 The Privacy Act of 1974 is perhaps the  most significant piece of privacy legislation restricting the way  the federal government may deal with private information about  individual citizens. The Privacy Act mandates that U.S. federal  agencies maintain only the records that are necessary for  conducting their business and that they destroy those records  when they are no longer needed for a legitimate function of  government. It provides a formal procedure for individuals to  gain access to records the government maintains about them  and to request that incorrect records be amended. It also  severely limits the ability of federal government agencies to  disclose private information to other people or agencies without  the prior written consent of the affected individuals. It does  provide for exceptions involving the census, law enforcement,  the National Archives, health and safety, and court orders. \nThe Privacy Act of 1974 applies only to federal  government agencies. Many people misunderstand this law  and believe that it applies to how companies and other  organizations handle sensitive personal information, but that  is not the case. \nElectronic Communications Privacy Act of 1986 The \nElectronic Communications Privacy Act (ECPA) makes it a  crime to invade the electronic privacy of an individual. This act  broadened the Federal Wiretap Act, which previously covered  communications traveling via a physical wire, to apply to any  illegal interception of electronic communications or to the  intentional, unauthorized access of electronically stored data. It  prohibits the interception or disclosure of electronic  communication and defines those situations in which disclosure  is legal. It protects against the monitoring of email and  voicemail communications and prevents providers of those  services from making unauthorized disclosures of their content. \nOne of the most notable provisions of the ECPA is that it makes  it illegal to monitor mobile telephone conversations. In fact,  such monitoring is punishable by a fine of up to $500 and a  prison term of up to five years. \nCommunications Assistance for Law Enforcement Act \n(CALEA) of 1994 The Communications Assistance for Law \nEnforcement Act (CALEA) of 1994 amended the Electronic \nCommunications Privacy Act of 1986. CALEA requires all  communications carriers to make wiretaps possible for law  enforcement with an appropriate court order, regardless of the  technology in use. \nEconomic Espionage Act of 1996 The Economic \nEspionage Act of 1996 extends the definition of property to  include proprietary economic information so that the theft of  this information can be considered industrial or corporate  espionage. This changed the legal definition of theft so that it  was no longer restricted by physical constraints. \nHealth Insurance Portability and Accountability Act of \n1996 In 1996, Congress passed the Health Insurance \nPortability and Accountability Act (HIPAA), which made  numerous changes to the laws governing health insurance and  health maintenance organizations (HMOs). Among the  provisions of HIPAA are privacy and security regulations  requiring strict security measures for hospitals, physicians,  insurance companies, and other organizations that process or  store private medical information about individuals. \nHIPAA also clearly defines the rights of individuals who are the  subject of medical records and requires organizations that  maintain such records to disclose these rights in writing. \nThe HIPAA privacy and security regulations are  quite complex. You should be familiar with the broad  intentions of the act, as described here. If you work in the  healthcare industry, consider devoting time to an in-depth  study of this law's provisions. \nHealth Information Technology for Economic and \nClinical Health Act of 2009 In 2009, Congress amended \nHIPAA by passing the Health Information Technology for \nEconomic and Clinical Health (HITECH) Act. This law updated  many of HIPAA's privacy and security requirements and was  implemented through the HIPAA Omnibus Rule in 2013. \nOne of the changes mandated by the new regulations is a  change in the way the law treats business associates, which are  organizations that handle protected health information (PHI)  on behalf of a HIPAA-covered entity. Any relationship between  a covered entity and a business associate must be governed by a  written contract known as a business associate agreement \n(BAA). Under the new regulation, business associates are  directly subject to HIPAA and HIPAA enforcement actions in  the same manner as a covered entity. \nHITECH also introduced new data breach notification  requirements. Under the HITECH Breach Notification Rule, \nHIPAA-covered entities that experience a data breach must  notify affected individuals of the breach and must also notify  both the Secretary of Health and Human Services and the  media when the breach affects more than 500 individuals. In  those cases, notification must take place without unreasonable  delay and no more than 60 days after discovery of the breach. \nData Breach Notification Laws \nHITECH's data breach notification rule is unique in that it is  a federal law mandating the notification of affected  individuals. Outside of this requirement for healthcare  records, data breach notification requirements vary widely  from state to state. \nIn 2002, California passed the Senate Bill SB 1386 and  became the first state to immediately disclose to individuals  the known or suspected breach of personally identifiable  information. This includes unencrypted copies of a person's  name in conjunction with any of the following information: \nSocial Security number \nDriver's license number \nState identification card number \nAccount number, credit or debit card number, in  combination with any required security code, access code,  or password that would permit access to an individual's  financial account. \nIn the years following SB 1386, other states passed similar  laws modeled on the California data breach notification law. \nIn 2018, 16 years after the passage of SB 1386, Alabama and \nSouth Dakota became the last two states to pass data breach  notification laws. \nFor a complete listing of state data breach  notification laws, see  www.ncsl.org/research/telecommunications-and-  information-technology/security-breach-notification-  laws.aspx . \nChildren's Online Privacy Protection Act of 1998 In April \n2000, provisions of the federal Children's Online Privacy \nProtection Act (COPPA) became the law of the land in the \nUnited States. COPPA makes a series of demands on websites  that cater to children or knowingly collect information from  children: \nWebsites must have a privacy notice that clearly states the  types of information they collect and what it's used for,  including whether any information is disclosed to third  parties. The privacy notice must also include contact  information for the operators of the site. \nParents must be provided with the opportunity to review any  information collected from their children and permanently  delete it from the site's records. \nParents must give verifiable consent to the collection of  information about children younger than the age of 13 prior  to any such collection. Exceptions in the law allow websites  to collect minimal information solely for the purpose of  obtaining such parental consent. \nGramm–Leach–Bliley Act of 1999 Until the Gramm– \nLeach–Bliley Act (GLBA) became law in 1999, there were strict  governmental barriers between financial institutions. Banks,  insurance companies, and credit providers were severely limited  in the services they could provide and the information they  could share with each other. GLBA somewhat relaxed the  regulations concerning the services each organization could  provide. When Congress passed this law, it realized that this  increased latitude could have far-reaching privacy implications. \nBecause of this concern, it included a number of limitations on  the types of information that could be exchanged even among  subsidiaries of the same corporation and required financial  institutions to provide written privacy policies to all their  customers. \nUSA PATRIOT Act of 2001 Congress passed the Uniting and \nStrengthening America by Providing Appropriate Tools \nRequired to Intercept and Obstruct Terrorism (USA PATRIOT) \nAct of 2001 in direct response to the September 11, 2001,  terrorist attacks in New York City and Washington, DC. The \nPATRIOT Act greatly broadened the powers of law enforcement  organizations and intelligence agencies across a number of  areas, including when monitoring electronic communications. \nOne of the major changes prompted by the PATRIOT Act  revolves around the way government agencies obtain  wiretapping authorizations. Previously, police could obtain  warrants for only one circuit at a time, after proving that the  circuit was used by someone subject to monitoring. Provisions  of the PATRIOT Act allow authorities to obtain a blanket  authorization for a person and then monitor all  communications to or from that person under the single  warrant. \nAnother major change is in the way the government deals with \nInternet service providers (ISPs). Under the terms of the \nPATRIOT Act, ISPs may voluntarily provide the government  with a large range of information. The PATRIOT Act also allows  the government to obtain detailed information on user activity  through the use of a subpoena (as opposed to a wiretap). \nFinally, the USA PATRIOT Act amends the Computer Fraud  and Abuse Act (yes, another set of amendments!) to provide  more severe penalties for national security related criminal  acts. The PATRIOT Act provides for jail terms of up to 20 years  and once again expands the coverage of the CFAA. \nThe PATRIOT Act has a complex legislative history. Many of  the key provisions of the PATRIOT Act expired in 2015 when \nCongress failed to pass a renewal bill. However, Congress later  passed the Uniting and Strengthening America by Fulfilling \nRights and Ensuring Effective Discipline Over Monitoring (USA \nFREEDOM) Act in June 2015, which restored key provisions of  the PATRIOT Act. The provisions expired again in March 2020  and were once again renewed. \nClarifying Lawful Overseas Use of Data (CLOUD) Act \nThe Clarifying Lawful Overseas Use of Data (CLOUD) Act was  enacted in 2018, establishing procedures that govern access to  data held by technology companies across national borders. This  piece of legislation was introduced as a way to improve law  enforcement's ability to gather digital evidence stored on servers  regardless of where the servers are located, provided that the  company is based within the United States or subject to U.S.  jurisdiction. \nKey aspects of the CLOUD Act include: \nIt authorizes the U.S. government to enter into bilateral  agreements with other countries to provide reciprocal rights  to data relevant to criminal investigations and proceedings. \nU.S.-based technology companies can receive and must  comply with lawful orders for data disclosure issued by  foreign governments with which the U.S. has an executive  agreement, bypassing the need for U.S. government  intervention if certain conditions and human rights  standards are met. \nIt clarifies that U.S. law enforcement can compel U.S.-based  service providers via warrant or subpoena to disclose  electronic data in their possession, custody, or control, even  if the data is stored on servers located outside the United \nStates. \nThe act provides mechanisms for technology companies to  challenge or seek a modification to the data requests if they  believe the order violates the rights of the customer or the  laws of a foreign jurisdiction. \nFamily Educational Rights and Privacy Act The Family \nEducational Rights and Privacy Act (FERPA) is another  specialized privacy bill that affects any educational  institution that accepts any form of funding from the federal  government (the vast majority of schools). It grants certain  privacy rights to students 18 or older (or younger than 18 and  attending a postsecondary institution) and the parents of  minor students. Specific FERPA protections include the  following: \nParents/students have the right to inspect any educational  records maintained by the institution on the student. \nParents/students have the right to request correction of  records they think are erroneous and the right to include a  statement in the records contesting anything that is not  corrected. \nSchools may not release personal information from student  records without written consent, except under certain  circumstances. \nIdentity Theft and Assumption Deterrence Act In \n1998, the president signed the Identity Theft and \nAssumption Deterrence Act into law. In the past, the only  legal victims of identity theft were the creditors who were  defrauded. This law was extended by the Identity Theft \nPenalty Enhancement Act in 2004. Together, these laws  make identity theft a crime against the person whose identity  was stolen and provide severe criminal penalties (up to a 15-  year prison term and/or substantial fines) for anyone found  guilty of violating this law. \nPrivacy in the Workplace \nOne of the authors of this book had an interesting conversation  with a relative who works in an office environment. At a family  gathering, the author's relative casually mentioned a story he had  read online about a local company that had fired several  employees for abusing their Internet privileges. He was shocked  and couldn't believe that a company would violate their  employees' right to privacy. \nAs you've read in this chapter, the U.S. court system has long  upheld the traditional right to privacy as an extension of basic  constitutional rights. However, the courts have maintained that a  key element of this right is that privacy should be guaranteed  only when there is a “reasonable expectation of privacy.” For  example, if you mail a letter to someone in a sealed envelope, you  may reasonably expect that it will be delivered without being read  along the way—you have a reasonable expectation of privacy. On  the other hand, if you send your message on a postcard, you do so  with the awareness that one or more people might read your note  before it arrives at the other end—you do not have a reasonable  expectation of privacy. \nRecent court rulings have found that employees do not have a  reasonable expectation of privacy while using employer-owned  communications equipment in the workplace. If you send a  message using an employer's computer, Internet connection,  telephone, or other communications device, your employer can  monitor it as a routine business procedure. \nThat said, if you're planning to monitor the communications of  your employees, you should take reasonable precautions to  ensure that there is no implied expectation of privacy. Here are  some common measures to consider: \nClauses in employment contracts that state the employee has  no expectation of privacy while using corporate equipment \nSimilar written statements in corporate acceptable use and  privacy policies \nLogon banners warning that all communications are subject  to monitoring \nWarning labels on computers and telephones warning of  monitoring \nAs with many of the issues discussed in this chapter, it's a good  idea to consult with your legal counsel before undertaking any  communications-monitoring efforts. \nEuropean Union Privacy Law \nThe European Union (EU) has served as a leading force in the world  of information privacy, passing a series of regulations designed to  protect individual privacy rights. These laws function in a  comprehensive manner, applying to almost all individually  identifiable information, unlike U.S. privacy laws, which generally  apply to specific industries or categories of information. \nEuropean Union General Data Protection Regulation \nThe European Union passed a comprehensive law covering the  protection of personal information in 2016. The General Data \nProtection Regulation (GDPR) went into effect in 2018 and replaced  the earlier Data Protection Directive (DPD). The main purpose of  this law is to provide a single, harmonized law that covers data  throughout the European Union, bolstering the personal privacy  protections originally provided by the DPD. \nA major difference between the GDPR and the data protection  directive is the widened scope of the regulation. The new law applies  to all organizations that collect data from EU residents or process  that information on behalf of someone who collects it. Importantly,  the law even applies to organizations that are not based in the EU , if  they collect information about EU residents. The ability of the EU to  enforce this law globally remains an open question. \nThe key provisions of the GDPR include the following: \nLawfulness, fairness, and transparency says that you must have  a legal basis for processing personal information, you must not  process data in a manner that is misleading or detrimental to  data subjects, and you must be open and honest about data  processing activities. \nPurpose limitation says that you must clearly document and  disclose the purposes for which you collect data and limit your  activity to disclosed purposes. \nData minimization says that you must ensure that the data you  process is adequate for your stated purpose and limited to what  you actually need for that purpose. \nAccuracy says that the data you collect, create, or maintain is  correct and not misleading, that you maintain updated records,  and that you correct or erase inaccurate data. \nStorage limitation says that you keep data only for as long as it  is needed to fulfill a legitimate, disclosed purpose and that you  comply with the “right to be forgotten” that allows individuals to  require companies to delete their information if it is no longer  needed. \nIntegrity and confidentiality says that you must have  appropriate security, integrity and confidentiality controls in  place to protect data. \nAccountability says that you must take responsibility for actions  you take with protected data and that the data controller must  be able to demonstrate compliance. \nCross-Border Information Sharing \nGDPR is of particular concern when transferring information across  international borders. Organizations needing to conduct transfers  between their subsidiaries have two options available for complying  with EU regulations: \nOrganizations may adopt a set of standard contractual clauses \n(SCCs) that have been approved for use in situations where  information is being transferred outside of the EU. Those  clauses are found on the European Commission website and are  available for integration into contracts. \nOrganizations may adopt binding corporate rules (BCRs) that  regulate data transfers between internal units of the same firm. \nThis is a very time-consuming process—the rules must be  approved by every EU member nation where they will be used,  so typically this path is only adopted by very large organizations. \nIn the past, the European Union and the United States operated a  safe harbor agreement called Privacy Shield. Organizations were able  to certify their compliance with privacy practices through  independent assessors and, if awarded the privacy shield, were  permitted to transfer information. \nHowever, a 2020 ruling by the Court of Justice of the European \nUnion (CJEU) in a case called Schrems II declared the EU/US \nPrivacy Shield invalid. Currently, companies may not rely on the \nPrivacy Shield and must use either standard contractual clauses or  binding corporate rules. At the time this book went to press, efforts  were underway to implement a new safe harbor program designed to  meet EU requirements. \nIn some cases, conflicts arise between laws of different nations. For  example, electronic discovery rules in the United States might  require the production of evidence that is protected under GDPR. In  those cases, privacy professionals should consult with attorneys to  identify an appropriate course of action. \nThe Asia-Pacific Economic Cooperation (APEC)  publishes a privacy framework that incorporates many standard  privacy practices, such as preventing harm, notice, collection  limitation, use of personal information, choice, integrity of  personal information, security safeguards, access and correction,  and accountability. This framework is used to promote the  smooth cross-border flow of information between APEC member  nations. \nCanadian Privacy Law \nCanadian law affects the processing of personal information related  to Canadian residents. Chief among these, the Personal Information \nProtection and Electronic Documents Act (PIPEDA) is a national-  level law that restricts how commercial businesses may collect, use,  and disclose personal information. \nGenerally speaking, PIPEDA covers information about an individual  that is identifiable to that individual. The Canadian government  provides the following examples of information covered by PIPEDA: \nRace, national, or ethnic origin \nReligion \nAge \nMarital status \nMedical, education, or employment history \nFinancial information \nDNA \nIdentifying numbers \nEmployee performance records \nThe law excludes information that does not fit the definition of  personal information, including the following examples provided by  the Office of the Privacy Commissioner of Canada: \nInformation that is not about an individual, because the  connection with a person is too weak or far-removed \nInformation about an organization such as a business \nInformation that has been rendered anonymous, as long as it is  not possible to link that data back to an identifiable person \nCertain information about public servants such as their name,  position, and title \nA person's business contact information that an organization  collects, uses, or discloses for the sole purpose of  communicating with that person in relation to their  employment, business, or profession \nGovernment information \nAn individual's collection, use, or disclosure of personal  information strictly for personal purposes (e.g., personal  greeting card list) \nPIPEDA may also be superseded by province-specific laws that are  deemed substantially similar to PIPEDA. These laws currently exist  in Alberta, British Columbia, and Quebec. PIPEDA generally does  not apply to nonprofit organizations or political parties and  associations. Provincial laws apply to municipalities, universities,  schools, and hospitals. \nChinese Privacy Law \nIn recent years, China has significantly advanced its legal framework  related to data protection and privacy, culminating in the Personal \nInformation Protection Law (PIPL) , which came into effect in 2021. \nThe PIPL is China's first comprehensive national standard in data  privacy law, somewhat analogous to the GDPR in the EU, and it  imposes stringent regulations on personal data processing activities. \nKey aspects of the PIPL include: \nConsent and Legitimate Purpose The PIPL mandates that  data processing should be specific, clear, and legitimate. Explicit  consent is required for data processing, especially for sensitive  data, and individuals have the right to withdraw their consent. \nMinimum Necessary Data Collection Similar to the \nGDPR's data minimization principle, the PIPL requires that  organizations only collect personal data that is directly relevant  and necessary for the stated purpose. \nData Subject Rights The law empowers individuals with  several rights concerning their personal data, including the right  to access, correction, deletion, and to be informed of data  breaches. It also allows individuals to object to data processing. \nCross-Border Data Transfer The PIPL imposes  restrictions on transferring personal data outside of China. Data  exporters must conduct a security assessment and ensure that  the receiving country's data protection measures are effectively  equivalent to those in China, among other obligations. \nHeavy Penalties Noncompliance with the PIPL can result in  severe consequences, including financial penalties, suspension  of business activities, or revocation of business licenses. \nSouth African Privacy Law \nSouth Africa's primary legislation governing data protection is the \nProtection of Personal Information Act (POPIA) , which went into  effect in 2020. POPIA promotes the protection of personal  information processed by public and private bodies and introduces  specific conditions for the lawful processing of personal information,  closely mirroring principles seen in the GDPR. \nImportant provisions under POPIA include: \nLawful Processing POPIA sets out eight conditions for the  lawful processing of personal information, which includes  accountability, processing limitation, purpose specification,  further processing limitation, information quality, openness,  security safeguards, and data subject participation. \nConsent Personal information must be collected directly from  the data subject, with specific consent required for processing. \nConsent can be withdrawn, and data subjects also have the right  to object to the processing of personal information. \nSpecial Personal Information The act puts strict  conditions on the processing of special personal information,  such as religious or philosophical beliefs, race or ethnic origin,  trade union membership, political persuasion, health or sex life,  criminal behavior, or biometric information. \nProcessing of Personal Information of Children POPIA  recognizes the vulnerability of children in the digital age and  thus places heightened restrictions on the processing of their  personal information. Consent is required from a competent  person (e.g., a parent or guardian) where the data subject is a  child. Additionally, organizations must ensure that they apply  appropriate safeguards when processing children's data, making  sure that it is treated with utmost care and not used for  exploitative purposes. \nCross-Border Information Transfers POPIA restricts the  transfer of personal information outside South Africa unless the  recipient country has similar privacy protections or the data  subject consents to the transfer. \nEnforcement and Penalties The Information Regulator is  the enforcement authority under POPIA, with the power to  investigate and fine responsible parties for noncompliance. \nPenalties for violating POPIA can be severe, including both  monetary fines and imprisonment. \nState Privacy Laws \nIn addition to the federal and international laws affecting the privacy  and security of information, organizations must be aware of the laws  passed by states, provinces, and other jurisdictions where they do  business. As with the data breach notification laws discussed earlier  in this chapter, states often lead the way in creating privacy  regulations that spread across the country and may eventually serve  as the model for federal law. \nThe California Consumer Privacy Act (CCPA) is an excellent  example of this principle in action. California passed this sweeping  privacy law in 2018, modeling it after the European Union's GDPR. \nProvisions of the law went into effect in 2020, providing consumers  with the following: \nThe right to know what information businesses are collecting  about them and how the organization uses and shares that  information \nThe right to be forgotten, allowing consumers to request that the  organization delete their personal information, in some  circumstances \nThe right to opt out of the sale of their personal information \nThe right to exercise their privacy rights without fear of  discrimination or retaliation for their use \nCalifornia passed other privacy laws that extended \nCCPA, and other states have passed similar laws in recent years. \nCompliance \nOver the past decade, the regulatory environment governing  information security has grown increasingly complex. Organizations  may find themselves subject to a wide variety of laws (many of which  were outlined earlier in this chapter) and regulations imposed by  regulatory agencies or contractual obligations. \nPayment Card Industry Data Security Standard \nThe Payment Card Industry Data Security Standard (PCI DSS) is  an excellent example of a compliance requirement that is not  dictated by law but by contractual obligation. PCI DSS governs  the security of credit card and debit card information and is  enforced through the terms of a merchant agreement between a  business that accepts credit cards and/or debit cards and the  bank that processes the business's transactions. \nPCI DSS 4.0 has 12 main requirements: \nInstall and maintain network security controls. \nApply secure configurations to all system components. \nProtect stored account data. \nProtect cardholder data with strong cryptography during  transmission over open, public networks. \nProtect all systems and networks from malicious software. \nDevelop and maintain secure systems and software. \nRestrict access to system components and cardholder data by  business need to know. \nIdentify users and authenticate access to system  components. \nRestrict physical access to cardholder data. \nLog and monitor all access to systems and networks  regularly. \nTest security of systems and networks regularly. \nSupport information security with organizational policies  and programs. \nEach of these requirements is spelled out in detail in the full PCI \nDSS standard, which can be found at  http://pcisecuritystandards.org . Organizations subject to PCI \nDSS may be required to conduct annual compliance assessments,  depending on the number of transactions they process and their  history of cybersecurity breaches. \nDealing with the many overlapping, and sometimes contradictory,  compliance requirements facing an organization requires careful  planning. Many organizations employ full-time IT compliance staff  responsible for tracking the regulatory environment, monitoring  controls to ensure ongoing compliance, facilitating compliance  audits, and meeting the organization's compliance reporting  obligations. \nOrganizations that are not merchants but that store,  process, or transmit credit card information on behalf of  merchants must also comply with PCI DSS. For example, the  requirements apply to shared hosting providers who must protect  the cardholder data environment. \nOrganizations may be subject to compliance audits, either by their  standard internal and external auditors or by regulators or their  agents. For example, an organization's financial auditors may  conduct an IT controls audit designed to ensure that the information  security controls for an organization's financial systems are sufficient  to ensure compliance with the Sarbanes–Oxley Act (SOX). Some  regulations, such as PCI DSS, may require the organization to retain  approved independent auditors to verify controls and provide a  report directly to regulators. \nIn addition to formal audits, organizations often must report  regulatory compliance to a number of internal and external  stakeholders. For example, an organization's board of directors (or,  more commonly, that board's audit committee) may require periodic  reporting on compliance obligations and status. Similarly, PCI DSS  requires organizations that are not compelled to conduct a formal  third-party audit to complete and submit a self-assessment report  outlining their compliance status. \nContracting and Procurement \nThe increased use of cloud services and other external vendors to  store, process, and transmit sensitive information leads  organizations to a new focus on implementing security reviews and  controls in their contracting and procurement processes. Security  professionals should conduct reviews of the security controls put in  place by vendors, both during the initial vendor selection and  evaluation process and as part of ongoing vendor governance  reviews. \nThese are some questions to cover during these vendor governance  reviews: \nWhat types of sensitive information are stored, processed, or  transmitted by the vendor? \nWhat controls are in place to protect the organization's  information? \nHow is your organization's information segregated from that of  other clients? \nIf encryption is relied on as a security control, what encryption  algorithms and key lengths are used? How is key management  handled? \nWhat types of security audits does the vendor perform, and what  access does the client have to those audits? \nDoes the vendor rely on any other third parties to store, process,  or transmit data? How do the provisions of the contract related  to security extend to those third parties? \nWhere will data storage, processing, and transmission take  place? If outside the home country of the client and/or vendor,  what implications does that have? \nWhat is the vendor's incident response process, and when will  clients be notified of a potential security breach? \nWhat provisions are in place to ensure the ongoing integrity and  availability of client data? \nThis is just a brief listing of some of the concerns you may have. \nTailor the scope of your security review to the specific concerns of  your organization, the type of service provided by the vendor, and  the information that will be shared with them. \nSummary \nComputer security necessarily entails a high degree of involvement  from the legal community. In this chapter, you learned about the  laws that govern security issues such as computer crime, intellectual  property, data privacy, and software licensing. \nThree major categories of law impact information security  professionals. Criminal law outlines the rules and sanctions for  major violations of the public trust. Civil law provides us with a  framework for conducting business. Government agencies use  administrative law to promulgate the day-to-day regulations that  interpret existing law. \nThe laws governing information security activities are diverse and  cover all three categories. Some, such as the Electronic \nCommunications Privacy Act and the Digital Millennium Copyright \nAct, are criminal laws where violations may result in criminal fines  and/or prison time. Others, such as trademark and patent laws, are  civil laws that govern business transactions. Finally, many  government agencies promulgate administrative law, such as the \nHIPAA Security Rule, that affects specific industries and data types. \nInformation security professionals should be aware of the  compliance requirements specific to their industry and business  activities. Tracking these requirements is a complex task and should  be assigned to one or more compliance specialists who monitor  changes in the law, changes in the business environment, and the  intersection of those two realms. \nIt's also not sufficient to simply worry about your own security and  compliance. With increased adoption of cloud computing, many  organizations now share sensitive and personal data with vendors  that act as service providers. Security professionals must take steps  to ensure that vendors treat data with as much care as the  organization itself would and also meet any applicable compliance  requirements. \nStudy Essentials \nUnderstand the differences between criminal law, civil law,  and administrative law. Criminal law protects society against  acts that violate the basic principles we believe in. Violations of  criminal law are prosecuted by federal and state governments. Civil  law provides the framework for disputes between people or the  transaction of business between people and organizations. Violations  of civil law are brought to the court and argued by the two affected  parties. Administrative law is used by government agencies to  effectively carry out their day-to-day business. \nBe able to explain the basic provisions of the major laws  designed to protect society against computer crime. The \nComputer Fraud and Abuse Act (as amended) protects computers  used by the government or in interstate commerce from a variety of  abuses. The Electronic Communications Privacy Act (ECPA) makes it  a crime to invade the electronic privacy of an individual. \nKnow the differences among copyrights, trademarks,  patents, and trade secrets. Copyrights protect original works of  authorship, such as books, articles, poems, and songs. Trademarks  are names, slogans, and logos that identify a company, product, or  service. Patents provide protection to the creators of new inventions. \nTrade secret law protects the operating secrets of a firm. \nBe able to explain the basic provisions of the Digital \nMillennium Copyright Act of 1998. The Digital Millennium \nCopyright Act prohibits the circumvention of copy protection  mechanisms placed in digital media and limits the liability of \nInternet service providers for the activities of their users. \nKnow the basic provisions of the Economic Espionage Act  of 1996. The Economic Espionage Act provides penalties for  individuals found guilty of the theft of trade secrets. Harsher  penalties apply when the individual knows that the information will  benefit a foreign government. \nUnderstand the various types of software license  agreements. Perpetual licenses allow indefinite use after a  onetime fee, while subscription licenses are time-bound with  recurring fees. Open source licenses offer usage freedom with  conditions, and enterprise agreements provide licenses for large  organizations. EULAs define user rights and restrictions, concurrent  licenses set simultaneous user limits, and named user licenses tie to  specific users. Click-through agreements require active consent  during installation, and cloud service licenses pertain to online  services, with terms presented upon registration. \nUnderstand the notification requirements placed on  organizations that experience a data breach. California's SB \n1386 implemented the first statewide requirement to notify  individuals of a breach of their personal information. All other states  eventually followed suit with similar laws. Currently, federal law only  requires the notification of individuals when a HIPAA-covered entity  breaches their protected health information. \nUnderstand the major laws that govern privacy of personal  information in the United States, the European Union, \nCanada, China, and South Africa. The United States has a  number of privacy laws that affect the government's use of  information as well as the use of information by specific industries,  such as financial services companies and healthcare organizations  that handle sensitive information. The EU has a more comprehensive \nGeneral Data Protection Regulation that governs the use and  exchange of personal information. In Canada, the Personal \nInformation Protection and Electronic Documents Act (PIPEDA)  governs the use of personal information. China includes privacy  protections in the Personal Information Protection Law (PIPL),  while South Africa's are embedded in the Protection of Personal \nInformation Act (POPIA). \nExplain the importance of a well-rounded compliance  program. Most organizations are subject to a wide variety of legal  and regulatory requirements related to information security. \nBuilding a compliance program ensures that you become and remain  compliant with these often overlapping requirements. \nKnow how to incorporate security into the procurement  and vendor governance process. The expanded use of cloud  services by many organizations requires added attention to  conducting reviews of information security controls during the  vendor selection process and as part of ongoing vendor governance. \nBe able to determine compliance and other requirements  for information protection. Cybersecurity professionals must  be able to analyze a situation and determine what jurisdictions and  laws apply. They must be able to identify relevant contractual, legal,  regulatory, and industry standards and interpret them for their given  situation. \nKnow legal and regulatory issues and how they pertain to  information security. Understand the concepts of cybercrime  and data breaches and be able to apply them in your environment  when incidents arise. Understand what licensing and intellectual  property protections apply to your organization's data and your  obligations when encountering data belonging to other  organizations. Understand the privacy and export control issues  associated with transferring information across international  borders. \nWritten Lab \n1. What are the two primary mechanisms that an organization may  use to share information outside the European Union under the  terms of GDPR? \n2. What are some common questions that organizations should ask  when considering outsourcing information storage, processing,  or transmission? \n3. What are some common steps that employers can take to notify  employees of system monitoring? \nReview Questions \n1. Brianna is working with a U.S. software firm that uses  encryption in its products and plans to export their product  outside of the United States. What federal government agency  has the authority to regulate the export of encryption software? \nA. NSA \nB. NIST \nC. BIS \nD. FTC \n2. Wendy recently accepted a position as a senior cybersecurity  administrator at a U.S. government agency and is concerned  about the legal requirements affecting her new position. Which  law governs information security operations at federal agencies? \nA. FISMA \nB. FERPA \nC. CFAA \nD. ECPA \n3. What type of law does not require an act of Congress to  implement at the federal level but rather is enacted by the  executive branch in the form of regulations, policies, and  procedures? \nA. Criminal law \nB. Common law \nC. Civil law \nD. Administrative law \n4. What U.S. state was the first to pass a comprehensive privacy  law modeled after the requirements of the European Union's \nGeneral Data Protection Regulation? \nA. California \nB. New York \nC. Vermont \nD. Texas \n5. Congress passed CALEA in 1994, requiring that what type of  organizations cooperate with law enforcement investigations? \nA. Financial institutions \nB. Communications carriers \nC. Healthcare organizations \nD. Websites \n6. What law protects the right of citizens to privacy by placing  restrictions on the authority granted to government agencies to  search private residences and facilities? \nA. Privacy Act \nB. Fourth Amendment \nC. Second Amendment \nD. Gramm–Leach–Bliley Act \n7. Matthew recently authored an innovative algorithm for solving a  mathematical problem, and he wants to share it with the world. \nHowever, prior to publishing the software code in a technical  journal, he wants to obtain some sort of intellectual property \n(IP) protection. Which type of protection is best suited to his  needs? \nA. Copyright \nB. Trademark \nC. Patent \nD. Trade secret \n8. Mary is the cofounder of Acme Widgets, a manufacturing firm. \nTogether with her partner, Joe, she has developed a special oil  that will dramatically improve the widget manufacturing  process. To keep the formula secret, Mary and Joe plan to make  large quantities of the oil by themselves in the plant after the  other workers have left. They want to protect this formula for as  long as possible. What type of intellectual property (IP)  protection best suits their needs? \nA. Copyright \nB. Trademark \nC. Patent \nD. Trade secret \n9. Richard recently developed a great name for a new product that  he plans to begin using immediately. He spoke with his attorney  and filed the appropriate application to protect his product  name but has not yet received a response from the government  regarding his application. He wants to begin using the name  immediately. What symbol should he use next to the name to  indicate its protected status? \nA. © \nB. ® \nC. ™ \nD. † \n10. Tom is an adviser to a federal government agency that collects  personal information from constituents. He would like to  facilitate a research relationship between that firm that involves  the sharing of personal information with several universities. \nWhat law prevents government agencies from disclosing  personal information that an individual supplies to the  government under protected circumstances? \nA. Privacy Act \nB. Electronic Communications Privacy Act \nC. Health Insurance Portability and Accountability Act \nD. Gramm–Leach–Bliley Act \n11. Renee's organization is establishing a partnership with a firm  located in France that will involve the exchange of personal  information. Her partners in France want to ensure that the  transfer will be compliant with the GDPR. What mechanism  would be most appropriate? \nA. Binding corporate rules \nB. Privacy Shield \nC. Privacy Lock \nD. Standard contractual clauses \n12. The Children's Online Privacy Protection Act (COPPA) was  designed to protect the privacy of children using the Internet. \nWhat is the minimum age a child must be before companies can  collect personal identifying information from them without  parental consent? \nA. 13 \nB. 14 \nC. 15 \nD. 16 \n13. Kevin is assessing his organization's obligations under state data  breach notification laws. Which one of the following pieces of  information would generally not be covered by a data breach  notification law when it appears in conjunction with a person's  name? \nA. Social Security number \nB. Driver's license number \nC. Credit card number \nD. Student identification number \n14. Roger is the CISO at a healthcare organization covered under \nHIPAA. He would like to enter into a partnership with a vendor  who will manage some of the organization's data. As part of the  relationship, the vendor will have access to protected health  information (PHI). Under what circumstances is this  arrangement permissible under HIPAA? \nA. This is permissible if the service provider is certified by the \nDepartment of Health and Human Services. \nB. This is permissible if the service provider enters into a  business associate agreement. \nC. This is permissible if the service provider is within the same  state as Roger's organization. \nD. This is not permissible under any circumstances. \n15. Frances learned that a user in her organization recently signed  up for a cloud service without the knowledge of her supervisor  and is storing corporate information in that service. Which one  of the following statements is correct? \nA. If the user did not sign a written contract, the organization  has no obligation to the service provider. \nB. The user most likely agreed to a click-through license  agreement binding the organization. \nC. The user's actions likely violate federal law. \nD. The user's actions likely violate state law. \n16. Greg recently accepted a position as the cybersecurity  compliance officer with a privately held bank. What law most  directly impacts the manner in which his organization handles  personal information? \nA. HIPAA \nB. GLBA \nC. SOX \nD. FISMA \n17. Ruth recently obtained a utility patent covering a new invention  that she created. How long will she retain legal protection for  her invention? \nA. 14 years from the application date \nB. 14 years from the date the patent is granted \nC. 20 years from the application date \nD. 20 years from the date the patent is granted \n18. Ryan is reviewing the terms of a proposed vendor agreement  between the financial institution where he works and a cloud  service provider. Which one of the following items should  represent the least concern to Ryan? \nA. What security audits does the vendor perform? \nB. What provisions are in place to protect the confidentiality,  integrity, and availability of data? \nC. Is the vendor compliant with HIPAA? \nD. What encryption algorithms and key lengths are used? \n19. Justin is a cybersecurity consultant working with a retailer on  the design of their new point-of-sale (POS) system. What  compliance obligation relates to the processing of credit card  information that might take place through this system? \nA. SOX \nB. HIPAA \nC. PCI DSS \nD. FERPA \n20. Leonard and Sheldon recently coauthored a paper describing a  new superfluid vacuum theory. How long will the copyright on  their paper last? \nA. 70 years after publication \nB. 70 years after completion of the first draft \nC. 70 years after the death of the first author \nD. 70 years after the death of the last author ",
  "elements": {
    "summaries": [
      "Computer security necessarily entails a high degree of involvement from the legal community. In this chapter, you learned about the laws that govern security issues such as computer crime, intellectual property, data privacy, and software licensing. Three major categories of law impact information security professionals. Criminal law outlines the rules and sanctions for major violations of the public trust. Civil law provides us with a framework for conducting business. Government agencies use administrative law to promulgate the day-to-day regulations that interpret existing law. The laws governing information security activities are diverse and cover all three categories. Some, such as the Electronic Communications Privacy Act and the Digital Millennium Copyright Act, are criminal laws where violations may result in criminal fines and/or prison time. Others, such as trademark and patent laws, are civil laws that govern business transactions. Finally, many government agencies promulgate administrative law, such as the HIPAA Security Rule, that affects specific industries and data types. Information security professionals should be aware of the compliance requirements specific to their industry and business activities. Tracking these requirements is a complex task and should be assigned to one or more compliance specialists who monitor changes in the law, changes in the business environment, and the intersection of those two realms. It's also not sufficient to simply worry about your own security and compliance. With increased adoption of cloud computing, many organizations now share sensitive and personal data with vendors that act as service providers. Security professionals must take steps to ensure that vendors treat data with as much care as the organization itself would and also meet any applicable compliance requirements. Study Essentials Understand the differences between criminal law, civil law, and administrative law. Criminal law protects society against acts that violate the basic principles we believe in. Violations of criminal law are prosecuted by federal and state governments. Civil law provides the framework for disputes between people or the transaction of business between people and organizations. Violations of civil law are brought to the court and argued by the two affected parties. Administrative law is used by government agencies to effectively carry out their day-to-day business. Be able to explain the basic provisions of the major laws designed to protect society against computer crime. The Computer Fraud and Abuse Act (as amended) protects computers used by the government or in interstate commerce from a variety of abuses. The Electronic Communications Privacy Act (ECPA) makes it a crime to invade the electronic privacy of an individual. Know the differences among copyrights, trademarks, patents, and trade secrets. Copyrights protect original works of authorship, such as books, articles, poems, and songs. Trademarks are names, slogans, and logos that identify a company, product, or service. Patents provide protection to the creators of new inventions. Trade secret law protects the operating secrets of a firm. Be able to explain the basic provisions of the Digital Millennium Copyright Act of 1998. The Digital Millennium Copyright Act prohibits the circumvention of copy protection mechanisms placed in digital media and limits the liability of Internet service providers for the activities of their users. Know the basic provisions of the Economic Espionage Act of 1996. The Economic Espionage Act provides penalties for individuals found guilty of the theft of trade secrets. Harsher penalties apply when the individual knows that the information will benefit a foreign government. Understand the various types of software license agreements. Perpetual licenses allow indefinite use after a onetime fee, while subscription licenses are time-bound with recurring fees. Open source licenses offer usage freedom with conditions, and enterprise agreements provide licenses for large organizations. EULAs define user rights and restrictions, concurrent licenses set simultaneous user limits, and named user licenses tie to specific users. Click-through agreements require active consent during installation, and cloud service licenses pertain to online services, with terms presented upon registration. Understand the notification requirements placed on organizations that experience a data breach. California's SB 1386 implemented the first statewide requirement to notify individuals of a breach of their personal information. All other states eventually followed suit with similar laws. Currently, federal law only requires the notification of individuals when a HIPAA-covered entity breaches their protected health information. Understand the major laws that govern privacy of personal information in the United States, the European Union, Canada, China, and South Africa. The United States has a number of privacy laws that affect the government's use of information as well as the use of information by specific industries, such as financial services companies and healthcare organizations that handle sensitive information. The EU has a more comprehensive General Data Protection Regulation that governs the use and exchange of personal information. In Canada, the Personal Information Protection and Electronic Documents Act (PIPEDA) governs the use of personal information. China includes privacy protections in the Personal Information Protection Law (PIPL), while South Africa's are embedded in the Protection of Personal Information Act (POPIA). Explain the importance of a well-rounded compliance program. Most organizations are subject to a wide variety of legal and regulatory requirements related to information security. Building a compliance program ensures that you become and remain compliant with these often overlapping requirements. Know how to incorporate security into the procurement and vendor governance process. The expanded use of cloud services by many organizations requires added attention to conducting reviews of information security controls during the vendor selection process and as part of ongoing vendor governance. Be able to determine compliance and other requirements for information protection. Cybersecurity professionals must be able to analyze a situation and determine what jurisdictions and laws apply. They must be able to identify relevant contractual, legal, regulatory, and industry standards and interpret them for their given situation. Know legal and regulatory issues and how they pertain to information security. Understand the concepts of cybercrime and data breaches and be able to apply them in your environment when incidents arise. Understand what licensing and intellectual property protections apply to your organization's data and your obligations when encountering data belonging to other organizations. Understand the privacy and export control issues associated with transferring information across international borders."
    ],
    "reviewQuestions": [],
    "writtenLabs": []
  }
}