{
  "id": "chapter_3",
  "content": "\nChapter 3 \nBusiness Continuity Planning \nTHE CISSP TOPICS COVERED IN THIS CHAPTER \nINCLUDE: \nDomain 1.0: Security and Risk Management \n1.7 Identify, analyze, assess, prioritize, and implement \nBusiness Continuity (BC) requirements \n1.7.1 Business impact analysis (BIA) \n1.7.2 External dependencies \nDomain 7.0: Security Operations \n7.13 Participate in Business Continuity (BC) planning and  exercises \nDespite our best intentions, disasters of one form or another  eventually strike every organization. Whether it's a natural disaster  such as a hurricane, earthquake, or pandemic, or a person-made  calamity such as a building fire, burst water pipe, or economic crisis,  every organization will encounter events that threaten their  operations or even their very existence. \nResilient organizations have plans and procedures in place to help  mitigate the effects a disaster has on their continuing operations and  to speed the return to normal operations. Recognizing the  importance of planning for business continuity (BC) and disaster  recovery (DR), ISC2 has included these two processes in the  objectives for the CISSP program. Knowledge of these fundamental  topics will help you prepare for the exam and help you prepare your  organization for the unexpected. \nIn this chapter, we'll explore the concepts behind business continuity  planning (BCP). Chapter 18, “Disaster Recovery Planning,” will  continue the discussion and delve into the specifics of the technical  controls that organizations can put in place to restore operations as  quickly as possible after disaster strikes. \nPlanning for Business Continuity \nBusiness continuity planning (BCP) involves assessing the risks to  organizational processes and creating policies, plans, and procedures  to minimize the impact those risks might have on the organization if  they were to occur. BCP is used to maintain the continuous operation  of a business in the event of an emergency. The goal of BCP planners  is to implement a combination of policies, procedures, and processes  such that a potentially disruptive event has as little impact on the  business as possible. \nBCP focuses on maintaining business operations with reduced or  restricted infrastructure capabilities or resources. As long as the  continuity of the organization's ability to perform its mission-critical  work tasks is maintained, BCP can be used to manage and restore the  environment. \nBusiness Continuity Planning vs. Disaster Recovery \nPlanning \nCISSP candidates often become confused about the difference  between business continuity planning (BCP) and disaster  recovery planning (DRP). They might try to sequence them in a  particular order or draw firm lines between the two activities. The  reality of the situation is that these lines are blurry in real life and  don't lend themselves to neat and clean categorization. \nThe distinction between the two is one of perspective. Both  activities help prepare an organization for a disaster. They intend  to keep operations running continuously, when possible, and  recover functions as quickly as possible if a disruption occurs. \nThe perspective difference is that business continuity activities  are typically strategically focused at a high level and center  themselves on business processes and operations. Disaster  recovery plans tend to be more tactical and describe technical  activities such as recovery sites, backups, and fault tolerance. \nIn any event, don't get hung up on the difference between the  two. It's much more important that you understand the processes  and technologies involved in these two related disciplines. \nYou'll learn more about disaster recovery planning in Chapter 18. \nThe overall goal of BCP is to provide a quick, calm, and efficient  response in the event of an emergency and to enhance a company's  ability to recover from a disruptive event promptly. The BCP process  has four main elements: \nProject scope and planning \nBusiness impact analysis \nContinuity planning \nPlan approval and implementation \nThe next four sections of this chapter cover each of these phases in  detail. The last portion of this chapter will introduce some of the  critical elements you should consider when compiling  documentation of your organization's business continuity plan. \nThe top priority of BCP and DRP is always people . The  primary concern is to get people out of harm's way; then you can  address IT recovery and restoration issues. \nProject Scope and Planning \nAs with any formalized business process, the development of a  resilient business continuity plan requires the use of a proven  methodology. Organizations should approach the planning process  with several goals in mind: \nOrganizational review: Perform a structured review of the  business's organization from a crisis planning point of view. \nBCP team selection: Create a BCP team with the approval of  senior management. \nResource requirements: Assess the resources available to  participate in business continuity activities. \nExternal dependencies: Analyze the legal and regulatory  landscape that governs an organization's response to a  catastrophic event. \nThe exact process you use will depend on the size and nature of your  organization and its business. There isn't a “one-size-fits-all” guide to  business continuity project planning. You should consult with  project planning professionals in your organization and determine  the approach that will work best within your organizational culture. \nThe purpose of this phase is to ensure that the organization dedicates  sufficient time and attention to both developing the project scope  and plan and then documenting those activities for future reference. \nOrganizational Review \nOne of the first responsibilities of the individuals responsible for  business continuity planning is to perform an analysis of the  business organization to identify all departments and individuals  who have a stake in the BCP process. Here are some areas to  consider: \nOperational departments that are responsible for the core  services the business provides to its clients \nCritical support services, such as the IT department, facilities  and maintenance personnel, and other groups responsible for  the upkeep of systems that support the operational departments \nCorporate security teams responsible for physical security, since  they are many times the first responders to an incident and are  also responsible for the physical safeguarding of the primary  facility and alternate processing facility \nSenior executives and other key individuals essential for the  ongoing viability of the organization \nThis identification process is critical for two reasons. First, it  provides the groundwork necessary to help identify potential  members of the BCP team (see the next section). Second, it builds  the foundation for the remainder of the BCP process. \nTypically, the individuals spearheading the BCP effort perform the  business organization analysis. Some organizations employ a  dedicated business continuity manager to lead these efforts, whereas  others treat it as a part-time responsibility for another IT leader. \nEither approach is acceptable because the output of the analysis  commonly guides the selection of the remaining BCP team members. \nHowever, a thorough review of this analysis should be one of the first  tasks assigned to the full BCP team when it convenes. This step is  critical because the individuals performing the initial analysis may  have overlooked critical business functions known to BCP team  members that represent other parts of the organization. If the team  were to continue without revising the organizational analysis, the  entire BCP process might be negatively affected, resulting in the  development of a plan that does not fully address the emergency-  response needs of the organization as a whole. \nWhen developing a business continuity plan, be sure to  consider the location of both your headquarters and any branch  offices. The plan should account for a disaster that occurs at any  location where your organization conducts its business, including  your own physical locations and those of your cloud service  providers. \nBCP Team Selection \nIn some organizations, the IT and/or security departments bear sole  responsibility for business continuity planning, and no other  operational or support departments provide input. Those  departments may not even know of the plan's existence until a  disaster looms on the horizon or actually strikes the organization. \nThis is a critical flaw. The isolated development of a business  continuity plan can spell disaster in two ways. First, the plan itself  may not take into account knowledge possessed only by the  individuals responsible for the day-to-day operation of the business. \nSecond, it keeps operational elements “in the dark” about plan  specifics until implementation becomes necessary. These two factors  may lead to disengaged units disagreeing with provisions of the plan  and failing to implement it properly. They also deny organizations  the benefits achieved by a structured training and testing program  for the plan. \nTo prevent these situations from adversely impacting the BCP  process, the individuals responsible for the effort should take special  care when selecting the BCP team. The team should include, at a  minimum, the following individuals: \nRepresentatives from each of the organization's departments  responsible for the core services performed by the business \nBusiness unit team members from the functional areas  identified by the organizational analysis \nIT subject-matter experts with technical expertise in areas  covered by the BCP \nCybersecurity team members with knowledge of the BCP  process \nPhysical security and facility management teams responsible for  the physical plant \nAttorneys familiar with corporate legal, regulatory, and  contractual responsibilities \nHuman resources team members who can address staffing  issues and the impact on individual employees \nPublic relations team members who need to conduct similar  planning for how they will communicate with stakeholders and  the public in the event of a disruption \nSenior management representatives with the ability to set the  vision, define priorities, and allocate resources \nTips for Selecting an Effective BCP Team \nSelect your team carefully. You need to strike a balance between  representing different points of view and creating a team with  explosive personality differences. Your goal should be to create a  group that is as diverse as possible and still operates in harmony. \nTake some time to think about the BCP team membership and  who would be appropriate for your organization's technical,  financial, and political environment. Who would you include? \nEach team member brings a unique perspective to the BCP process  and will have individual biases. For example, representatives from  operational departments will often consider their department the  most critical to the organization's continued viability. Although these  biases may at first seem divisive, the leader of the BCP effort should  embrace them and harness them productively. If used effectively, the  biases will help achieve a healthy balance in the final plan as each  representative advocates the needs of their department. On the other  hand, without effective leadership, these biases may devolve into  destructive turf battles that derail the BCP effort and harm the  organization as a whole. \nSenior Management and BCP \nThe role of senior management in the BCP process varies widely  from organization to organization. It depends on the culture of  the business, management interest in the plan, and the regulatory  environment. Critical roles played by senior management usually  include setting priorities, providing staff and financial resources,  and arbitrating disputes about the criticality (i.e., relative  importance) of services. \nOne of the authors recently completed a BCP consulting  engagement with a large nonprofit institution. At the beginning  of the engagement, he had a chance to sit down with one of the  organization's senior executives to discuss his goals and  objectives for their work together. During that meeting, the  senior executive asked the consultant, “Is there anything you  need from me to complete this engagement?” \nThe senior executive must have expected a perfunctory response  because his eyes widened when the consultant said, “Well, as a  matter of fact…” The executive then learned that his active  participation in the process was critical to its success. \nWhen working on a business continuity plan, the BCP team  leader must seek and obtain as active a role as possible from a  senior executive. Visible senior-level support conveys the  importance of the BCP process to the entire organization. It also  fosters the active participation of individuals who might write \nBCP off as a waste of time that they might otherwise spend on  operational activities. Furthermore, laws and regulations might  require the active participation of those senior leaders in the  planning process. If you work for a publicly traded company, you  may want to remind executives that courts may find the officers  and directors of the firm personally liable if a disaster cripples the  business after they failed to exercise due diligence in their  contingency planning. \nYou may also have to convince management that BCP and DRP  spending are not discretionary expenses. Management's fiduciary  responsibilities to the organization's shareholders require them  to at least ensure that adequate BCP measures are in place. \nIn the case of this BCP engagement, the executive acknowledged  the importance of his support and agreed to participate. He sent  an email to all employees introducing the effort and stating that it  had his full backing. He also attended several of the high-level  planning sessions and mentioned the effort in an organization-  wide “town hall” meeting. \nResource Requirements \nAfter the team validates the organizational review, it should turn to  an assessment of the resources required by the BCP effort. This  assessment involves the resources needed by three distinct BCP  phases: \nBCP Development The BCP team will require some  resources to perform the four elements of the BCP process \n(project scope and planning, business impact analysis,  continuity planning, and plan approval and implementation). \nIt's more than likely that the major resource consumed by this \nBCP phase will be effort and time expended by members of the \nBCP team and the support staff they call on to assist in the  development of the plan. \nBCP Testing, Training, and Maintenance The testing,  training, and maintenance components of this phase of the BCP  will require some hardware and software commitments. Still,  once again, the major commitment in this phase will be the  effort of the employees involved in those activities. \nBCP Implementation When a disaster strikes and the BCP  team deems it necessary to conduct a full-scale implementation  of the business continuity plan, the implementation will require  significant resources. Those resources include a large amount of  effort (BCP will likely become the focus of a large part, if not all,  of the organization) as well as direct financial expenses. For this  reason, the team must use its BCP implementation powers  judiciously yet decisively. \nAn effective business continuity plan requires the expenditure of  significant resources, ranging from the purchase and deployment of  redundant computing facilities to the pencils and paper used by team  members scratching out the first drafts of the plan. However, as you  saw earlier, personnel are one of the most significant resources  consumed by the BCP process. Many security professionals overlook  the importance of accounting for labor, but you can rest assured that  senior management will not. Business leaders are keenly aware of the  effect that time-consuming side activities have on the operational  productivity of their organizations and the real cost of personnel in  terms of salary, benefits, and lost opportunities. These concerns  become especially paramount when you are requesting the time of  senior executives. \nYou should expect that leaders responsible for resource utilization  management will put your BCP proposal under a microscope, and  you should prepare to defend the necessity of your plan with  coherent, logical arguments that address the business case for BCP. \nExplaining the Benefits of BCP \nAt a recent conference, one of the authors discussed business  continuity planning with the chief information security officer \n(CISO) of a health system from a medium-sized U.S. city. The \nCISO's attitude was shocking. His organization had not  conducted a formal BCP process, and he was confident that an  informal approach would work fine in the unlikely event of a  disaster. \nThis attitude is one of the most common arguments against  committing resources to BCP. In many organizations, the attitude  that the business has always survived, and the key leaders will  figure something out in the event of a disaster, pervades  corporate thinking. If you encounter this objection, you might  want to point out to management the costs that will be incurred  by the business (both direct costs and the indirect cost of lost  opportunities) for each day that the business is down. Then, ask  them to consider how long a disorganized recovery might take  when compared to an orderly, planned continuity of operations \n(COOP). \nConducting a formal BCP effort is particularly important in  healthcare organizations, where the unavailability of systems  could have life-or-death consequences. In October 2020, the U.S. \nCybersecurity and Infrastructure Security Agency (CISA) issued  an alert notifying healthcare organizations of an outbreak of  ransomware activity specifically targeting their work. Strong  continuity plans play an essential role in defending against these  availability attacks. \nExternal Dependencies \nWhen crafting a robust BCP, you need to understand and mitigate  the risks associated with external dependencies. These dependencies  range from technology vendors supplying critical hardware,  software, and cloud services, to legal and regulatory frameworks that  shape your operational landscape. Each external factor carries  potential risks that could, if unaddressed, disrupt your business  operations. Consequently, a comprehensive BCP doesn't just look  inward at the organization's processes, but also outward, ensuring  that external parties' roles and responsibilities are clearly understood  and that contingency plans are in place to tackle any disruptions in  these areas. \nVendors \nAs you develop your BCP, it's crucial to consider the role of all  technology vendors, not just those offering cloud services. These  vendors, encompassing cloud service providers, hardware suppliers,  and software developers, are integral to your organization's  operational resilience. Their own business continuity arrangements  can significantly impact your organization's ability to maintain  business operations during disruptive incidents. \nConsider, for example, a firm that outsources email and calendaring  to a third-party software-as-a-service (SaaS) provider. Does the  contract with that provider include details about the provider's  service-level agreement (SLA) and commitments for restoring  operations in the event of a disaster? \nAlso, remember that a contract is not normally sufficient due  diligence when choosing a vendor. You should also verify that the  vendor has the controls in place to deliver on their contractual  commitments. Although it may not be possible for you to physically  visit the vendor's facilities to verify their control implementation, you  can always do the next best thing—send someone else! \nNow, before you go off identifying an emissary and booking flights,  realize that many of your vendor's customers are probably asking the  same question. For this reason, the vendor may have already hired  an independent auditing firm to conduct an assessment of its  controls. They can make the results of this assessment available to  you in the form of a System and Organization Controls (SOC) report. \nWe cover SOC reports in more detail in Chapter 15, “Security \nAssessment and Testing.” \nKeep in mind that there are three different versions of the SOC  report. The simplest of these, a SOC 1 report, covers only internal  controls over financial reporting. If you want to verify the security,  processing integrity, confidentiality, privacy, or availability controls,  you'll want to review either a SOC 2 or a SOC 3 report. The American \nInstitute of Certified Public Accountants (AICPA) sets and maintains  the standards surrounding these reports to maintain consistency  between auditors from different accounting firms. \nFor more information on this topic, see the AICPA's document  comparing the SOC report types at www.aicpa-  cima.com/resources/landing/system-and-organization-controls-  soc-suite-of-services . \nLegal and Regulatory Requirements \nMany industries may find themselves bound by sector-specific,  federal, state, and local laws or regulations that require them to  implement various degrees of BCP. We've already discussed one  example in this chapter—the officers and directors of publicly traded  firms have a fiduciary responsibility to exercise due diligence in the  execution of their business continuity duties. In other circumstances,  the requirements (and consequences of failure) might be even more  severe. Emergency services, such as police, fire, and emergency  medical operations, have a responsibility to the community to  continue operations in the event of a disaster. Indeed, their services  become even more critical in an emergency that threatens public  safety. Failure to implement an effective BCP could result in the loss  of life or property and decreased public confidence in the  government. \nIn many countries, financial institutions, such as banks, brokerages,  and the firms that process their data, are subject to strict government  and international banking and securities regulations. These  regulations are necessarily strict because their purpose is to ensure  the continued operation of the institution as a crucial part of the  economy. When pharmaceutical manufacturers must produce  products in less-than-optimal circumstances following a disaster or  in response to a rapidly emerging pandemic, they are required to  certify the purity of their products to government regulators. There  are countless other examples of industries that are necessary to  continue operating in the event of an emergency by various laws and  regulations. \nEven if you're not bound by any of these considerations, you might  have contractual obligations to your clients that require you to  implement sound BCP practices. If your contracts include  commitments to customers expressed as service-level agreements \n(SLAs), you might find yourself in breach of those contracts if a  disaster interrupts your ability to service your clients. Many clients  may feel sorry for you and want to continue using your  products/services, but their own business requirements might force  them to sever the relationship and find new suppliers. \nOn the flip side of the coin, developing a strong, documented  business continuity plan can help your organization win new clients  and additional business from existing clients. If you can show your  customers the sound procedures you have in place to continue  serving them in the event of a disaster, they'll place greater  confidence in your firm and might be more likely to choose you as  their preferred vendor. That's not a bad position to be in! \nAll of these concerns point to one conclusion—it's essential to include  your organization's legal counsel in the BCP process. They are  intimately familiar with the legal, regulatory, and contractual  obligations that apply to your organization. They can help your team  implement a plan that meets those requirements while ensuring the  continued viability of the organization to the benefit of all—  employees, shareholders, suppliers, and customers alike. \nLaws regarding computing systems, business  practices, and disaster management change frequently. They also  vary from jurisdiction to jurisdiction. Be sure to keep your  attorneys involved throughout the lifetime of your BCP, including  the testing and maintenance phases. If you restrict their  involvement to a pre-implementation review of the plan, you may  not become aware of the impacts that changing laws and  regulations have on your corporate responsibilities. \nBusiness Impact Analysis \nOnce your BCP team completes the four stages of preparing to create  a business continuity plan (organizational review, BCP team  selection, resource requirements, external dependencies), it's time to  dive into the heart of the work—the business impact analysis (BIA). \nWe approach the BIA in several stages: \n1. Identifying priorities \n2. Risk identification \n3. Likelihood assessment \n4. Impact analysis \n5. Resource prioritization \nThe BIA identifies the business processes and tasks that are critical  to an organization's ongoing viability and the threats posed to those  resources. It also assesses the likelihood that each threat will occur  and the impact those occurrences will have on the business. The  results of the BIA provide you with quantitative and qualitative  measures that can help you prioritize the commitment of business  continuity resources to the various local, regional, and global risk  exposures facing your organization. \nIt's important to realize that there are two different types of analyses  that business planners use when facing a decision: \nQuantitative Impact Assessment Involves the use of  numbers and formulas to reach a decision. This type of data  often expresses options in terms of the dollar value to the  business. \nQualitative Impact Assessment Takes non-numerical  factors, such as reputation, investor/customer confidence,  workforce stability, and other concerns, into account. This type  of data often results in categories of prioritization (such as high,  medium, and low). \nQuantitative assessment and qualitative assessment  both play an essential role in the BCP process. However, most  people tend to favor one type of analysis over the other. When  selecting the individual members of the BCP team, try to achieve  a balance between people who prefer each strategy. This  approach helps develop a well-rounded BCP and will benefit the  organization in the long run. \nThe BIA process described in this chapter approaches the problem  from both quantitative and qualitative points of view. However, it's  tempting for a BCP team to “go with the numbers” and perform a  quantitative assessment while neglecting the somewhat more  subjective qualitative assessment. The BCP team should perform a  qualitative analysis of the factors affecting your BCP process. For  example, if your business is highly dependent on a few important  clients, your management team is probably willing to suffer a  significant short-term financial loss to retain those clients in the long  term. The BCP team must sit down and discuss (preferably with the  involvement of senior management) qualitative concerns to develop  a comprehensive approach that satisfies all stakeholders. \nAs you work your way through the BIA process, you  will find that it is quite similar to the risk assessment process  covered in Chapter 2, “Personnel Security and Risk Management \nConcepts.” The techniques used are very similar because both use  standard risk evaluation techniques. The major difference is that  the risk assessment process is focused on individual assets,  whereas the BCP focuses on business processes and tasks. \nIdentifying Priorities \nThe first BIA task facing the BCP team is identifying business  priorities. Depending on your line of business, certain activities are  essential to your day-to-day operations when disaster strikes. You  should create a comprehensive list of critical business functions and  rank them in order of importance. Although this task may seem  somewhat daunting, it's not as hard as it sounds. \nThese critical business functions will vary from organization to  organization, based on each organization's mission. They are the  activities that, if disrupted, would jeopardize the organization's  ability to achieve its goals. For example, an online retailer would  treat the ability to sell products from their website and fulfill those  orders promptly as critical business functions. \nA great way to divide the workload of this process among the team  members is to assign each participant responsibility for drawing up a  prioritized list that covers the business functions for which their  department is responsible. When the entire BCP team convenes,  team members can use those prioritized lists to create a master  prioritized list for the organization as a whole. One caution with this  approach—if your team is not truly representative of the  organization, you may miss critical priorities. Be sure to gather input  from all parts of the organization, especially from any areas not  represented on the BCP team. \nThis process helps identify business priorities from a qualitative  point of view. Recall that we're describing an attempt to develop both  qualitative and quantitative BIAs simultaneously. To begin the  quantitative assessment, the BCP team should sit down and draw up  a list of organization assets and then assign an asset value (AV) in  monetary terms to each asset. These values form the basis of risk  calculations performed later in the BIA. \nThe second quantitative measure that the team must develop is the  maximum tolerable downtime (MTD) , sometimes also known as  maximum tolerable outage (MTO) . The MTD is the maximum  length of time a business function can tolerate a disruption before  suffering irreparable harm. The MTD provides valuable information  when you're performing both BCP and disaster recovery planning \n(DRP) planning efforts. The organization's list of critical business  functions plays a crucial role in this process. The MTD for critical  business functions should be lower than the MTD for activities not  identified as critical. Returning to the example of an online retailer,  the MTD for the website selling products may be only a few minutes,  whereas the MTD for their internal email system might be measured  in hours. \nThe recovery time objective (RTO) for each business function is the  amount of time in which you think you can feasibly recover the  function in the event of a disruption. This value is closely related to  the MTD. Once you have defined your recovery objectives, you can  design and plan the procedures necessary to accomplish the recovery  tasks. \nAs you conduct your BCP work, ensure that your RTOs are less than  your MTDs, resulting in a situation in which a function should never  be unavailable beyond the maximum tolerable downtime. \nWhile the RTO and MTD measure the time to recover operations and  the impact of that recovery time on operations, organizations must  also pay attention to the potential data loss that might occur during  an availability incident. Depending on the way that information is  collected, stored, and processed, some data loss may take place. \nThe recovery point objective (RPO) is the data loss equivalent to the  time-focused RTO. The RPO defines the point in time before the  incident where the organization should be able to recover data from  a critical business process. For example, an organization might  perform database transaction log backups every 15 minutes. In that  case, the RPO would be 15 minutes, meaning that the organization  may lose up to 15 minutes' worth of data after an incident. If an  incident takes place at 8:30 a.m., the last transaction log backup  must have occurred sometime between 8:15 a.m. and 8:30 a.m. \nDepending on the precise timing of the incident and the backup, the  organization may have irretrievably lost between 0 and 15 minutes of  data. \nRisk Identification \nThe next phase of the BIA is the identification of risks posed to your  organization. Recall from Chapter 1, “Security Governance Through \nPrinciples and Policies,” that a risk occurs when an asset has a  vulnerability and a threat exists that might exploit that vulnerability. \nDuring this phase, you'll have an easy time identifying some common  threats, but you might need to exercise some creativity to come up  with more obscure (but very real) threats to assets. \nHazards come in two forms: natural and person-made. \nThe following list includes some events that pose natural threats: \nViolent storms/hurricanes/tornadoes/blizzards \nLightning strikes \nNatural wildfire \nEarthquakes \nMudslides/avalanches \nVolcanic eruptions \nPandemics \nPerson-made threats may include the following events: \nTerrorist acts/wars/civil unrest \nWorkplace violence \nTheft/vandalism \nFires/arson/explosions \nProlonged power outages \nBuilding collapses \nTransportation failures \nInternet disruptions \nService provider outages \nEconomic crises \nRemember, these are by no means all-inclusive lists. They merely  identify some common threats that many organizations face. You  may want to use them as a starting point, but a full listing of risks  facing your organization will require input from all members of the \nBCP team. \nThe risk identification portion of the process is purely qualitative. At  this point in the process, the BCP team should not be concerned  about the likelihood that each type of risk will materialize or the  amount of damage such an occurrence would inflict upon the  continued operation of the business. The results of this analysis will  drive both the qualitative and quantitative portions of the remaining \nBIA tasks. \nLikelihood Assessment \nThe preceding step consisted of the BCP team's drawing up a  comprehensive list of the events that may pose a risk to an  organization. You probably recognized that some events are much  more likely to happen than others. For example, an earthquake is a  much more plausible risk than a tropical storm for a business located  in Southern California. A company based in Florida might have the  exact opposite likelihood that each threat would occur. \nTo account for these differences, the next phase of the business  impact analysis identifies the likelihood that each threat will occur. \nWe describe this likelihood using the same process used for the risk  assessment in Chapter 2. First, we determine the annualized rate of  occurrence (ARO) that reflects the number of times a business  expects to experience a given disaster each year. This annualization  process simplifies comparing the magnitude of very different risks. \nThe BCP team should sit down and determine an ARO for each  threat identified in the previous section. Base these numbers on  corporate history, professional experience of team members, and  advice from experts, such as meteorologists, seismologists, fire  prevention professionals, and other consultants, as needed. \nIn addition to the government resources identified in  this chapter, insurance companies develop large repositories of  risk information as part of their actuarial processes. You may be  able to obtain this information from them to assist in your BCP  efforts. After all, you have a mutual interest in preventing damage  to your business! \nIn many cases, you may be able to find likelihood assessments for  some hazards prepared by experts at no cost to you. For example, the \nU.S. Geological Survey (USGS) developed the earthquake hazard  map shown in Figure 3.1. This map illustrates the ARO for  earthquakes in various regions of the United States. Similarly, the \nFederal Emergency Management Agency (FEMA) coordinates the  development of detailed flood maps of local communities throughout  the United States. These resources are available online and offer a  wealth of information to organizations performing a business impact  analysis. \nFIGURE 3.1 Earthquake hazard map of the United States \nOne useful online tool is the nonprofit First Street \nFoundation's Flood Factor, which helps you quickly identify a  property's risk of flooding. See www.floodfactor.com . \nImpact Analysis \nAs you may have surmised based on its name, the impact analysis  phase is one of the most critical portions of the business impact  analysis. In this phase, you analyze the data gathered during earlier  phases to determine the impact that each identified risk would have  on the business if it were to occur. \nFrom a quantitative point of view, we will cover three specific  metrics: the exposure factor, the single loss expectancy, and the  annualized loss expectancy. Each one of these values describes a  particular risk/asset combination evaluated during the previous  phases. \nThe exposure factor (EF) is the amount of damage that the risk poses  to the asset, expressed as a percentage of the asset's value. For  example, if the BCP team consults with fire experts and determines  that a building fire would destroy 70 percent of the building, the  exposure factor of the building to fire is 70 percent. \nThe single loss expectancy (SLE) is the monetary loss expected each  time the risk materializes. You can compute the SLE using the  following formula: \nContinuing with the preceding example, if the building is worth \n$500,000, the single loss expectancy would be 70 percent of \n$500,000, or $350,000. You can interpret this figure to mean that  you could expect a single fire in the building would cause $350,000  worth of damage. \nThe annualized loss expectancy (ALE) is the monetary loss that the  business expects to suffer as a result of the risk harming the asset  during a typical year. The SLE is the amount of damage you expect  each time a disaster strikes, and the ARO (from the likelihood  analysis) is the number of times you expect a disaster to occur each  year. You compute the ALE by simply multiplying those two  numbers: \nReturning once again to our building example, fire experts might  predict that a fire will occur in the building approximately once every \n30 years, specifically determining that there is a 0.03 chance of a fire  in any given year. The ALE is then 3 percent of the $350,000 SLE, or \n$10,500. You can interpret this figure to mean that the business  should expect to lose $10,500 each year due to a fire in the building. \nObviously, a fire will not occur each year—this figure represents the  average cost over the approximately 30 years between fires. It's not  especially useful for budgeting considerations but proves invaluable  when attempting to prioritize the assignment of BCP resources to a  given risk. Of course, a business leader may decide that the risk of  fire remains unacceptable and take actions that contradict the  quantitative assessment. That's where qualitative assessment comes  into play. \nBe sure you're familiar with the quantitative formulas  contained in this chapter, and the concepts of asset value,  exposure factor, the annualized rate of occurrence, single loss  expectancy, and annualized loss expectancy. Know the formulas  and be able to work through a scenario. \nFrom a qualitative point of view, you must consider the nonmonetary  impact that interruptions might have on your business. For example,  you might want to consider the following: \nLoss of goodwill among your client base \nLoss of employees to other jobs after prolonged downtime \nSocial/ethical responsibilities to the community \nNegative publicity \nIt's difficult to put dollar values on items like these to include them  in the quantitative portion of the impact analysis, but they are  equally important. After all, if you decimate your client base, you  won't have a business to return to when you're ready to resume  operations. \nResource Prioritization \nThe final step of the BIA is to prioritize the allocation of business  continuity resources to the various risks that you identified and  assessed in earlier phases of the BIA. \nFrom a quantitative point of view, this process is relatively  straightforward. You simply create a list of all the risks you analyzed  during the BIA process and sort them in descending order according  to the ALE computed during the impact analysis phase. This step  provides you with a prioritized list of the risks that you should  address. Select as many items as you're willing and able to handle  simultaneously from the top of the list and work your way down. \nEventually, you'll reach a point at which you've exhausted either the  list of risks (unlikely) or all your available resources (much more  likely). \nRecall from the previous section that we also stressed the importance  of addressing qualitatively important concerns. In earlier sections  about the BIA, we treated quantitative and qualitative analyses as  mainly separate functions with some overlap. Now it's time to merge  the two prioritized lists, which is more of an art than a science. You  must sit down with the BCP team and representatives from the  senior management team and combine the two lists into a single  prioritized list. \nQualitative concerns may justify elevating or lowering the priority of  risks that already exist on the ALE-sorted quantitative list. For  example, if you run a fire suppression company, your number-one  priority might be the prevention of a fire in your principal place of  business even though an earthquake might cause more physical  damage. The potential loss of reputation within the business  community resulting from the destruction of a fire suppression  company by fire might be too challenging to overcome and result in  the eventual collapse of the business, justifying the increased  priority. \nContinuity Planning \nThe first two phases of the BCP process (project scope and planning  and business impact analysis) focus on determining how the BCP  process will work and prioritizing the business assets that you must  protect against interruption. The next phase of the BCP  development, continuity planning, focuses on developing and  implementing a continuity strategy to minimize the impact realized  risks might have on protected assets. \nTwo primary subtasks are involved in continuity planning: \nStrategy development \nProvisions and processes \nIn this section, you'll learn about both strategy development and the  provisions and processes that are essential in continuity planning. \nThe goal of this process is to create a continuity of operations plan \n(COOP) . The continuity of operations plan focuses on how an  organization will carry out critical business functions beginning  shortly after a disruption occurs and extending for up to one month  of sustained operations. \nStrategy Development \nStrategy development bridges the gap between the business impact  analysis and the continuity planning elements of BCP development. \nThe BCP team must now take the prioritized list of concerns raised  by the quantitative and qualitative resource prioritization exercises  and determine which risks will be addressed by the business  continuity plan. Fully addressing all the contingencies would require  the implementation of provisions and processes that maintain a  zero-downtime posture in the face of every possible risk. For obvious  reasons, implementing a policy this comprehensive is impossible. \nThe BCP team should look back to the MTD estimates created during  the early stages of the BIA and determine which risks are deemed  acceptable and which must be mitigated by BCP continuity  provisions. Some of these decisions are obvious—the risk of a  blizzard striking an operations facility in Egypt is negligible and  constitutes an acceptable risk. The risk of a monsoon in New Delhi is  severe enough that BCP provisions must mitigate it. Each of these  risk assessments includes cost considerations. It's normally only  appropriate to mitigate a risk if the cost of mitigation is less than the  expected cost of the risk itself. \nOnce the BCP team determines which risks require mitigation and  the level of resources that will be committed to each mitigation task,  they are ready to move on to provisions and processes. \nProvisions and Processes \nThe provisions and processes subtask of continuity planning is the  meat of the entire business continuity plan. In this subtask, the BCP  team designs the specific procedures and mechanisms that will  mitigate the risks deemed unacceptable during the strategy  development subtask. Three categories of assets must be protected  through BCP provisions and processes: people, buildings/facilities,  and infrastructure. In the next three sections, we'll explore some of  the techniques you can use to safeguard these categories. \nPeople \nFirst, you must ensure that the people within your organization are  safe before, during, and after an emergency. Once you've achieved  that goal, you must make provisions to allow your employees to  conduct both their BCP and operational tasks in as normal a manner  as possible, given the circumstances. \nDon't lose sight of the fact that people are your most  valuable asset. The safety of people must always come before the  organization's business goals. Make sure that your business  continuity plan makes adequate provisions for the security of  your employees, customers, suppliers, and any other individuals  who may be affected. \nManagement should provide team members with all the resources  they need to complete their assigned tasks. At the same time, if  circumstances dictate that people be present in the workplace for  extended periods, arrangements must be made for shelter and food. \nAny continuity plan that requires these provisions should include  detailed instructions for the BCP team in the event of a disaster. The  organization should maintain stockpiles of provisions sufficient to  feed the operational and support groups for an extended time in an  accessible location. Plans should specify the periodic rotation of  those stockpiles to prevent spoilage. \nBuildings and Facilities \nMany businesses require specialized facilities to carry out their  critical operations. These might include standard office facilities,  manufacturing plants, operations centers, warehouses,  distribution/logistics centers, and repair/maintenance depots,  among others. When you perform your BIA, you will identify those  facilities that play a critical role in your organization's continued  viability. Your continuity plan should address two areas for each  critical facility: \nHardening Provisions Your BCP should outline  mechanisms and procedures that can be put in place to protect  your existing facilities against the risks defined in the strategy  development phase. Hardening provisions might include steps  as simple as patching a leaky roof or as complex as installing  reinforced hurricane shutters and fireproof walls. \nAlternate Sites If it's not feasible to harden a facility against  a risk, your BCP should identify alternate site(s) where business  activities can resume immediately (or at least in a time that's  shorter than the maximum tolerable downtime for all affected  critical business functions). Chapter 18 describes a few of the  facility types that might be useful in this stage. Typically, an  alternate site is associated with disaster recovery planning \n(DRP) rather than BCP. The organization might identify the  need for an alternate site during BCP development, but it takes  an actual interruption to trigger the use of the site, making it fall  under the DRP. \nInfrastructure \nEvery business depends on some sort of infrastructure for its critical  processes. For many companies, a vital part of this infrastructure is  an IT backbone of communications and computer systems that  process orders, manage the supply chain, handle customer  interaction, and perform other business functions. This backbone  consists of servers, workstations, and critical communications links  between sites. The BCP must address how the organization will  protect these systems against risks identified during the strategy  development phase. As with buildings and facilities, there are two  main methods of providing this protection: \nPhysically Hardening Systems You can protect systems  against the risks by introducing protective measures such as  electronic-friendly fire suppression systems and uninterruptible  power supplies. \nAlternative Systems You can also protect business  functions by introducing redundancy (either redundant  components or completely redundant systems/communications  links that rely on different facilities). \nThese same principles apply to whatever infrastructure components  serve your critical business processes—transportation systems,  electrical power grids, banking and financial systems, water supplies,  and so on. \nAs organizations move many of their technology operations to the  cloud, this doesn't reduce their reliance on physical infrastructure. \nAlthough the company may no longer operate the infrastructure  themselves, they still rely on the physical infrastructure of their cloud  service providers and should take measures to ensure they are  comfortable with the level of continuity planning conducted by those  providers. A disruption at a key cloud provider that affects one of the  organization's own critical business functions can be just as  damaging as a failure of the organization's own infrastructure. \nPlan Approval and Implementation \nOnce the BCP team completes the design phase of the BCP  document, it's time to gain top-level management endorsement of  the plan. If you have had senior management involvement  throughout the development phases of the plan, this should be a  relatively straightforward process. On the other hand, if this is your  first time approaching management with the BCP document, you  should be prepared to provide a lengthy explanation of the plan's  purpose and specific provisions. \nSenior management buy-in is essential to the success of  the overall BCP effort. \nPlan Approval \nIf possible, you should attempt to have the plan endorsed by the top  executive in your business—the chief executive officer, chairperson,  president, or similar business leader. This move demonstrates the  importance of the plan to the entire organization and showcases the  business leader's commitment to business continuity. The signature  of such an individual on the plan also gives it much greater weight  and credibility in the eyes of other senior managers, who might  otherwise brush it off as a necessary but trivial IT initiative. \nPlan Implementation \nOnce you've received approval from senior management, it's time to  dive in and start implementing your plan. The BCP team should get  together and develop an implementation schedule that utilizes the  resources dedicated to the program to achieve the stated process and  provision goals in as prompt a manner as possible, given the scope of  the modifications and the organization's attitude toward continuity  planning. \nAfter fully deploying resources, the BCP team should supervise the  design and implementation of a BCP maintenance program. This  program ensures that the plan remains responsive to evolving  business needs. \nCommunication, Training and Education \nCommunication, training and education are essential elements of the \nBCP implementation. All personnel who will be involved in the plan \n(either directly or indirectly) should receive some sort of training on  the overall plan, as well as their individual responsibilities. These  responsibilities should be clearly communicated to everyone  involved. \nEveryone in the organization should receive at least a plan overview  briefing. These briefings provide employees with the confidence that  business leaders have considered the possible risks posed to the  continued operation of the business and have put a plan in place to  mitigate the impact on the organization should a disruption occur. \nPeople with direct BCP responsibilities should be trained and  evaluated on their specific BCP tasks to ensure that they can  complete them efficiently when disaster strikes. Furthermore, at  least one backup person should be trained for every BCP task to  provide redundancy in the event personnel are injured or cannot  reach the workplace during an emergency. \nBCP Documentation \nDocumentation is a critical step in the business continuity planning  process. Committing your BCP methodology to paper provides  several significant benefits: \nIt ensures that BCP personnel have a written continuity  document to reference in the event of an emergency, even if  senior BCP team members are not present to guide the effort. \nIt provides a historical record of the BCP process that will be  useful to future personnel seeking to both understand the  reasoning behind various procedures and implement necessary  changes in the plan. \nIt forces the team members to commit their thoughts to paper—  a process that often facilitates the identification of flaws in the  plan. Having the plan on paper also allows draft documents to  be distributed to individuals not on the BCP team for a “sanity  check.” \nIn the following sections, we'll explore some of the essential  components of the written business continuity plan. \nContinuity Planning Goals \nFirst, the plan should describe the goals of continuity planning as set  forth by the BCP team and senior management. These goals should  be decided on at or before the first BCP team meeting and will most  likely remain unchanged throughout the life of the BCP. \nThe most common goal of the BCP is quite simple: to ensure the  continuous operation of the business in the face of an emergency. \nOther goals may also be inserted in this section of the document to  meet organizational needs. For example, you might have an objective  that your customer call center experiences no more than 15  consecutive minutes of downtime or that your backup servers be able  to handle 75 percent of your processing load within one hour of  activation. \nStatement of Importance \nThe statement of importance reflects the criticality of the BCP to the  organization's continued viability. This document commonly takes  the form of a letter to the organization's employees, stating the  reason that the organization devoted significant resources to the BCP  development process and requesting the cooperation of all personnel  in the BCP implementation phase. \nHere's where the importance of senior executive buy-in comes into  play. If you can put out this letter under the signature of the chief  executive officer (CEO) or an officer at a similar level, the plan will  carry tremendous weight as you attempt to implement changes  throughout the organization. If you have the signature of a lower-  level manager, you may encounter resistance as you try to work with  portions of the organization outside of that individual's direct  control. \nStatement of Priorities \nThe statement of priorities flows directly from the identifying  priorities phase of the business impact analysis. It simply involves  listing the functions considered critical to continued business  operations in a prioritized order. When listing these priorities, you  should also include a statement that they were developed as part of  the BCP process and reflect the importance of the functions to  continued business operations in the event of an emergency and  nothing more. Otherwise, the list of priorities could be used for  unintended purposes and result in a political turf battle between  competing organizations to the detriment of the business continuity  plan. \nStatement of Organizational Responsibility \nThe statement of organizational responsibility also comes from a  senior-level executive and can be incorporated into the same letter as  the statement of importance. It echoes the sentiment that “business  continuity is everyone's responsibility.” The statement of  organizational responsibility restates the organization's commitment  to business continuity planning. It informs employees, vendors, and  affiliates that the organization expects them to do everything they  can to assist with the BCP process. \nStatement of Urgency and Timing \nThe statement of urgency and timing expresses the criticality of  implementing the BCP and outlines the implementation timetable  decided on by the BCP team and agreed to by upper management. \nThe wording of this statement will depend on the actual urgency  assigned to the BCP process by your organization's leadership. \nConsider including a detailed implementation timeline to foster a  sense of urgency. \nRisk Assessment \nThe risk assessment portion of the BCP documentation essentially  recaps the decision-making process undertaken during the business  impact analysis. It should include a discussion of all the critical  business functions considered during the BIA as well as the  quantitative and qualitative analyses performed to assess the risks to  those functions. Include the actual AV, EF, ARO, SLE, and ALE  figures in the quantitative analysis. Also, describe the thought  process behind the analysis to the reader. Finally, keep in mind that  the assessment reflects a point-in-time evaluation, and the team  must update it regularly to reflect changing conditions. \nRisk Acceptance/Mitigation \nThe risk acceptance/mitigation section of the BCP documentation  contains the outcome of the strategy development portion of the BCP  process. It should cover each risk identified in the risk analysis  portion of the document and outline one of two thought processes: \nFor risks that were deemed acceptable, it should outline the  reasons the risk was considered acceptable as well as potential  future events that might warrant a reconsideration of this  determination. \nFor risks that were deemed unacceptable, it should outline the  risk management provisions and processes put into place to  reduce the risk to the organization's continued viability. \nIt's far too easy to look at a difficult risk mitigation  challenge and say, “We accept this risk” before moving on to less  difficult things. Business continuity planners should resist these  statements and ask business leaders to document their risk  acceptance decisions formally. If auditors later scrutinize your  business continuity plan, they will most certainly look for formal  artifacts of any risk acceptance decisions made in the BCP  process. \nVital Records Program \nThe BCP documentation should also outline a vital records program  for the organization. This document states where critical business  records will be stored and the procedures for making and storing  backup copies of those records. \nOne of the biggest challenges in implementing a vital records  program is often identifying the essential records in the first place. \nAs many organizations transitioned from paper-based to digital  workflows, they often lost the rigor that existed around creating and  maintaining formal file structures. Vital records may now be  distributed among a wide variety of IT systems and cloud services. \nSome may be stored on central servers accessible to groups, whereas  others may be located in digital repositories assigned to an individual  employee. \nIf that messy state of affairs sounds like your current reality, you may  want to begin your vital records program by identifying the records  that are truly critical to your business. Sit down with functional  leaders and ask, “If we needed to rebuild our organization today in a  completely new location without access to any of our computers or  files, what records would you need?” Asking the question in this way  forces the team to visualize the actual process of re-creating  operations and, as they walk through the steps in their minds, will  produce an inventory of the organization's vital records. This  inventory may evolve as people remember other important  information sources, so you should consider using multiple  conversations to finalize it. \nOnce you've identified the records that your organization considers  vital, the next task is a formidable one: find them. You should be able  to identify the storage locations for each document identified in your  vital records inventory. Once you've completed this task, you can  then use this vital records inventory to inform the rest of your  business continuity planning efforts. \nEmergency Response Guidelines \nThe emergency response guidelines outline the organizational and  individual responsibilities for immediate response to an emergency. \nThis document provides the first employees to detect an emergency  with the steps they should take to activate provisions of the BCP that  do not start automatically. This documentation should include the  following: \nImmediate response procedures (security and safety procedures,  fire suppression procedures, notification of appropriate  emergency-response agencies, etc.) \nA list of the individuals to notify of the incident (executives, BCP  team members, etc.) \nSecondary response procedures that first responders should  follow while waiting for the BCP team to assemble \nYour documentation should be easily accessible to everyone in the  organization who may be among the first responders to a crisis  incident. Any time a disruption strikes, time is of the essence. \nSlowdowns in activating your business continuity procedures may  result in undesirable downtime for your business operations. \nMaintenance \nThe BCP documentation and the plan itself must be living  documents. Every organization encounters nearly constant change,  and this dynamic nature ensures that the business's continuity  requirements will also evolve. The BCP team should not disband  after the plan is developed but should still meet periodically to  discuss the plan and review the results of plan tests to ensure that it  continues to meet organizational needs. \nMinor changes to the plan do not require conducting the full BCP  development process from scratch; the BCP team may make them at  an informal meeting by unanimous consent. However, keep in mind  that drastic changes in an organization's mission or resources may  require going back to the BCP drawing board and beginning again. \nAny time you make a change to the BCP, you must practice  reasonable version control. All older versions of the BCP should be  physically destroyed and replaced by the most current version so that  no confusion exists as to the correct implementation of the BCP. \nIt is also a good practice to include BCP components in job  descriptions to ensure that the BCP remains fresh and to increase the  likelihood that team members carry out their BCP responsibilities  correctly. Including BCP responsibilities in an employee's job  description also makes them fair game for the performance review  process. \nTesting and Exercises \nThe BCP documentation should also outline a formalized exercise  program to ensure that the plan remains current. Exercises also  verify that team members receive adequate training to perform their  duties in the event of a disaster. The testing process is quite similar  to that used for the disaster recovery plan, so we'll reserve the  discussion of the specific test types for Chapter 18. \nSummary \nEvery organization dependent on technological resources for its  survival should have a comprehensive business continuity plan in  place to ensure the sustained viability of the organization when  emergencies take place. Several important concepts underlie solid  business continuity planning practices, including project scope and  planning, business impact analysis, continuity planning, and  approval and implementation. \nEvery organization must have plans and procedures in place to help  mitigate the effects a disaster can have on continuing operations and  to accelerate the return to normal operations. To determine the risks  to your critical business functions that require mitigation, you must  work with a cross-functional team to conduct a business impact  analysis from both quantitative and qualitative points of view. You  must take the appropriate steps in developing a continuity strategy  for your organization and know what to do to weather future  disasters. \nFinally, you must create the documentation required to ensure the  effective communication of your plan to current and future BCP team  participants. Such documentation should include the continuity of  operations plan (COOP). The business continuity plan must also  contain statements of importance, priorities, organizational  responsibility, and timing. Also, the documentation should include  plans for risk assessment, acceptance, and mitigation; a vital records  program; emergency-response guidelines; and procedures for  maintenance and testing. \nChapter 18 will take this planning to the next step—developing and  implementing a disaster recovery plan that includes the technical  controls required to keep your business running in the face of a  disaster. \nStudy Essentials \nUnderstand the four steps of the business continuity  planning process. Business continuity planning involves four  distinct elements: project scope and planning, business impact  analysis, continuity planning, and approval and implementation. \nEach element contributes to the overall goal of ensuring that  business operations continue uninterrupted in the face of an  emergency. \nDescribe how to perform the business organization  analysis. In the business organization analysis, the individuals  responsible for leading the BCP process determine which  departments and individuals have a stake in the business continuity  plan. This analysis serves as the foundation for BCP team selection  and, after validation by the BCP team, is used to guide the next  stages of BCP development. \nList the necessary members of the business continuity  planning team. The BCP team should contain, at a minimum,  representatives from each of the operational and support  departments; technical experts from the IT department; physical and \nIT security personnel with BCP skills; legal representatives familiar  with corporate legal, regulatory, and contractual responsibilities;  human resources members; public relations members; and  representatives from senior management. Additional team members  depend on the structure and nature of the organization. \nKnow the legal and regulatory requirements that face  business continuity planners. Business leaders must exercise  due diligence to ensure that shareholders' interests are protected in  the event disaster strikes. Some industries are also subject to federal,  state, and local regulations that mandate specific BCP procedures. \nMany businesses also have contractual obligations to their clients  that they must meet before, during, and after a disaster. \nExplain the stages of the business impact analysis  process. The five stages of the business impact analysis process  are identifying priorities, risk identification, likelihood assessment,  impact analysis, and resource prioritization. \nDescribe the process used to develop a continuity  strategy. During the strategy development subtask, the BCP team  determines which risks they will mitigate. In the provisions and  processes subtask, the team designs mechanisms and procedures  that will mitigate identified risks. The plan must then be approved by  senior management and implemented. Personnel must also receive  training on their roles in the BCP process. \nExplain the importance of comprehensively documenting  an organization's business continuity plan. Committing the  plan to writing provides the organization with a written record of the  procedures to follow when disaster strikes. It prevents the “it's in my  head” syndrome and ensures the orderly progress of events in an  emergency. \nWritten Lab \n1. Why is it essential to include legal representatives on your  business continuity planning team? \n2. What is wrong with the “seat-of-the-pants” approach to business  continuity planning? \n3. What is the difference between quantitative and qualitative  assessment? \n4. What critical components should you include in your business  continuity training plan? \n5. What are the four main elements of the business continuity  planning process? \nReview Questions \n1. James was recently asked by his organization's CIO to lead a  core team of four experts through a business continuity planning  process for his organization. What is the first step that this core  team should undertake? \nA. BCP team selection \nB. Business organization analysis \nC. Resource requirements analysis \nD. Legal and regulatory assessment \n2. Tracy is preparing for her organization's annual business  continuity exercise and encounters resistance from some  managers who don't see the exercise as important and feel that it  is a waste of resources. She has already told the managers that it  will only take half a day for their employees to participate. What  argument could Tracy make to best address these concerns? \nA. The exercise is required by policy. \nB. The exercise is already scheduled and canceling it would be  difficult. \nC. The exercise is crucial to ensuring that the organization is  prepared for emergencies. \nD. The exercise will not be very time-consuming. \n3. The board of directors of Clashmore Circuits conducts an annual  review of the business continuity planning process to ensure  that adequate measures are in place to minimize the effect of a  disaster on the organization's continued viability. What  obligation are they satisfying by this review? \nA. Corporate responsibility \nB. Disaster requirement \nC. Due diligence \nD. Going concern responsibility \n4. Darcy is leading the BCP effort for her organization and is  currently in the project scope and planning phase. What should  she expect will be the major resource consumed by the BCP  process during this phase? \nA. Hardware \nB. Software \nC. Processing time \nD. Personnel \n5. Ryan is assisting with his organization's annual business impact  analysis effort. He's been asked to assign quantitative values to  assets as part of the priority identification exercise. What unit of  measure should he use? \nA. Monetary \nB. Utility \nC. Importance \nD. Time \n6. Renee is reporting the results of her organization's BIA to senior  leaders. They express frustration at all of the detail, and one of  them says, “Look, we just need to know how much we should  expect these risks to cost us each year.” What measure could \nRenee provide to best answer this question? \nA. ARO \nB. SLE \nC. ALE \nD. EF \n7. Jake is conducting a business impact analysis for his  organization. As part of the process, he asks leaders from  different units to provide input on how long the enterprise  resource planning (ERP) system could be unavailable without  causing irreparable harm to the organization. What measure is  he seeking to determine? \nA. SLE \nB. EF \nC. MTD \nD. ARO \n8. You are concerned about the risk that an avalanche poses to  your $3 million shipping facility. Based on expert opinion, you  determine that there is a 5 percent chance that an avalanche will  occur each year. Experts advise you that an avalanche would  completely destroy your building and require you to rebuild on  the same land. Ninety percent of the $3 million value of the  facility is attributed to the building, and 10 percent is attributed  to the land itself. What is the single loss expectancy (SLE) of  your shipping facility to avalanches? \nA. $3 million \nB. $2,700,000 \nC. $270,000 \nD. $135,000 \n9. Referring to the scenario in question 8, what is the annualized  loss expectancy? \nA. $3 million \nB. $2,700,000 \nC. $270,000 \nD. $135,000 \n10. You are concerned about the risk that a hurricane poses to your  corporate headquarters in South Florida. The building itself is  valued at $15 million. After consulting with the National \nWeather Service, you determine that there is a 10 percent  likelihood that a hurricane will strike over the course of a year. \nYou hired a team of architects and engineers, who determined  that the average hurricane would destroy approximately 50  percent of the building. What is the annualized loss expectancy \n(ALE)? \nA. $750,000 \nB. $1.5 million \nC. $7.5 million \nD. $15 million \n11. Chris is completing the risk acceptance documentation for his  organization's business continuity plan. Which one of the  following items is Chris least likely to include in this  documentation? \nA. Listing of risks deemed acceptable \nB. Listing of future events that might warrant reconsideration  of risk acceptance decisions \nC. Risk mitigation controls put in place to address acceptable  risks \nD. Rationale for determining that risks were acceptable \n12. Brian is developing continuity plan provisions and processes for  his organization. What resource should he protect as the highest  priority in those plans? \nA. Physical plant \nB. Infrastructure \nC. Financial \nD. People \n13. Ricky is conducting the quantitative portion of his organization's  business impact analysis. Which one of the following concerns is  least suitable for quantitative measurement during this  assessment? \nA. Loss of a plant \nB. Damage to a vehicle \nC. Negative publicity \nD. Power outage \n14. Lighter than Air Industries expects that it would lose $10 million  if a tornado struck its aircraft operations facility. It expects that  a tornado might strike the facility once every 100 years. What is  the single loss expectancy for this scenario? \nA. 0.01 \nB. $10 million \nC. $100,000 \nD. 0.10 \n15. Referring to the scenario in question 14, what is the annualized  loss expectancy? \nA. 0.01 \nB. $10 million \nC. $100,000 \nD. 0.10 \n16. In which business continuity planning task would you actually  design procedures and mechanisms to mitigate risks deemed  unacceptable by the BCP team? \nA. Strategy development \nB. Business impact analysis \nC. Provisions and processes \nD. Resource prioritization \n17. Matt is supervising the installation of redundant  communications links in response to a finding during his  organization's BIA. What type of mitigation provision is Matt  overseeing? \nA. Hardening systems \nB. Defining systems \nC. Reducing systems \nD. Alternative systems \n18. Helen is working on her organization's resilience plans, and her  manager asks her whether the organization has sufficient  technical controls in place to recover operations after a  disruption. What type of plan would address the technical  controls associated with alternate processing facilities, backups,  and fault tolerance? \nA. Business continuity plan \nB. Business impact analysis \nC. Disaster recovery plan \nD. Vulnerability assessment \n19. Darren is concerned about the risk of a serious power outage  affecting his organization's data center. He consults the  organization's business impact analysis and determines that the \nARO of a power outage is 20 percent. He notes that the  assessment took place three years ago, and no power outage has  occurred. What ARO should he use in this year's assessment,  assuming that none of the circumstances underlying the analysis  have changed? \nA. 20 percent \nB. 50 percent \nC. 75 percent \nD. 100 percent \n20. Of the individuals listed, who would provide the best  endorsement for a business continuity plan's statement of  importance? \nA. Vice president of business operations \nB. Chief information officer \nC. Chief executive officer \nD. Business continuity manager ",
  "elements": {
    "summaries": [
      "Every organization dependent on technological resources for its survival should have a comprehensive business continuity plan in place to ensure the sustained viability of the organization when emergencies take place. Several important concepts underlie solid business continuity planning practices, including project scope and planning, business impact analysis, continuity planning, and approval and implementation. Every organization must have plans and procedures in place to help mitigate the effects a disaster can have on continuing operations and to accelerate the return to normal operations. To determine the risks to your critical business functions that require mitigation, you must work with a cross-functional team to conduct a business impact analysis from both quantitative and qualitative points of view. You must take the appropriate steps in developing a continuity strategy for your organization and know what to do to weather future disasters. Finally, you must create the documentation required to ensure the effective communication of your plan to current and future BCP team participants. Such documentation should include the continuity of operations plan (COOP). The business continuity plan must also contain statements of importance, priorities, organizational responsibility, and timing. Also, the documentation should include plans for risk assessment, acceptance, and mitigation; a vital records program; emergency-response guidelines; and procedures for maintenance and testing. Chapter 18 will take this planning to the next step—developing and implementing a disaster recovery plan that includes the technical controls required to keep your business running in the face of a disaster. Study Essentials Understand the four steps of the business continuity planning process. Business continuity planning involves four distinct elements: project scope and planning, business impact analysis, continuity planning, and approval and implementation. Each element contributes to the overall goal of ensuring that business operations continue uninterrupted in the face of an emergency. Describe how to perform the business organization analysis. In the business organization analysis, the individuals responsible for leading the BCP process determine which departments and individuals have a stake in the business continuity plan. This analysis serves as the foundation for BCP team selection and, after validation by the BCP team, is used to guide the next stages of BCP development. List the necessary members of the business continuity planning team. The BCP team should contain, at a minimum, representatives from each of the operational and support departments; technical experts from the IT department; physical and IT security personnel with BCP skills; legal representatives familiar with corporate legal, regulatory, and contractual responsibilities; human resources members; public relations members; and representatives from senior management. Additional team members depend on the structure and nature of the organization. Know the legal and regulatory requirements that face business continuity planners. Business leaders must exercise due diligence to ensure that shareholders' interests are protected in the event disaster strikes. Some industries are also subject to federal, state, and local regulations that mandate specific BCP procedures. Many businesses also have contractual obligations to their clients that they must meet before, during, and after a disaster. Explain the stages of the business impact analysis process. The five stages of the business impact analysis process are identifying priorities, risk identification, likelihood assessment, impact analysis, and resource prioritization. Describe the process used to develop a continuity strategy. During the strategy development subtask, the BCP team determines which risks they will mitigate. In the provisions and processes subtask, the team designs mechanisms and procedures that will mitigate identified risks. The plan must then be approved by senior management and implemented. Personnel must also receive training on their roles in the BCP process. Explain the importance of comprehensively documenting an organization's business continuity plan. Committing the plan to writing provides the organization with a written record of the procedures to follow when disaster strikes. It prevents the “it's in my head” syndrome and ensures the orderly progress of events in an emergency."
    ],
    "reviewQuestions": [],
    "writtenLabs": []
  }
}