{
  "id": "chapter_1",
  "content": "Chapter 1 \nSecurity Governance Through Principles and \nPolicies \nTHE CISSP TOPICS COVERED IN THIS CHAPTER \nINCLUDE: \nDomain 1.0: Security and Risk Management \n1.2 Understand and apply security concepts \n1.2.1 Confidentiality, integrity, and availability,  authenticity, and nonrepudiation (5 Pillars of \nInformation Security) \n1.3 Evaluate and apply security governance principles \n1.3.1 Alignment of the security function to business  strategy, goals, mission, and objectives \n1.3.2 Organizational processes (e.g., acquisitions,  divestitures, governance committees) \n1.3.3 Organizational roles and responsibilities \n1.3.4 Security control frameworks (e.g., International \nOrganization for Standardization (ISO), National \nInstitute of Standards and Technology (NIST), \nControl Objectives for Information and Related \nTechnology (COBIT), Sherwood Applied Business \nSecurity Architecture (SABSA), Payment Card \nIndustry (PCI), Federal Risk and Authorization \nManagement Program (FedRAMP)) \n1.3.5 Due care/due diligence \n1.6 Develop, document, and implement security policy,  standards, procedures, and guidelines \n1.10 Understand and apply threat modeling concepts and  methodologies \n1.11 Apply supply chain risk management (SCRM)  concepts \n1.11.1 Risks associated with the acquisition of products  and services from suppliers and providers (e.g.,  product tampering, counterfeits, implants) \n1.11.2 Risk mitigations (e.g., third-party assessment  and monitoring, minimum security requirements,  service level requirements, silicon root of trust,  physically unclonable function, software bill of  materials) \nDomain 3.0 Security Architecture and Engineering \n3.1 Research, implement, and manage engineering  processes using secure design principles \n3.1.1 Threat modeling \n3.1.3 Defense in depth \nThe Security and Risk Management domain encompasses many of  the foundational elements of security solutions. Additional elements  of this domain are discussed in various chapters: \nChapter 2, “Personnel Security and Risk Management Concepts” \nChapter 3, “Business Continuity Planning” \nChapter 4, “Laws, Regulations, and Compliance” \nChapter 19, “Investigations and Ethics” \nPlease review all these chapters to have a complete perspective on  the topics of this domain. \nSecurity 101 \nWe often hear how important security is, but we don't always  understand why. Security is essential because it helps to ensure that  an organization can continue to exist and operate despite any  attempts to steal its data or compromise its physical or logical  elements. Security is an element of business management rather  than only an IT concern. Furthermore, IT and security are different. \nInformation technology (IT) or even information systems (IS) is the  hardware and software that support the operations or functions of a  business. Security is the business management tool that ensures the  reliable and protected operation of IT/IS. Security exists to support  the organization's objectives, mission, and goals. \nGenerally, a security framework that provides a starting point for  implementing security should be adopted. Once security is initiated,  fine-tuning that security is accomplished through continuous  evaluation and stress testing. There are three common types of  security evaluation: risk assessment, vulnerability assessment, and  penetration testing (these are covered in detail in Chapter 2 and \nChapter 15, “Security Assessment and Testing”). Risk assessment is  identifying assets, threats, and vulnerabilities to calculate risk. Once  risk is understood, it is used to guide the improvement of the existing  security infrastructure. Vulnerability assessment uses automated  tools to locate known security weaknesses, which can be addressed  by adding more defenses or adjusting the current protections. \nPenetration testing uses trusted teams to stress-test the security  infrastructure to find issues that may not be discovered by the prior  two means and to find those concerns before an adversary takes  advantage of them. \nSecurity should be cost-effective. Organizations do not have infinite  budgets and, thus, must allocate their funds appropriately. \nAdditionally, an organizational budget includes a percentage of  monies dedicated to security, just as most other business tasks and  processes require capital, not to mention payments to employees,  insurance, retirement, etc. You should select security controls that  provide the most significant protection for the lowest resource cost. \nSecurity should be legally defensible. The laws of your jurisdiction  are the backstop of organizational security. When someone intrudes  into your environment and breaches security, especially when such  activities are illegal, prosecution in court may be the only available  response for compensation or closure. Also, many decisions made by  an organization will have legal liability issues. If required to defend a  security action in the courtroom, legally supported security will go a  long way toward protecting your organization from facing significant  fines, penalties, or charges of negligence. \nSecurity is a journey, not a finish line. It is not a process that will  ever be concluded. It is impossible to fully secure something because  security issues are always changing. Our deployed technology is  changing with the passage of time, by users' activities, and by  adversaries discovering flaws and developing exploits. The defenses  that were sufficient yesterday may not be sufficient tomorrow. As  new vulnerabilities are discovered, new means of attack are crafted,  and new exploits are built, we have to respond by reassessing our  security infrastructure and responding appropriately. \nUnderstand and Apply Security Concepts \nSecurity management concepts and principles are inherent elements  in a security policy and solution deployment. They define the basic  parameters needed for a secure environment. They also define the  goals and objectives that both policy designers and system  implementers must achieve to create a secure solution. \nThe 5 Pillars of Information Security are confidentiality, integrity,  availability, authenticity, and nonrepudiation. The first three of  these, namely confidentiality, integrity, and availability, are so  commonly discussed as a group they have been labeled with their  own phrase, the CIA Triad . The elements of the CIA Triad are often  perceived as the primary goals and objectives of a security  infrastructure (see Figure 1.1). \nFIGURE 1.1 The CIA Triad \nSecurity controls are typically evaluated on how well they address  these three core information security tenets. Vulnerabilities and risks  are also evaluated based on the threat they pose against one or more  of the CIA Triad principles. \nConfidentiality \nThe first principle of the CIA Triad is confidentiality. Confidentiality  is the concept of the measures used to ensure the protection of the  secrecy of data, objects, or resources. The goal of confidentiality  protection is to prevent or minimize unauthorized access to data. \nConfidentiality protections prevent disclosure while protecting  authorized access. \nViolations of confidentiality are not limited to directed intentional  attacks. Many instances of unauthorized disclosure of sensitive or  confidential information are the result of human error, oversight, or  ineptitude. Confidentiality violations can result from the actions of  an end user or a system administrator. They can also occur because  of an oversight in a security policy or a misconfigured security  control. \nNumerous countermeasures can help ensure confidentiality against  possible threats. These include encryption, network traffic padding,  strict access control, rigorous authentication procedures, data  classification, and extensive personnel training. \nConcepts, conditions, and aspects of confidentiality include the  following: \nSensitivity Sensitivity refers to the quality of information  that could cause harm or damage if disclosed. \nDiscretion Discretion is a decision where an operator can  influence or control disclosure to minimize harm or damage. \nCriticality The level to which information is mission critical  is its measure of criticality . The higher the level of criticality, the  more likely the need to maintain the confidentiality of the  information. \nConcealment Concealment is the act of hiding or preventing  disclosure. Concealment is often viewed as a means of cover,  obfuscation, or distraction. A related concept to concealment is  security through obscurity , which attempts to gain protection  through hiding, silence, or secrecy. \nSecrecy Secrecy is the act of keeping something a secret or  preventing the disclosure of information. \nPrivacy Privacy refers to keeping information confidential  that is personally identifiable or that might cause harm,  embarrassment, or disgrace to someone if revealed. \nSeclusion Seclusion involves storing something in an out-of-  the-way location, likely with strict access controls. \nIsolation Isolation is the act of keeping something separated  from others. \nOrganizations should evaluate the nuances of confidentiality they  wish to enforce. Tools and technology that implement one form of  confidentiality might not support or allow other forms. \nIntegrity \nIntegrity is the concept of protecting the reliability and correctness  of data. Integrity protection prevents unauthorized alterations of  data. Properly implemented integrity protection provides a means  for authorized changes while protecting against intended and  malicious unauthorized activities (such as viruses and intrusions)  and mistakes made by authorized users (such as accidents or  oversights). \nIntegrity can be examined from three perspectives: \nPreventing unauthorized subjects from making modifications \nPreventing authorized subjects from making unauthorized  modifications, such as mistakes \nMaintaining the internal and external consistency of objects so  that their data is a correct and true reflection of the real world  and any relationship with any other object is valid, consistent,  and verifiable \nFor integrity to be maintained on a system, controls must be in place  to restrict access to data, objects, and resources. Maintaining and  validating object integrity across storage, transport, and processing  requires numerous variations of controls and oversight. \nNumerous attacks focus on the violation of integrity. These include  viruses, logic bombs, unauthorized access, errors in coding and  applications, malicious modification, intentional replacement, and  system backdoors. \nHuman error, oversight, or ineptitude accounts for many instances  of unauthorized alteration of sensitive information. They can also  occur because of an oversight in a security policy or a misconfigured  security control. \nNumerous countermeasures can ensure integrity against possible  threats. These include strict access control, rigorous authentication  procedures, intrusion detection systems, object/data encryption,  hash verifications (see Chapter 6, “Cryptography and Symmetric Key \nAlgorithms,” and Chapter 7, “PKI and Cryptographic Applications”),  interface restrictions, input/function checks, and extensive  personnel training. \nConcepts, conditions, and aspects of integrity include the following: \nAccuracy : Being correct and precise \nTruthfulness : Being a true reflection of reality \nValidity : Being factually or logically sound \nAccountability : Being responsible or obligated for actions and  results \nResponsibility : Being in charge or having control over  something or someone \nCompleteness : Having all necessary components or parts \nComprehensiveness : Being complete in scope; the full inclusion  of all needed elements \nAvailability \nAvailability means authorized subjects are granted timely and  uninterrupted access to objects. Often, availability protection  controls support sufficient bandwidth and timeliness of processing  as deemed necessary by the organization or situation. Availability  includes efficient, uninterrupted access to objects and prevention of  denial-of-service (DoS) attacks. Availability also implies that the  supporting infrastructure—including network services,  communications, and access control mechanisms—is functional and  allows authorized users to gain access. \nFor availability to be maintained on a system, controls must be in  place to ensure authorized access and an acceptable level of  performance, to quickly handle interruptions, provide for  redundancy, maintain reliable backups, and prevent data loss or  destruction. \nThere are numerous threats to availability. These include device  failure, software errors, and environmental issues (heat, static  electricity, flooding, power loss, and so on). Some forms of attack  focus on the violation of availability, including DoS attacks, object  destruction, and communication interruptions. \nMany availability breaches are caused by human error, oversight, or  ineptitude. They can also occur because of an oversight in a security  policy or a misconfigured security control. \nNumerous countermeasures can ensure availability against possible  threats. These include designing intermediary delivery systems  properly, using access controls effectively, monitoring performance  and network traffic, using firewalls and routers to prevent DoS  attacks, implementing redundancy for critical systems, and  maintaining and testing backup systems. Most security policies, as  well as business continuity planning (BCP), focus on the use of fault  tolerance features at the various levels of access/storage/security \n(that is, disk, server, or site) with the goal of eliminating single points  of failure to maintain the availability of critical systems. \nAvailability depends on both integrity and confidentiality. Without  integrity and confidentiality, availability cannot be maintained. \nConcepts, conditions, and aspects of availability include the  following: \nUsability : The state of being easy to use or learn or being able to  be understood and controlled by a subject \nAccessibility : The assurance that the widest range of subjects  can interact with a resource regardless of their capabilities or  limitations \nTimeliness : Being prompt, on time, within a reasonable time  frame, or providing a low-latency response \nDAD, Overprotection, Authenticity, Nonrepudiation, and \nAAA Services \nIn addition to the CIA Triad, you need to consider a plethora of other  security-related concepts and principles when designing a security  policy and deploying a security solution. These include the DAD \nTriad, the risks of overprotection, authenticity, nonrepudiation, and \nAAA services. \nOne interesting security concept is the opposite of the CIA Triad,  which is the DAD Triad. Disclosure, alteration, and destruction make  up the DAD Triad . The DAD Triad represents the failures of security  protections in the CIA Triad. It may be useful to recognize what to  look for when a security mechanism fails. Disclosure occurs when  sensitive or confidential material is accessed by unauthorized  entities. It is a violation of confidentiality. Alteration occurs when  data is either maliciously or accidentally changed. It is a violation of  integrity. Destruction occurs when a resource is damaged or made  inaccessible to authorized users (technically, we usually call the latter  denial of service [DoS]). Destruction is a violation of availability. \nIt may also be worthwhile to know that too much security can be its  own problem. Overprotecting confidentiality can result in a  restriction of availability. Overprotecting integrity can result in a  restriction of availability. Overproviding availability can result in a  loss of confidentiality and integrity. \nAuthenticity is the security concept that data is authentic or genuine  and originates from its alleged source. This is related to integrity but  more closely related to verifying that it is from a claimed origin. \nWhen data has authenticity, the recipient can have a high level of  confidence that the data is from whom it claims to be and did not  change in transit (or storage). \nNonrepudiation ensures that the subject of an activity or who caused  an event cannot deny that the event occurred. Nonrepudiation  prevents a subject from claiming not to have sent a message, not to  have performed an action, or not to have been the cause of an event. \nIt is made possible through identification, authentication,  authorization, auditing, and accounting. Nonrepudiation can be  established using digital certificates, session identifiers, transaction  logs, and numerous other transactional and access control  mechanisms. A system built without proper enforcement of  nonrepudiation does not provide verification that a specific entity  performed a certain action. Nonrepudiation is an essential part of  accounting. A suspect cannot be held accountable if they can  repudiate the claim against them. \nAAA services are a core security mechanism of all security  environments. The three As in this abbreviation refer to  authentication, authorization, and accounting (or sometimes  auditing). However, what is not as clear is that although there are  three letters in the acronym, it actually refers to five elements:  identification, authentication, authorization, auditing, and  accounting. These five elements represent the following processes of  security: \nIdentification Identification is claiming to be an identity  when attempting to access a secured area or system. \nAuthentication Authentication is proving that you are that  claimed identity. \nAuthorization Authorization defines the permissions (i.e.,  allow/grant and/or deny) of a resource and object access for a  specific identity or subject. \nAuditing Auditing is recording a log of the events and  activities related to the system and subjects. \nAccounting Accounting (aka accountability ) is reviewing log  files to check for compliance and violations in order to hold  subjects accountable for their actions, especially violations of  organizational security policy. \nAlthough AAA is typically referenced in relation to authentication  systems, it is actually a foundational concept for security. Missing  any of these five elements can result in an incomplete security  mechanism. The following sections discuss identification,  authentication, authorization, auditing, and accounting (see Figure \n1.2). \nFIGURE 1.2 The five elements of AAA services \nIdentification \nA subject must perform identification to start the process of  authentication, authorization, and accounting (AAA). Providing an  identity can involve typing in a username; swiping a smartcard;  waving a proximity device; speaking a phrase; or positioning your  face, hand, or finger for a camera or scanning device. Without an  identity, a system has no way to correlate an authentication factor  with the subject. \nOnce a subject has been identified (that is, once the subject's identity  has been recognized and verified), the identity is accountable for any  further actions by that subject. IT systems track activity by identities,  not by the subjects themselves. A computer doesn't know one  individual from another, but it does know that your user account is  different from all other user accounts. Simply claiming an identity  does not imply access, authorization, or authority. The identity must  be proven before use is allowed or access is granted. That process is  authentication. \nAuthentication \nThe process of verifying whether a claimed identity is valid is  authentication. Authentication requires the subject to provide  additional information that corresponds to the identity they are  claiming. The most common form of authentication is using a  password. Authentication verifies the identity of the subject by  comparing one or more factors against the database of valid  identities (that is, user accounts). The capability of the subject and  system to maintain the secrecy of the authentication factors for  identities directly reflects the level of security of that system. \nIdentification and authentication are often used together as a single  two-step process. Providing an identity is the first step, and  providing the authentication factors is the second step. Without  both, a subject cannot gain access to a system—neither element alone  is useful in terms of security. In some systems, it may seem as if you  are providing only one element but gaining access, such as when  keying in an ID code or a PIN. However, in these cases, either the  identification is handled by another means, such as physical location,  or authentication is assumed by your ability to access the system  physically. Both identification and authentication take place, but you  might not be as aware of them as when you manually type in both a  username and a password. \nEach authentication technique or factor has its unique benefits and  drawbacks. Thus, it is important to evaluate each mechanism in light  of the environment in which it will be deployed to determine  viability. We discuss authentication at length in Chapter 13, \n“Managing Identity and Authentication.” \nAuthorization \nOnce a subject is authenticated, access must be authorized. The  process of authorization ensures that the requested activity or access  to an object is possible, given the rights and privileges assigned to the  authenticated identity. In most cases, the system evaluates the  subject, the object, and the assigned permissions related to the  intended activity. If the specific action is allowed, the subject is  authorized. If the specific action is not allowed, the subject is not  authorized. \nKeep in mind that just because a subject has been identified and  authenticated does not mean they have been authorized to perform  any function or access all resources within the controlled  environment. Identification and authentication are all-or-nothing  aspects of access control. Authorization has a wide range of  variations between all or nothing for each object within the  environment. A user may be able to read a file but not delete it, print  a document but not alter the print queue, or log on to a system but  not access any resources. Authorization is discussed in Chapter 13. \nAuditing \nAuditing is the programmatic means by which a subject's actions are  tracked and recorded to hold the subject accountable for their  actions while authenticated on a system through the documentation  or recording of subject activities. It is also the process of detecting  unauthorized or abnormal activities on a system. Auditing is  recording the activities of a subject and its objects and the activities  of application and system functions. Log files provide an audit trail  for re-creating the history of an event, intrusion, or system failure. \nAuditing is needed to detect malicious actions by subjects, attempted  intrusions, and system failures. Auditing is also necessary to  reconstruct timelines of compromise events, provide evidence for  prosecution, and produce problem reports and analyses. Auditing is  usually a native feature of operating systems and most applications  and services. Thus, configuring the system to record information  about specific types of events is fairly straightforward. \nMonitoring is part of what is needed for audits, and  audit logs are part of a monitoring system, but the two terms have  different meanings. Monitoring is a type of watching or oversight,  whereas auditing is recording the information into a record or  file. It is possible to monitor without auditing, but you can't audit  without some form of monitoring. \nAccounting \nAn organization's security policy can be properly enforced only if  accounting is maintained. In other words, you can maintain security  only if subjects are held accountable for their actions. Effective  accounting relies on the capability to prove a subject's identity and  track their activities. Accountability is established by linking an  individual to the activities of an online identity through the security  services and mechanisms of auditing, authorization, authentication,  and identification. Thus, individual accountability is ultimately  dependent on the strength of these processes. Without a strong  authentication process, there is doubt that the person associated  with a specific user account was the actual entity controlling that  user account when the undesired action took place. \nTo have viable accountability, you must be able to support your  security decisions and their implementation in a court of law. If you  are unable to legally support your security efforts, then you will be  unlikely to be able to hold an individual accountable for actions  linked to a user account. With only a password as authentication,  there is significant room for doubt. Passwords are the least secure  form of authentication, with dozens of different methods available to  compromise them. However, with the use of multifactor  authentication (MFA), such as a password, smartcard, and  fingerprint scan in combination, there is very little possibility that  any other individual could have compromised the authentication  process in order to impersonate the person responsible for the user  account. \nProtection Mechanisms \nAnother aspect of understanding and applying security controls is  the concept of protection mechanisms or protection controls. Not all  security controls must have them, but many controls offer their  protection through the use of these mechanisms. Some common  examples of these mechanisms are defense in depth, abstraction,  data hiding, and using encryption. \nDefense in Depth \nDefense in depth , also known as layering , is the use of multiple  controls in a series. No one control can protect against all possible  threats. Using a multilayered solution allows for numerous different  controls to guard against whatever threats come to pass. When  security solutions are designed in layers, a single failed control  should not result in the exposure of systems or data. \nUsing layers in a series rather than in parallel is important. \nPerforming security restrictions in a series means linearly enforcing  one after the other. Only through a series configuration will each  attack be scanned, evaluated, or mitigated by every security control. \nIn a series configuration, failure of a single security control does not  render the entire solution ineffective. If security controls were  implemented in parallel, a threat could pass through a single  checkpoint that did not address its particular malicious activity. \nSerial configurations are very narrow but deep, whereas parallel  configurations are very wide but shallow. Parallel systems are useful  in distributed computing applications, but parallelism is not often a  useful concept in the realm of security. \nWithin the context of defense in depth, the terms levels, multilevel,  and layers are often used. Additionally, there are numerous other  terms that also relate to this concept, including classifications, zones,  realms, compartments, silos, segmentations, lattice structures, and  protection rings. You will see these terms used often throughout this  book. When you see them, think about the concept of defense in  depth in relation to the context of where the term is used. \nDefense in breadth or diversity of defense is also an  important related concept to defense in depth. It can be  problematic if elements of several security layers are from the  same vendor or share common code, since a vulnerability could  affect numerous layers simultaneously. Using a range of security  products from varied vendors significantly reduces or avoids the  risk of a single exploit compromising several layers at once. \nAbstraction \nAbstraction is used for efficiency. Similar elements are put into  groups, classes, or roles that are collectively assigned security  controls, restrictions, or permissions. Abstraction simplifies security  by enabling you to assign security controls to a group of objects  collected by type or function. Thus, the concept of abstraction is used  when classifying objects or assigning roles to subjects. \nAbstraction is one of the fundamental principles behind the field  known as object-oriented programming (OOP). In OOP, the  unknown environment doctrine states that users of an object (or  operating system component) don't necessarily need to know the  details of how the object works; they just need to know the proper  syntax for using the object and the type of data that will be returned  as a result (that is, how to send input and receive output). This is  very much what's involved in mediated access to data or services,  such as when user-mode applications use system calls to request  administrator-mode services or data (and such mediated access  requests may be granted or denied depending on the requester's  credentials and permissions) rather than obtaining direct,  unmediated access. (See the “Protection Rings” section of Chapter 9, \n“Security Vulnerabilities, Threats, and Countermeasures,” for more  on the topic of mediated access.) \nAnother way in which abstraction applies to security is the  introduction of object groups, sometimes called classes, where access  controls and operation rights are assigned to groups of objects rather  than on a per-object basis. This approach allows security  administrators to define and name groups easily (the names are  often related to job roles or responsibilities) and helps make the  administration of rights and privileges easier (when you add an  object to a class, you confer rights and privileges rather than having  to manage rights and privileges for each object separately). \nData Hiding \nData hiding is preventing data from being discovered or accessed by  a subject by positioning the data in a logical storage compartment  that is not accessible to nor seen by the subject. This means the  subject cannot see or access the data, not just that it is unseen. Data  hiding includes keeping a database from being accessed by  unauthorized visitors and restricting a subject at a lower  classification level from accessing data at a higher classification level. \nPreventing an application from accessing hardware directly is also a  form of data hiding. Data hiding is often a key element in security  controls as well as in programming. Steganography is an example of  data hiding (see Chapter 7). \nData hiding is a vital characteristic in multilevel secure systems. It  ensures that data existing at one level of security is not visible to  processes running at different security levels. From a security  perspective, data hiding relies on placing objects in security  containers different from those that subjects occupy to hide object  details from those without the need to know about them or the  means to access them. \nThe term security through obscurity may seem relevant here. \nHowever, that concept is different. Data hiding is intentionally  positioning data so that it is not viewable or accessible to an  unauthorized subject, whereas security through obscurity is the idea  of not informing a subject about an object being present and thus  hoping that the subject will not discover the object. In other words,  in security through obscurity, the subject could access the data if they  find it. It is digital hide and seek. Security through obscurity does not  actually implement any form of protection. It is instead an attempt to  hope something important is not discovered by keeping knowledge  of it a secret. An example of security though obscurity is when a  programmer is aware of a flaw in their software code, but they  release the product anyway hoping that no one discovers the issue  and exploits it. \nEncryption \nEncryption is the science of hiding the meaning or intent of a  communication from unintended recipients. Encryption can take  many forms and should be applied to every type of electronic  communication and storage. Encryption is discussed at length in \nChapters 6 and 7. \nSecurity Boundaries \nA security boundary is the line of intersection between areas,  subnets, or environments with different security requirements or  needs. A security boundary exists between high-security and low-  security areas, such as between a LAN (local area network) and the \nInternet. Recognizing the security boundaries on your network and  in the physical world is essential to establishing reliable security  barriers. Once you identify a security boundary, you must deploy  mechanisms to control the flow of information across that boundary. \nDivisions between security areas can take many forms. For example,  objects may have different classifications. Each classification defines  which subjects can perform functions on which objects. The  distinction between classifications is a security boundary. \nSecurity boundaries also exist between the physical environment and  the logical environment. To provide logical security, you must  provide security mechanisms different from those used to provide  physical security. Both must be present to provide a complete  security structure, and both must be addressed in a security policy. \nHowever, they are different and must be assessed as separate  elements of a security solution. \nSecurity boundaries, such as a perimeter between protected and  unprotected areas, should always be clearly defined. In a security  policy, it's important to state the point at which control ends or  begins and to identify that point in both the physical and logical  environments. Logical security boundaries are where electronic  communications interface with devices or services for which your  organization is legally responsible. In most cases, that interface is  clearly marked, and unauthorized subjects are informed that they do  not have access, and that attempts to gain access will result in  prosecution. \nThe security perimeter in the physical environment often reflects the  security perimeter of the logical environment. In most cases, the area  for which the organization is legally responsible determines the  reach of a security policy in the physical realm. This can be the walls  of an office, the walls of a building, or the fence around a campus. In  secured environments, warning signs are posted indicating that  unauthorized access is prohibited and that attempts to gain access  will be thwarted and result in prosecution. \nWhen transforming a security policy into actual controls, you must  consider each environment and security boundary separately. Simply  deduce what available security mechanisms would provide the most  reasonable, cost-effective, and efficient solution for a specific  environment and situation. However, all security mechanisms must  be weighed against the value of the objects they are to protect. \nDeploying countermeasures that cost more than the value of the  protected objects is unwarranted. \nEvaluate and Apply Security Governance \nPrinciples \nSecurity governance is the collection of practices related to  supporting, evaluating, defining, and directing an organization's  security efforts. Optimally, security governance is performed by a  board of directors or governance committee, but smaller  organizations may have the chief executive officer (CEO) or chief  information security officer (CISO) perform the activities of security  governance. Security governance seeks to compare the security  processes and infrastructure used within the organization with  knowledge and insight obtained from external sources. This is why a  board of directors often consists of people from various backgrounds  and industries. The board members can bring their varied experience  and wisdom to guide the improvement of the organization they  oversee. \nSecurity governance principles are closely related to and often  intertwined with corporate and IT governance. The goals of these  three governance agendas are often the same or interrelated, such as  maintaining business processes while striving toward growth and  resiliency. \nSome aspects of governance are imposed on organizations due to  legislative and regulatory compliance needs, whereas industry  guidelines or license requirements impose others. All forms of  governance, including security governance, must be assessed and  verified from time to time. Various requirements for auditing and  validation may be present due to government regulations or industry  best practices. This is especially problematic when laws in different  countries differ or, in fact, conflict. The organization as a whole  should be given the direction, guidance, and tools to provide  sufficient oversight and management to address threats and risks,  with a focus on eliminating downtime and keeping potential loss or  damage to a minimum. \nAs you can tell, the definitions of security governance are often  rather stilted and high-level. Ultimately, security governance is the  implementation of a security solution and a management method  that are tightly interconnected. Security governance directly oversees  and gets involved in all levels of security. Security is not and should  not be treated as an IT issue only. Instead, security affects every  aspect of an organization. Security is a business operations issue. \nSecurity is an organizational process, not just something the IT geeks  do behind the scenes. Using the term security governance is an  attempt to emphasize this point by indicating that security needs to  be managed and governed throughout the organization, not just in  the IT department. \nThere are numerous security frameworks and governance guidelines,  including the National Institute of Standards and Technology (NIST) \nSP 800-53 and NIST SP 800-100. Although the NIST guidance is  focused on government and military use, it can be adopted and  adapted by other types of organizations as well. Many organizations  adopt security frameworks in an effort to standardize and organize  what can become a complex and bewilderingly messy activity,  namely, attempting to implement reasonable security governance. \nThird-Party Governance \nThird-party governance is the system of external entity oversight  that law, regulation, industry standards, contractual obligation, or  licensing requirements may mandate. The actual method of  governance may vary, but it generally involves an outside  investigator or auditor. A governing body might designate these  auditors or might be consultants hired by the target organization. \nAnother aspect of third-party governance is the application of  security oversight to third parties that your organization relies on. \nMany organizations choose to outsource various aspects of their  business operations. Outsourced operations can include security  guards, maintenance, technical support, and accounting services. \nThese parties must comply with the primary organization's security  stance. Otherwise, they present additional risks and vulnerabilities to  the primary organization. \nThird-party governance focuses on verifying compliance with stated  security objectives, requirements, regulations, and contractual  obligations. On-site assessments can provide firsthand exposure to  the security mechanisms employed at a location. Those performing  on-site assessments or audits must follow auditing protocols (such as \nControl Objectives for Information and Related Technologies \n[COBIT]) and have a specific checklist of requirements to investigate. \nIn the auditing and assessment process, both the target and the  governing body should participate in full and open document  exchange and review. An organization needs to know the full details  of all requirements it must comply with. The organization should  submit security policy and self-assessment reports back to the  governing body. This open document exchange ensures that all  parties involved agree about all the issues of concern. It reduces the  chances of unknown requirements or unrealistic expectations. \nDocument exchange does not end with the transmission of  paperwork or electronic files. Instead, it leads to the process of  documentation review. \nSee Chapter 12, “Secure Communications and Network Attacks,” for  a discussion of third-party connectivity. \nDocumentation Review \nDocumentation review is the process of reading the exchanged  materials and verifying them against standards and expectations. \nThe documentation review is typically performed before any on-site  inspection takes place. If the exchanged documentation is sufficient  and meets expectations (or at least requirements), then an on-site  review will be able to focus on compliance with the stated  documentation. However, if the documentation is incomplete,  inaccurate, or otherwise insufficient, the on-site review is postponed  until the documentation can be updated and corrected. This step is  important because if the documentation is not in compliance, the  location will likely not be in compliance either. \nIn many situations, especially those related to government or  military agencies or contractors, failing to provide sufficient  documentation to meet requirements of third-party governance can  result in a loss of or a voiding of authorization to operate (ATO) . \nComplete and sufficient documentation can often maintain existing \nATOs or provide a temporary ATO (TATO). However, once an ATO is  lost or revoked, complete documentation and on-site review showing  full compliance are usually necessary to reestablish the ATO. \nA portion of the documentation review is the logical and practical  investigation of the business processes and organizational policies in  light of standards, frameworks, and contractual obligations. This  review ensures that the stated and implemented business tasks,  systems, and methodologies are practical, efficient, and cost-  effective, and most of all (at least in relation to security governance)  that they support the goal of security through the reduction of  vulnerabilities and the avoidance, reduction, or mitigation of risk. \nManaging, assessing, and addressing risk are all methods and  techniques involved in performing process/policy review. \nManage the Security Function \nThe security function is the aspect of operating a business that  focuses on the task of evaluating and improving security over time. \nTo manage the security function, an organization must implement  proper and sufficient security governance. \nThe act of performing a risk assessment to drive the security policy is  the clearest and most direct example of management of the security  function. The process of risk assessment is discussed in Chapter 2. \nSecurity must be measurable. Measurable security means that the  various aspects of the security mechanisms function, provide a clear  benefit, and have one or more metrics that can be recorded and  analyzed. Similar to performance metrics, security metrics are  measurements of performance, function, operation, action, and so on  as related to the operation of a security feature. When a  countermeasure or safeguard is implemented, security metrics  should show a reduction in unwanted occurrences or an increase in  the detection of attempts. The act of measuring and evaluating  security metrics is the practice of assessing the completeness and  effectiveness of the security program. This should also include  measuring it against common security guidelines and tracking the  success of its controls. Tracking and assessing security metrics is part  of effective security governance. \nManaging the security function includes the development and  implementation of information security strategies. Most of the  content of this book, addresses the various aspects of the  development and implementation of information security strategies. \nAlignment of Security Function to Business Strategy, \nGoals, Mission, and Objectives \nSecurity management planning ensures the proper creation,  implementation, and enforcement of a security policy . Security  management planning aligns the security functions to the strategy,  goals, mission, and objectives of the organization. This includes  designing and implementing security based on business cases,  budget restrictions, or scarcity of resources. A business case is  usually a documented argument or stated position in order to define  a need to make a decision or take some form of action. To make a  business case is to demonstrate a business-specific need to alter an  existing process or choose an approach to a business task. A business  case is often made to justify the start of a new project, especially a  project related to security. Money and resources, such as people,  technology, and space, are limited in most organizations. Due to  resource limitations like these, the maximum benefit needs to be  obtained from any endeavor. \nA top-down approach is one of the most effective ways to tackle  security management planning. Upper or senior management is  responsible for initiating and defining policies for the organization. \nSecurity policies provide direction for all levels of the organization's  hierarchy. Middle management's responsibility is to flesh out the  security policy into standards, baselines, guidelines, and procedures. \nThe operational managers or security professionals must then  implement the configurations prescribed in the security  management documentation. Finally, the end users must comply  with all the security policies of the organization. \nThe opposite of the top-down approach is the  bottom-up approach. In a bottom-up approach environment, the \nIT staff makes security decisions directly without input from  senior management. The bottom-up approach is rarely used in  organizations and is considered problematic in the IT industry. \nSecurity management is a responsibility of upper management, not  of the IT staff, and is considered an issue of business operations  rather than IT administration. The team or department responsible  for security within an organization should be autonomous. The  information security (InfoSec) team should be led by a designated  chief information security officer (CISO) who reports directly to  senior management, such as the chief information officer (CIO), the  chief executive officer (CEO), or the board of directors. Placing the  autonomy of the CISO and the CISO's team outside the typical  hierarchical structure in an organization can improve security  management across the entire organization. It also helps avoid cross-  department and internal political issues. The term chief security  officer (CSO) is sometimes used as an alternative to CISO, but in  many organizations, the CSO position is a subposition under the \nCISO that focuses on physical security. Another potential term for  the CISO is information security officer (ISO) , but this also can be  used as a subposition under the CISO. \nThe chief information officer (CIO) focuses on  ensuring information is used effectively to accomplish business  objectives. The chief technical officer (CTO) focuses on ensuring  that equipment and software work properly to support the  business functions. \nElements of security management planning include defining security  roles; prescribing how security will be managed, who will be  responsible for security, and how security will be tested for  effectiveness; developing security policies; performing risk analysis;  and requiring security education for employees. These efforts are  guided through the development of management plans. \nThe best security plan is useless without one key factor: approval by  senior management . Without senior management's approval of and  commitment to the security policy, the policy will not succeed. It is  the responsibility of the policy development team to educate senior  management sufficiently so managers understand the risks,  liabilities, and exposures that remain even after security measures  prescribed in the policy are deployed. Developing and implementing  a security policy is evidence of due diligence and due care on the part  of senior management. If a company does not practice due diligence  and due care, managers can be held liable for negligence and held  accountable for both asset and financial losses. \nA security management planning team should develop three types of  plans, as shown in Figure 1.3: \nStrategic Plan A strategic plan is a long-term plan that is  fairly stable. It defines the organization's security purpose. It  defines the security function and aligns it with the goals,  mission, and objectives of the organization. It's useful for about  five years if it is maintained and updated annually. The strategic  plan also serves as the planning horizon. Long-term goals and  visions for the future are discussed in a strategic plan. A  strategic plan should include a risk assessment. \nTactical Plan The tactical plan is a midterm plan developed  to provide more details on accomplishing the goals set forth in  the strategic plan or can be crafted ad hoc based on unpredicted  events. A tactical plan is typically useful for about a year and  often prescribes and schedules the tasks necessary to  accomplish organizational goals. Some examples of tactical  plans are project plans, acquisition plans, hiring plans, budget  plans, maintenance plans, support plans, and system  development plans. \nOperational Plan An operational plan is a short-term,  highly detailed plan based on strategic and tactical plans. It is  valid or useful only for a short time. Operational plans must be  updated often (such as monthly or quarterly) to retain  compliance with tactical plans. Operational plans spell out how  to accomplish the various goals of the organization. They include  resource allotments, budgetary requirements, staffing  assignments, scheduling, and step-by-step or implementation  procedures. Operational plans include details on how the  implementation processes are in compliance with the  organization's security policy. Examples of operational plans are  training plans, system deployment plans, and product design  plans. \nFIGURE 1.3 Strategic, tactical, and operational plan timeline  comparison \nSecurity is a continuous process. Thus, the activity of security  management planning may have a definitive initiation point, but its  tasks and work are never fully accomplished or complete. Effective  security plans focus attention on specific and achievable objectives,  anticipate change and potential problems, and serve as a basis for  decision-making for the entire organization. Security documentation  should be concrete, well-defined, and clearly stated. For a security  plan to be effective, it must be developed, maintained, and actually  used. \nOrganizational Processes \nSecurity governance should address every aspect of an organization,  including the organizational processes of acquisitions, divestitures,  and governance committees. Acquisitions and mergers place an  organization at an increased level of risk. Such risks include  inappropriate information disclosure, data loss, downtime, or failure  to achieve sufficient return on investment (ROI). In addition to all  the typical business and financial aspects of mergers and  acquisitions, a healthy dose of security oversight and increased  scrutiny is often essential to reduce the likelihood of losses during  such a period of transformation. \nSimilarly, divestiture or any form of asset or employee reduction is  another time period of increased risk and, thus, increased need for  focused security governance. Assets need to be sanitized to prevent  data leakage. Storage media should be removed and destroyed  because media sanitization techniques do not guarantee against data  remnant recovery. Employees released from duty need to be  debriefed. This process is often called an exit interview. This process  usually involves reviewing any nondisclosure agreements and any  other binding contracts or agreements that will continue after  employment has ceased. \nWhen acquisitions and mergers are made without security  considerations, the risks inherent in those obtained products remain  throughout their deployment life span. Minimizing inherent threats  in acquired elements will reduce security management costs and  likely reduce security violations. \nIt is important to evaluate the risks associated with hardware,  software, and services. Products and solutions that have resilient  integrated security are often more expensive than those that fail to  have a security foundation. However, this additional initial expense  is often a much more cost-effective expenditure than addressing  security deficiencies over the life of a poorly designed product. Thus,  when considering the cost of a merger/acquisition, it is important to  consider the total cost of ownership over the life of the product's  deployment rather than just initial purchase and implementation. \nAcquisitions do not relate exclusively to hardware and software. \nOutsourcing, contracting with suppliers, and engaging consultants  are also elements of acquisition. Integrating security assessments  when working with external entities is just as important as ensuring  a product was designed with security in mind. \nIn many cases, ongoing security monitoring, management, and  assessment may be required. This could be an industry best practice  or a regulation. Such assessment and monitoring might be  performed by the organization internally or may require the use of  external auditors. When engaging third-party assessment and  monitoring services, keep in mind that the external entity needs to  show security-mindedness in their business operations. If an  external organization is unable to manage their own internal  operations on a secure basis, how can they provide reliable security  management functions for yours? \nWhen evaluating a third party for your security integration, consider  the following processes: \nOn-Site Assessment Visit the site of the organization to  interview personnel and observe their operating habits. \nDocument Exchange and Review Investigate the means  by which datasets and documentation are exchanged and the  formal processes by which they perform assessments and  reviews. This focuses on the means and processes. \nProcess/Policy Review Request copies of their security  policies, processes/procedures, and documentation of incidents  and responses for review. This focuses on the written policies. \nThird-Party Audit Having an independent third-party  auditor, as defined by the American Institute of Certified Public \nAccountants (AICPA), can provide an unbiased review of an  entity's security infrastructure, based on System and \nOrganization Controls (SOC) reports. See Chapter 15 for details  on SOC reports. \nFor all acquisitions, establish minimum security requirements. These  should be modeled after your existing security policy. The security  requirements for new hardware, software, or services should always  meet or exceed the security of your existing infrastructure. When  working with an external service, be sure to review any service-level  agreement (SLA) to ensure that security is a prescribed component  of the contracted services. When that external provider is crafting  software or providing a service (such as a cloud provider), then a  service-level requirement (SLR) may need to be defined. \nAn SLR is a statement of the expectations of service and performance  from the product or service of a vendor. Often, an SLR is provided by  the customer/client prior to the establishment of the SLA (which  should incorporate the elements of the SLR if the vendor expects the  customer to sign the agreement). \nTwo additional examples of organizational processes that are  essential to strong security governance are change control/change  management (see Chapter 16, “Managing Security Operations”) and  data classification (see Chapter 5, “Protecting Security of Assets”). \nOrganizational Roles and Responsibilities \nA security role is an individual's part in the overall scheme of  security implementation and administration within an organization. \nSecurity roles are not necessarily prescribed in job descriptions  because they are not always distinct or static. Familiarity with  security roles will help in establishing a communications and support  structure within an organization. This structure will enable the  deployment and enforcement of the security policy. This section  focuses on general-purpose security roles for managing an overall  security infrastructure. See Chapter 5 for roles related specifically to  data management. \nThe following are the common security roles present in a typical  secured environment: \nSenior Manager The organizational owner ( senior  manager ) role is assigned to the person who is ultimately  responsible for the security maintained by an organization and  who should be most concerned about the protection of its assets. \nThe senior manager must sign off on all security policy issues. \nThere is no effective security policy if the senior management  does not authorize and support it. The senior manager is the  person who will be held liable for the overall success or failure of  a security solution and is responsible for exercising due  diligence and due care in establishing security for an  organization. Even though senior managers are ultimately  responsible for security, they rarely implement security  solutions. In most cases, that responsibility is delegated to  security professionals within the organization. \nSecurity Professional The security professional ,  information security (InfoSec) officer , or cyber incident  response team (CIRT) role is assigned to a trained and  experienced network, systems, and security engineer who is  responsible for following the directives mandated by senior  management. The security professional has the functional  responsibility for security, including writing the security policy  and implementing it. The role of a security professional may be  labeled as an IS/IT role, but its focus is on protection more than  function. The security professional role is often filled by a team  that is responsible for designing and implementing security  solutions based on the approved security policy. Security  professionals are not decision makers; they are implementers. \nAll decisions must be left to the senior manager. \nAsset Owner The asset owner role is assigned to the person  who is responsible for classifying information for placement and  protection within the security solution. The asset owner is  typically a high-level manager who is ultimately responsible for  asset protection. However, the asset owner usually delegates the  responsibility of the actual data management tasks to a  custodian. \nCustodian The custodian role is assigned to the person who  is responsible for the tasks of implementing the prescribed  protection defined by the security policy and senior  management. The custodian performs all activities necessary to  provide adequate protection for the CIA Triad (confidentiality,  integrity, and availability) of data and to fulfill the requirements  and responsibilities delegated by upper management. These  activities can include performing and testing backups, validating  data integrity, deploying security solutions, and managing data  storage based on classification. \nUser The user ( end user or operator ) role is assigned to any  person who has access to the secured system. A user's access is  tied to their work tasks and is limited so that they have only  enough access to perform the tasks necessary for their job  position (the principle of least privilege). Users are responsible  for understanding and upholding the security policy of an  organization by following prescribed operational procedures and  operating within defined security parameters. \nAuditor An auditor is responsible for reviewing and verifying  that the security policy is properly implemented and the derived  security solutions are adequate. The auditor produces  compliance and effectiveness reports that are reviewed by the  senior manager. Issues discovered through these reports are  transformed into new directives assigned by the senior manager  to security professionals or custodians. \nAll of these roles serve an important function within a secured  environment. They are useful for identifying liability and  responsibility as well as for identifying the hierarchical management  and delegation scheme. \nSecurity Control Frameworks \nOne of the first and most important security planning steps is to  consider the overall security control framework or structure of the  security solution desired by the organization. Security control  frameworks, often referred to as security frameworks or  cybersecurity frameworks, are structured sets of guidelines,  standards, best practices, and controls designed to help  organizations effectively manage and enhance their information  security and cybersecurity posture. These frameworks provide a  systematic and comprehensive approach to identifying,  implementing, and monitoring security controls and measures to  protect an organization's data, systems, networks, and sensitive  information. There are numerous organizations that produce and  maintain security control frameworks. \nInternational Organization for Standardization (ISO) \nThe International Organization for Standardization (ISO) is a  worldwide standards-setting group of representatives from various  national standards organizations. ISO defines standards for  industrial and commercial equipment, software, protocols, and  management, among others. It issues six main products: \nInternational Standards, Technical Reports, Technical Specifications, \nPublicly Available Specifications, Technical Corrigenda, and Guides. \nISO standards are widely accepted across many industries and have  even been adopted as requirements or laws by various governments. \nFor more information on ISO, please visit ISO.org . Specifically, the \nISO/IEC 27000 family group is an international security standard  that can be the basis for implementing organizational security and  related management practices. (The International Electrotechnical \nCommission [IEC] is an international standards organization that  prepares and publishes international standards for all electrical,  electronic, and related technologies. ISO and IEC often work  together in establishing worldwide standards.) \nNational Institute of Standards and Technology (NIST) \nThe National Institute of Standards and Technology (NIST) is a U.S.  federal agency that operates under the umbrella of the U.S. \nDepartment of Commerce. NIST's mission is to promote and  maintain measurement standards, as well as advance technology and  innovation. It plays a pivotal role in developing and promoting  standards and best practices, especially in the areas of science and  technology. NIST is responsible for establishing and maintaining  various standards, including those related to computer security. One  of the most well-known publications from NIST is the NIST Special \nPublication (SP) 800-53 “Security and Privacy Controls for \nInformation Systems and Organizations,” which outlines a  comprehensive set of security controls and guidelines for  information systems used by U.S. federal agencies. This publication  is widely used as a reference for implementing information security  practices, especially within government organizations and in various  sectors that handle sensitive data. NIST also established the Risk \nManagement Framework (RMF) and Cybersecurity Framework \n(CSF) (both covered in Chapter 2). \nThe Center for Internet Security (CIS) provides OS,  application, and hardware security configuration guides at  www.cisecurity.org/cis-benchmarks . These are not considered  security control frameworks, but they are often used in  conjunction with them. \nControl Objectives for Information and Related Technologies \n(COBIT) \nControl Objectives for Information and Related Technologies \n(COBIT) is a documented set of best IT security practices crafted by \nISACA. (Previously spelled out as Information Systems Audit and \nControl Association, however the organization no longer uses the full  name only the acronym as their name.) It prescribes goals and  requirements for security controls and encourages the mapping of IT  security ideals to business objectives. COBIT is based on six key  principles for the governance and management of enterprise IT: \nProvide Stakeholder Value \nHolistic Approach \nDynamic Governance System \nGovernance Distinct from Management \nTailored to Enterprise Needs \nEnd-to-End Governance System \nCOBIT is used not only to plan the IT security of an organization but  also as a guideline for auditors ( www.isaca.org/resources/cobit ). \nSherwood Applied Business Security Architecture (SABSA) \nSherwood Applied Business Security Architecture (SABSA) is a  framework and methodology for developing risk-driven enterprise  security and information assurance architectures. It is known for its  holistic and business-focused approach to security architecture. \nKey aspects of SABSA include: \nRisk-focused: SABSA places a strong emphasis on identifying  and managing security risks within the context of the business. \nIt aims to align security measures with an organization's specific  risks and objectives. \nBusiness-driven: SABSA promotes the idea that security should  be integrated into an organization's business processes and  goals. It helps organizations understand how security supports  and enables business activities. \nLayered approach: SABSA uses a layered architectural model to  address security concerns at various levels, from strategic  planning down to operational security controls. These layers  include the business context, information domain, systems,  technology, and physical security. \nFramework and methodology: SABSA provides a structured  framework for developing security architectures and a  comprehensive methodology for designing, implementing, and  managing security solutions. \nCertification: SABSA offers a certification program that allows  security professionals to become certified in SABSA  methodologies and practices. \nSABSA is often used in large organizations and enterprises where a  robust and business-aligned approach to security architecture is  required. It helps organizations create security architectures that are  not only effective in addressing security risks but that are also closely  tied to the organization's strategic goals and objectives. \nPayment Card Industry Data Security Standard (PCI DSS) \nPayment Card Industry Data Security Standard (PCI DSS) is a set of  security standards and requirements designed to ensure the  protection of sensitive credit card and debit card information. PCI \nDSS was established by major credit card companies to enhance the  security of payment card transactions and to protect cardholder data. \nKey components of PCI DSS include: \nData security: PCI DSS sets guidelines for the secure handling  of payment card data, including cardholder names, primary  account numbers (PANs), expiration dates, and card verification  values (CVVs). \nNetwork security: PCI DSS mandates the implementation of  robust network security practices, including firewalls,  encryption, and access controls, to protect cardholder data  during transmission. \nAccess control: PCI DSS requires organizations to restrict access  to cardholder data on a need-to-know basis. Access should be  limited to authorized personnel only. \nRegular monitoring and testing: Continuous monitoring and  regular security testing are necessary to identify and address  vulnerabilities in systems and applications that process  cardholder data. \nInformation security policies: Organizations must develop and  maintain comprehensive security policies and procedures to  guide employees in secure practices related to payment card  data. \nVulnerability management: This involves the timely  identification and remediation of security vulnerabilities to  protect against potential threats. \nPhysical security: PCI DSS also includes requirements for the  physical security of cardholder data, including restricted access  to servers, storage, and point-of-sale (POS) devices. \nIncident response: Having an incident response plan is essential  to respond promptly and effectively to security incidents and  data breaches. \nCompliance audits: Organizations that handle payment card  data are required to undergo regular PCI DSS compliance  audits. These audits are conducted by independent qualified  security assessors (QSAs) or internal security assessors (ISAs)  who are certified to assess compliance. The goal of these audits  is to determine whether the organization complies with the PCI \nDSS requirements. \nCompliance with PCI DSS is mandatory for any entity that processes  payment card transactions, including merchants, service providers,  and financial institutions. Failure to comply with PCI DSS can lead to  fines, loss of card processing privileges, and reputational damage. \nPCI DSS is typically updated periodically to address evolving security  threats and technology changes, so organizations subject to its  requirements must stay current with the latest version and maintain  compliance. \nFederal Risk and Authorization Management Program \n(FedRAMP) \nThe Federal Risk and Authorization Management Program \n(FedRAMP) is a U.S. government-wide program designed to  standardize the security assessment, authorization, and continuous  monitoring processes for cloud products and services used by federal  agencies. Its primary goal is to ensure that cloud services meet  stringent security requirements and can be used by U.S. government  organizations to process, store, and transmit sensitive and classified  information. \nKey elements of FedRAMP include: \nSecurity standardization: FedRAMP establishes a set of security  controls, baselines, and requirements that cloud service  providers (CSPs) must adhere to when offering cloud solutions  to federal agencies. These requirements are based on NIST SP \n800-53, which outlines security controls for federal information  systems. \nAuthorization process: CSPs seeking to offer their cloud services  to federal agencies must go through a rigorous authorization  process. This process involves a comprehensive security  assessment, documentation, and evaluation by a third-party  assessment organization. \nContinuous monitoring: Once authorized, CSPs are required to  maintain ongoing security monitoring and reporting to ensure  that their services continue to meet the established security  standards and remain secure throughout their life cycle. \nReuse of authorizations: FedRAMP encourages the reuse of  security authorizations across federal agencies. When a CSP  receives a FedRAMP authorization, other agencies can reuse  that authorization rather than conducting their own  assessments, streamlining the procurement process. \nCollaboration: FedRAMP fosters collaboration between federal  agencies, CSPs, and third-party assessors. It aims to create a  more efficient and standardized approach to cloud security  while reducing duplication of effort. \nThree impact levels: FedRAMP has three impact levels (low,  moderate, and high) to account for different levels of sensitivity  and classification of federal data. The required security controls  and assessment processes vary based on the impact level. \nCompliance framework: FedRAMP provides a framework that  ensures the security of cloud services and helps federal agencies  make informed decisions when selecting and implementing  cloud solutions. \nFedRAMP plays a critical role in securing federal government data  and systems by ensuring that cloud services meet rigorous security  standards. It also simplifies the procurement and adoption of cloud  solutions for federal agencies by providing a standardized and  transparent process for assessing and authorizing cloud services for  government use. \nInformation Technology Infrastructure Library (ITIL) \nInformation Technology Infrastructure Library (ITIL) \n( itlibrary.org ), initially crafted by the British government, is a set  of recommended best practices for the optimization of IT services to  support business growth, transformation, and change. ITIL focuses  on understanding how IT and security need to be integrated with and  aligned to the objectives of an organization. ITIL and operational  processes are often used as a starting point for the crafting of a  customized IT security solution within an established infrastructure. \nThere are many specialized security control  frameworks, such as the SWIFT security control framework. The \nSWIFT security control framework refers to the set of security  measures, guidelines, and best practices established by SWIFT \n(Society for Worldwide Interbank Financial Telecommunication)  to ensure the security, trust, and integrity of financial messaging  and transactions within the global financial network. \nDue Diligence and Due Care \nWhy is planning to plan security so important? One reason is the  requirement for due diligence and due care . Due diligence is  establishing a plan, policy, and process to protect the interests of an  organization. Due care is practicing the individual activities that  maintain the due diligence effort. For example, due diligence is  developing a formalized security structure containing a security  policy, standards, baselines, guidelines, and procedures. Due care is  the continued application of this security structure onto the IT  infrastructure of an organization. Operational security is the ongoing  maintenance of continued due diligence and due care by all  responsible parties within an organization. Due diligence is knowing  what should be done and planning for it; due care is doing the right  action at the right time. \nDue diligence is also used as a detection mechanism, referred to as \n“do detect.” The idea is that while due care (aka “do correct”)  activities are being performed, due diligence is used to oversee and  confirm that the proper actions are being taken and that a record of  such actions is being created. This is an extension of the planning  concept based on continued oversight while performing tasks  properly. Additionally, as conditions change (whether new threats,  risks, or business tasks), due diligence is the adjustment of prior  plans to take into account new conditions and concerns. Once  updated, due care implements the revised plans. \nIn today's business environment, prudence is mandatory. Showing  due diligence and due care is the only way to disprove negligence in  an occurrence of loss. Senior management must show due care and  due diligence to reduce their culpability and liability when a loss  occurs. \nSecurity Policy, Standards, Procedures, and \nGuidelines \nFor most organizations, maintaining security is an essential part of  ongoing business. To reduce the likelihood of a security failure,  implementing security has been formalized with a hierarchical  organization of documentation. Developing and implementing  documented security policies, standards, procedures, and guidelines  produces a solid and reliable security infrastructure. \nSecurity Policies \nThe top tier of the formalization is known as a security policy. A  security policy is a document that defines the scope of security  needed by the organization and discusses the assets that require  protection and the extent to which security solutions should go to  provide the necessary protection. The security policy is an overview  or generalization of an organization's security needs. It defines the  strategic security objectives, vision, and goals and outlines the  security framework of an organization. The security policy is used to  assign responsibilities, define roles, specify audit requirements,  outline enforcement processes, indicate compliance requirements,  and define acceptable risk levels. This document is often used as  proof that senior management has exercised due diligence in  protecting itself against intrusion, attack, and disaster. Security  policies are compulsory. \nMany organizations employ several types of security policies to  define or outline their overall security strategy. An organizational  security policy focuses on issues relevant to every aspect of an  organization. An issue-specific security policy focuses on a specific  network service, department, function, or other aspect that is distinct  from the organization as a whole. A system-specific security policy  focuses on individual systems or types of systems and prescribes  approved hardware and software, outlines methods for locking down  a system, and even mandates firewall or other specific security  controls. \nFrom the security policies flow many other documents or sub-  elements necessary for a complete security solution. Policies are  broad overviews, whereas standards, baselines, guidelines, and  procedures include more specific, detailed information on the actual  security solution. Standards are the next level below security policies. \nSecurity Standards, Baselines, and Guidelines \nOnce the main security policies are set, the remaining security  documentation can be crafted under the guidance of those policies. \nStandards define compulsory requirements for the homogenous use  of hardware, software, technology, and security controls. They  provide a course of action by which technology and procedures are  uniformly implemented throughout an organization. \nA baseline defines a minimum level of security that every system  throughout the organization must meet. A baseline is a more  operationally focused form of a standard. All systems not complying  with the baseline should be taken out of production until they can be  brought up to the baseline. The baseline establishes a common  foundational secure state on which all additional and more stringent  security measures can be built. Baselines are usually system-specific  and often refer to an industry or government standard. \nGuidelines are the next element of the formalized security policy  structure. A guideline offers recommendations on how standards  and baselines are implemented and serves as an operational guide  for both security professionals and users. Guidelines are flexible, so  they can be customized for each unique system or condition and can  be used in the creation of new procedures. They state which security  mechanisms should be deployed instead of prescribing a specific  product or control and detailing configuration settings. They outline  methodologies, include suggested actions, and are not compulsory. \nSecurity Procedures \nProcedures are the final element of the formalized security policy  structure. A procedure or standard operating procedure (SOP) is a  detailed, step-by-step how-to document that describes the exact  actions necessary to implement a specific security mechanism,  control, or solution. A procedure could discuss the entire system  deployment operation or focus on a single product or aspect. They  must be updated as the hardware and software of a system evolve. \nThe purpose of a procedure is to ensure the integrity of business  processes through standardization and consistency of results. \nKeeping these various security documents as separate entities  provides these benefits: \nNot all users need to know the security standards, baselines,  guidelines, and procedures for all security classification levels. \nWhen changes occur, it is easier to update and redistribute only  the affected material rather than updating a monolithic policy  and redistributing it throughout the organization. \nMany organizations struggle just to define the foundational  parameters of their security, much less detail every single aspect of  their day-to-day activities. However, in theory, a detailed and  complete security policy supports real-world security in a directed,  efficient, and specific manner. Once the security policy  documentation is reasonably complete, it can be used to guide  decisions, train new users, respond to problems, and predict trends  for future expansion. \nThreat Modeling \nThreat modeling is the security process where potential threats are  identified, categorized, and analyzed. Threat modeling can be  performed as a proactive measure during design and development or  as a reactive measure once a product has been deployed. In either  case, the process identifies the potential harm, the probability of  occurrence, the priority of concern, and the means to eradicate or  reduce the threat. \nThreat modeling isn't meant to be a single event. Instead, it's meant  to be initiated early in the design process of a system and continue  throughout its life cycle. For example, Microsoft uses a security  development life cycle (SDL) which includes a range of procedures  aimed at bolstering security assurance and compliance prerequisites. \n(See www.microsoft.com/en-us/securityengineering/sdl). This SDL  aids developers in creating software that is more secure by  diminishing the quantity and seriousness of software vulnerabilities,  all the while trimming development expenses. \nA defensive approach to threat modeling takes place during the early  stages of systems development, specifically during initial design and  specifications establishment. This method is based on predicting  threats and designing in specific defenses during the coding and  crafting process. In most cases, integrated security solutions are  more cost-effective and more successful than those shoehorned in  later. While not a formal term, this concept could be considered a  proactive approach to threat management. \nUnfortunately, not all threats can be predicted  during the design phase, so a reactive approach to threat  management is still needed to address unforeseen issues. This  concept is often called threat hunting or may be referred to as an  adversarial approach . Threat hunting is the activity of looking  for existing evidence of a compromise once symptoms or an IoC \n(indication of compromise) of an exploit become known. Threat  modeling looks for zero-day exploits before harm is experienced,  whereas threat hunting uses IoC information to find harm that  has already occurred. \nAn adversarial approach to threat modeling takes place after a  product has been created and deployed. This deployment could  be in a test or laboratory environment or in the general  marketplace. This technique of threat hunting is the core concept  behind ethical hacking, penetration testing, source code review,  and fuzz testing. Although these processes are often useful in  finding flaws and threats, they, unfortunately, result in additional  effort in coding to add new countermeasures, typically released as  patches. This results in less effective security improvements (over  defensive threat modeling) at the cost of potentially reducing  functionality and user-friendliness. \nFuzz testing is a specialized dynamic testing technique that  provides many different types of input to software to stress its  limits and find previously undetected flaws. See Chapter 15 for  more on fuzz testing. \nIdentifying Threats \nThere's an almost infinite possibility of threats, so it's important to  use a structured approach to accurately identify relevant threats. For  example, some organizations use one or more of the following three  approaches: \nFocused on Assets This method uses asset valuation results  and attempts to identify threats to valuable assets. \nFocused on Attackers Some organizations are able to  identify potential attackers and can identify the threats they  represent based on the attackers' motivations, goals, or tactics,  techniques, and procedures (TTPs). \nFocused on Software If an organization develops software,  it can consider potential threats against the software. \nIt's common to pair threats with vulnerabilities to identify threats  that can exploit assets and represent significant risks to the  organization. The ultimate goal of threat modeling is to prioritize the  potential threats against an organization's valuable assets. \nWhen attempting to inventory and categorize threats, it is often  helpful to use a guide or reference. Microsoft developed a threat  categorization scheme known as the STRIDE threat model. STRIDE  is an acronym standing for the following: \nSpoofing: An attack with the goal of gaining access to a target  system through the use of a falsified identity. When an attacker  spoofs their identity as a valid or authorized entity, they are  often able to bypass filters and blockades against unauthorized  access. \nTampering: Any action resulting in unauthorized changes or  manipulation of data, whether in transit or in storage. \nRepudiation: The ability of a user or attacker to deny having  performed an action or activity by maintaining plausible  deniability. Repudiation attacks can also result in innocent third  parties being blamed for security violations. \nInformation disclosure: The revelation or distribution of  private, confidential, or controlled information to external or  unauthorized entities. \nDenial of service (DoS): An attack that attempts to prevent  authorized use of a resource. This can be done through flaw  exploitation, connection overloading, or traffic flooding. \nElevation of privilege: An attack where a limited user account is  transformed into an account with greater privileges, powers, and  access. \nProcess for Attack Simulation and Threat Analysis (PASTA) is a  seven-stage threat modeling methodology. PASTA is a risk-centric  approach that aims at selecting or developing countermeasures in  relation to the value of the assets to be protected. The following are  the seven steps of PASTA: \nStage I: Definition of the Objectives (DO) \nStage II: Definition of the Technical Scope (DTS) \nStage III: Application Decomposition and Analysis (ADA) \nStage IV: Threat Analysis (TA) \nStage V: Weakness and Vulnerability Analysis (WVA) \nStage VI: Attack Modeling & Simulation (AMS) \nStage VII: Risk Analysis & Management (RAM) \nEach stage of PASTA has specific objectives to achieve and  deliverables to produce in order to complete the stage. \nVisual, Agile, and Simple Threat (VAST) is a threat modeling  concept that integrates threat and risk management into an Agile  programming environment on a scalable basis (see Chapter 20, \n“Software Development Security,” regarding Agile). \nThese are just a few in the vast array of threat modeling concepts and  methodologies available from community groups, commercial  entities, government agencies, and international associations. \nBe Alert for Individual Threats \nCompetition is often a key part of business growth, but overly  adversarial competition can increase the threat level from  individuals. In addition to criminal hackers and disgruntled  employees, adversaries, contractors, employees, and even trusted  partners can be a threat to an organization if relationships go  sour. \nPotential threats to your business are broad and varied. A company  faces threats from nature, technology, and people. Always consider  the best and worst possible outcomes of your organization's  activities, decisions, and interactions. Identifying threats is the first  step toward designing defenses to help reduce or eliminate  downtime, compromise, and loss. \nDetermining and Diagramming Potential Attacks \nThe next step in threat modeling is to determine the potential attack  concepts that could be realized. This is often accomplished through  the creation of a diagram of the elements involved in a transaction,  along with indications of data flow and privilege boundaries. Figure \n1.4 shows each major component of a system, the boundaries  between security zones, and the potential flow or movement of  information and data. \nFIGURE 1.4 An example of diagramming to reveal threat concerns \nThis is a high-level overview and not a detailed evaluation of the  coding logic. However, for more complex systems, multiple diagrams  may need to be created at various focus points and at varying levels  of detail magnification. \nOnce a diagram has been crafted, identify all of the technologies  involved. Next, identify attacks that could be targeted at each  element of the diagram. Keep in mind that all forms of attacks should  be considered, including logical/technical, physical, and social. This  process will quickly lead you into the next phase of threat modeling:  reduction analysis. \nPerforming Reduction Analysis \nThe next step in threat modeling is to perform a reduction analysis. \nReduction analysis is also known as decomposing the application,  system, or environment. The purpose of this task is to gain a greater  understanding of the logic of the product, its internal components, as  well as its interactions with external elements. Whether an  application, a system, or an entire environment, it needs to be  divided into smaller containers or compartments. Those might be  subroutines, modules, or objects if you're focusing on software,  computers, or operating systems; they might be protocols if you're  focusing on systems or networks; or they might be departments,  tasks, and networks if you're focusing on an entire business  infrastructure. Each identified element should be evaluated in order  to understand inputs, processing, security, data management,  storage, and outputs. \nIn the decomposition process, you must identify five key concepts: \nTrust Boundaries Any location where the level of trust or  security changes \nDataflow Paths The movement of data between locations \nInput Points Locations where external input is received \nPrivileged Operations Any activity that requires greater  privileges than a standard user account or process typically  required to make system changes or alter security \nDetails about Security Stance and Approach The  declaration of the security policy, security foundations, and  security assumptions \nBreaking down a system into its constituent parts makes it much  easier to identify the essential components of each element as well as  take notice of vulnerabilities and points of attack. The more you  understand exactly how a program, system, or environment  operates, the easier it is to identify threats to it. \nOnce threats are identified, they should be fully documented by  defining the means, target, and consequences of a threat. Consider  including the techniques required to implement an exploitation and  list potential countermeasures and safeguards. \nPrioritization and Response \nAfter documentation, the next step is to rank or rate the threats. This  can be accomplished using a wide range of techniques, such as \nProbability × Damage Potential ranking, high/medium/low rating,  or the DREAD system. \nThe ranking technique of Probability × Damage Potential produces  a risk severity number on a scale of 1 to 100, with 100 being the most  severe risk possible. Each of the two initial values can be assigned  numbers between 1 and 10, with 1 being the lowest and 10 the  highest. These rankings can be somewhat arbitrary and subjective,  but since the same person or team will be assigning the numbers for  their own organization, it should still result in assessment values that  are accurate on a relative basis. \nThe high/medium/low (1/2/3 or green/yellow/red) rating process is  even simpler. It creates a basic risk matrix or heat map ( Figure 1.5). \nAs with any means of risk assessment, the purpose is to help  establish criticality prioritization. When using a risk matrix, each  threat can be assigned a probability and a damage potential level. \nThen, when these two values are compared, the result is a combined  value somewhere in the nine squares. Those threats in the HH (high  probability/high damage potential) area are of the highest priority  and concern, whereas those in the LL (low probability/low damage  potential) area are of the least priority and concern. \nFIGURE 1.5 A risk matrix or risk heat map \nThe Damage, Reproducibility, Exploitability, Affected Users, and \nDiscoverability (DREAD) rating system is designed to provide a  flexible rating solution that is based on the answers to five main  questions about each threat: \nDamage (potential) How severe is the damage likely to be if  the threat is realized? \nReproducibility How complicated is it for attackers to  reproduce the exploit? \nExploitability How hard is it to perform the attack? \nAffected Users How many users are likely to be affected by  the attack (as a percentage)? \nDiscoverability How hard is it for an attacker to discover the  weakness? \nOnce threat priorities are set, responses to those threats need to be  determined. Technologies and processes to remediate threats should  be considered and weighted according to their cost and effectiveness. \nResponse options should include making adjustments to software  architecture, altering operations and processes, and implementing  defensive and detection components. \nThis process is similar to the risk assessment process discussed in \nChapter 2. The difference is that threats are the focus of threat  modeling, whereas assets are often the focus of risk assessment. \nSupply Chain Risk Management \nApplying risk-based management concepts to the supply chain is a  means to ensure a more robust and successful security strategy in  organizations of all sizes. A supply chain is the concept that most  computers, devices, networks, systems, and even cloud services are  not built by a single entity. In fact, most of the companies we know of  as computer and equipment manufacturers generally perform the  final assembly rather than manufacture all the individual  components. Often, the CPU, memory, drive controllers, hard drives, \nSSDs, and video cards are created by other third-party vendors. Even  these commodity vendors are unlikely to have mined their own  metals, processed the oil for plastics, or etched the silicon of their  chips. Thus, any finished system has a long and complex history,  known as its supply chain, that enabled it to come into existence. \nSupply chain risk management (SCRM) is the means to ensure that  all of the vendors or links in the supply chain are reliable,  trustworthy, reputable organizations that disclose their practices and  security requirements to their business partners (although not  necessarily to the public). SCRM should be evaluated for every  organizational acquisition of products and services from third-party  suppliers and providers. \nEach link in a supply chain should be responsible and accountable to  the next link in the chain. Each handoff should be properly  organized, documented, managed, and audited. The goal of a secure  supply chain is to ensure that the finished product is of sufficient  quality, meets performance and operational goals, and provides  stated security mechanisms. And, at no point in the process was any  element subjected to unauthorized or malicious manipulation or  sabotage. \nWhen evaluating organizational risk, consider external factors that  can affect the organization, especially related to company stability  and resource availability. The supply chain can be a threat vector,  where materials, software, hardware, or data are being obtained  from a supposedly trusted source, but the supply chain behind that  source could have been compromised and the asset poisoned or  modified. \nAn organization's supply chain should be assessed to determine what  risks it places on the organization. Is the organization operating on a  just-in-time basis where materials are delivered just before or just as  they are needed by manufacturing? If there is any delay in delivery,  does the organization have access to any surplus or buffer of  materials that can be used to maintain production while the supply  chain operations are reconstituted? \nMost organizations rely on products manufactured by other entities. \nMost of those products are produced as part of a long and complex  supply chain. Attacks on that supply chain could result in flawed or  less reliable products or could allow for remote access or listening  mechanisms to be embedded into otherwise functioning equipment. \nSupply chain attacks include product tampering, counterfeits, and  even implants. \nSupply chain attacks present a risk that can be challenging to  address. An organization may elect to inspect all equipment in order  to reduce the chance of modified devices going into production  networks. However, with miniaturization, it may be nearly  impossible to discover an extra chip placed on a device's mainboard. \nAlso, the manipulation may be through firmware or software instead  of hardware. Organizations can choose to source products from  trusted and reputable vendors or attempt to use vendors who  manufacture most of their products domestically. \nIn many cases, ongoing security monitoring, management, and  assessment may be required. This could be an industry best practice  or a regulation. Such assessment and monitoring of a supply chain  may be performed by the primary or end-of-chain organization or  may require the use of external auditors. When engaging third-party  assessment and monitoring services, keep in mind that each element  of the supply chain entity needs to show security-mindedness in their  business operations. If an organization is unable to manage their  own operations on a secure basis, how can they provide reliable  security management functions to the supply chain? \nWhen possible, establish minimum security requirements for each  entity in a supply chain. The security requirements for new  hardware, software, or services should always meet or exceed the  security expected in the final product. This often requires a detailed  review of SLAs, contracts, and actual performance. This is to ensure  that security is a prescribed component of the contracted services. \nWhen a supply chain component provider is crafting software or  providing a service (such as a cloud provider), then a service-level  requirement (SLR) may need to be defined. Often, an SLR is  provided by the customer/client prior to the establishment of the \nSLA (which should incorporate the elements of the SLR if the vendor  expects the customer to sign the agreement). \nSCRM may require the integration of numerous security  mechanisms, including silicon root of trust, physically unclonable  functions (PUFs), and/or a software bill of materials (SBOM). \nA silicon root of trust (RoT) , also known as a hardware root of trust,  is a foundational and tamper-resistant component within a  computer's hardware that provides a secure starting point for  establishing trust and security in a system. The primary purpose of a  silicon RoT is to ensure the integrity, authenticity, and  confidentiality of the system's boot process and software. A silicon \nRoT can be an essential element of an SCRM plan. \nKey characteristics of a silicon RoT include: \nTamper resistance: The silicon RoT is typically implemented in  a way that makes it extremely difficult to tamper with or  compromise. This may involve using dedicated hardware  security modules, secure enclaves, or other techniques to protect  it from physical and software attacks. \nSecure boot: A silicon RoT supports a secure boot process. It  verifies the integrity of the firmware, bootloader, and operating  system during the boot sequence to ensure that no unauthorized  or malicious code is executed. \nCryptographic operations: The silicon RoT typically has built-in  cryptographic capabilities, allowing it to perform operations  such as digital signatures, encryption, and decryption. This is  essential for securing data, establishing secure communications,  and authenticating the system. \nRemote attestation: Many silicon RoTs support remote  attestation, which enables a remote entity to verify the  trustworthiness of a system. This is crucial for cloud computing  and IoT devices. \nSilicon roots of trust are fundamental in building secure systems,  particularly in environments where the integrity of the hardware and  software is critical, such as data centers, cloud computing, and \nInternet of Things (IoT) devices. They provide a solid foundation for  security by ensuring that the system starts in a known, trusted state  and can maintain that trust throughout its operation. \nA physically unclonable function (PUF) is a specialized physical  electronic component or function that generates a unique,  unpredictable digital identifier based on the inherent physical  properties of the component. PUFs are used to provide a hardware-  based security feature by creating a unique fingerprint for electronic  devices or integrated circuits. This fingerprint can be used for device  authentication, encryption keys, or other security-related purposes. \nPUFs have gained prominence in the field of hardware security and  have applications in various domains, including IoT devices,  hardware-based cryptography, secure boot processes, and  authentication of integrated circuits. PUF components prevent  counterfeits or implants along a supply chain, therefore establishing  a more secure SCRM. \nA software bill of materials (SBOM) is a structured and  comprehensive inventory or list of all the software components and  dependencies that make up a software application or system. An \nSBOM provides detailed information about the various software  components used in a system, including their versions, sources, and  relationships. The primary purpose of an SBOM is to enhance  software transparency, security, compliance, and management. \nSBOMs play a vital role in software security, particularly in  identifying and addressing vulnerabilities and risks associated with  the software components. Security teams can use SBOMs to track  and address known vulnerabilities and apply patches or updates as  needed. In the context of software supply chain management, \nSBOMs help organizations track the origins and sources of software  components, ensuring that they come from trusted and secure  sources. \nSBOMs are becoming increasingly important as software ecosystems  grow in complexity, and organizations rely on a multitude of  software components from various sources. They aid in managing  software supply chains, improving security, and ensuring compliance  with legal and regulatory requirements. In some cases, SBOMs may  also be used to provide information to users, customers, and  stakeholders about the software components used in a particular  product or system. \nNumerous security elements can be incorporated into an SCRM plan. \nNot all of these may be relevant to every organization. However,  most organizations would benefit from integrating some or all of  these security features into their existing supply chain management  processes. \nSummary \nSecurity governance, management concepts, and principles are  inherent elements in a security policy and in solution deployment. \nThey define the basic parameters needed for a secure environment. \nThey also define the goals and objectives that both policy designers  and system implementers must achieve in order to create a secure  solution. \nThe primary goals and objectives of security are contained within the \nCIA Triad: confidentiality, integrity, and availability. Confidentiality  is the principle that objects are not disclosed to unauthorized  subjects. Integrity is the principle that objects retain their veracity  and are intentionally modified only by authorized subjects. \nAvailability is the principle that authorized subjects are granted  timely and uninterrupted access to objects. \nOther security-related concepts and principles that should be  considered and addressed when designing a security policy and  deploying a security solution are identification, authentication,  authorization, accounting, auditing, nonrepudiation, defense in  depth, abstraction, data hiding, and encryption. \nSecurity roles determine who is responsible for the security of an  organization's assets. Common roles include senior manager,  security professionals, asset owners, custodians, users, and auditors. \nA formalized security policy structure consists of policies, standards,  baselines, guidelines, and procedures. These individual documents  are elements essential to the design and implementation of security  in any environment. To be effective, the approach to security  management must be a top-down approach. \nSecurity control frameworks are structured sets of guidelines,  standards, best practices, and controls designed to help  organizations effectively manage and enhance their information  security and cybersecurity posture. Entities and examples of SCFs  include ISO, NIST, COBIT, SABSA, PCI DSS, FedRAMP, and ITIL. \nThreat modeling is the security process where potential threats are  identified, categorized, and analyzed. Threat modeling can be  performed as a proactive measure during design and development or  as a reactive measure once a product has been deployed. In either  case, the process identifies the potential harm, the probability of  occurrence, the priority of concern, and the means to eradicate or  reduce the threat. \nIntegrating cybersecurity risk management with supply chain,  acquisition strategies, and business practices is a means to ensure a  more robust and successful security strategy in organizations of all  sizes. When purchases are made without security considerations, the  risks inherent in those products remain throughout their deployment  life span. \nStudy Essentials \nUnderstand the CIA Triad elements of confidentiality,  integrity, and availability. Confidentiality is the principle that  objects are not disclosed to unauthorized subjects. Integrity is the  principle that objects retain their veracity and are intentionally  modified only by authorized subjects. Availability is the principle  that authorized subjects are granted timely and uninterrupted access  to objects. \nKnow the elements of AAA services. AAA services focus on  identification, authentication, authorization, auditing, and  accounting. \nBe able to explain how identification works. Identification is  when a subject professes an identity and accounting is initiated. A  subject must provide an identity to a system to start the process of  authentication, authorization, and accounting. \nUnderstand the process of authentication. Authentication is  the process of verifying or testing that a claimed identity is valid. \nAuthentication requires information from the subject that must  exactly correspond to the identity indicated. \nKnow how authorization fits into a security plan. Once a  subject is authenticated, its access must be authorized. The process  of authorization ensures that the requested activity or object access is  possible given the rights and privileges assigned to the authenticated  identity. \nBe able to explain the auditing process. Auditing is the  programmatic means by which subjects are held accountable for  their actions while authenticated on a system through the  documentation or recording of subject activities. \nUnderstand the importance of accounting. Security can be  maintained only if subjects are held accountable for their actions. \nEffective accounting relies on the capability to prove a subject's  identity and track their activities. \nBe able to explain the concept of abstraction. Abstraction is  used to collect similar elements into groups, classes, or roles that are  assigned security controls, restrictions, or permissions as a collective. \nIt adds efficiency to carrying out a security plan. \nKnow about security boundaries. A security boundary is the  line of intersection between any two areas, subnets, or environments  that have different security requirements or needs. \nUnderstand security governance. Security governance is the  collection of practices related to supporting, defining, and directing  the security efforts of an organization. \nKnow about third-party governance. Third-party governance  is the system of external entity oversight that may be mandated by  law, regulation, industry standards, contractual obligation, or  licensing requirements. The actual method of governance may vary,  but it generally involves an outside investigator or auditor. \nUnderstand documentation review. Documentation review is  the process of reading the exchanged materials and verifying them  against standards and expectations. In many situations, especially  those related to government or military agencies or contractors,  failing to provide sufficient documentation to meet requirements of  third-party governance can result in a loss of or a voiding of  authorization to operate (ATO). \nUnderstand the alignment of security function to business  strategy, goals, mission, and objectives. Security  management planning ensures the proper creation, implementation,  and enforcement of a security policy . Security management planning  aligns the security functions to the strategy, goals, mission, and  objectives of the organization. This includes designing and  implementing security based on business cases, budget restrictions,  or scarcity of resources. \nKnow what a business case is. A business case is usually a  documented argument or stated position in order to define a need to  make a decision or take some form of action. To make a business  case is to demonstrate a business-specific need to alter an existing  process or choose an approach to a business task. A business case is  often made to justify the start of a new project, especially a project  related to security. \nUnderstand security management planning. Security  management is based on three types of plans: strategic, tactical, and  operational. A strategic plan is a long-term plan that is fairly stable. \nIt defines the organization's goals, mission, and objectives. The  tactical plan is a midterm plan developed to provide more details on  accomplishing the goals set forth in the strategic plan. Operational  plans are short-term and highly detailed plans based on strategic and  tactical plans. \nKnow the elements of a formalized security policy  structure. To create a comprehensive security plan, you need the  following items in place: security policy, standards, baselines,  guidelines, and procedures. \nUnderstand key security roles. The primary security roles are  senior manager, security professional, asset owner, custodian, user,  and auditor. \nUnderstand due diligence and due care. Due diligence is  establishing a plan, policy, and process to protect the interests of an  organization. Due care is practicing the individual activities that  maintain the due diligence effort. Due diligence is knowing what  should be done and planning for it; due care is doing the right action  at the right time. \nKnow the basics of threat modeling. Threat modeling is the  security process where potential threats are identified, categorized,  and analyzed. Threat modeling can be performed as a proactive  measure during design and development or as a reactive measure  once a product has been deployed. Key concepts include  assets/attackers/software, STRIDE, PASTA, VAST, diagramming,  reduction/decomposing, and DREAD. \nUnderstand supply chain risk management (SCRM)  concepts. SCRM is a means to ensure that all the vendors or links  in the supply chain are reliable, trustworthy, reputable organizations  that disclose their practices and security requirements to their  business partners. SCRM includes evaluating risks associated with  hardware, software, and services; performing third-party assessment  and monitoring; establishing minimum security requirements; and  enforcing service-level requirements. \nWritten Lab \n1. Discuss and describe the CIA Triad. \n2. What are the requirements to hold a person accountable for the  actions of their user account? \n3. Name the six primary security roles as defined by ISC2 for \nCISSP. \n4. What are the four components of a complete organizational  security policy and their basic purpose? \nReview Questions \n1. Confidentiality, integrity, and availability are typically viewed as  the primary goals and objectives of a security infrastructure. \nWhich of the following is not considered a violation of  confidentiality? \nA. Stealing passwords using a keystroke logging tool \nB. Eavesdropping on wireless network communications \nC. Hardware destruction caused by arson \nD. Social engineering that tricks a user into providing personal  information to a false website \n2. Security governance requires a clear understanding of the  objectives of the organization as the core concepts of security. \nWhich of the following contains the primary goals and objectives  of security? \nA. A network's border perimeter \nB. The CIA Triad \nC. AAA services \nD. Ensuring that subject activities are recorded \n3. Jamie recently discovered an attack taking place against his  organization that prevented employees from accessing critical  records. What element of the CIA Triad was violated? \nA. Identification \nB. Availability \nC. Encryption \nD. Layering \n4. Optimally, security governance is performed by a board of  directors, but smaller organizations may simply have the CEO or \nCISO perform the activities of security governance. Which of the  following is true about security governance? \nA. Security governance ensures that the requested activity or  access to an object is possible, given the rights and  privileges assigned to the authenticated identity. \nB. Security governance is used for efficiency. Similar elements  are put into groups, classes, or roles that are assigned  security controls, restrictions, or permissions as a collective. \nC. Security governance is a documented set of best IT security  practices that prescribes goals and requirements for  security controls and encourages the mapping of IT security  ideals to business objectives. \nD. Security governance seeks to compare the security  processes and infrastructure used within the organization  with knowledge and insight obtained from external sources. \n5. You have been tasked with crafting a long-term security plan  that is fairly stable. It needs to define the organization's security  purpose. It also needs to define the security function and align it  with the goals, mission, and objectives of the organization. What  are you being asked to create? \nA. Tactical plan \nB. Operational plan \nC. Strategic plan \nD. Rollback plan \n6. Annaliese's organization is undergoing a period of increased  business activity where they are conducting a large number of  mergers and acquisitions. She is concerned about the risks  associated with those activities. Which of the following are  examples of those risks? (Choose all that apply.) \nA. Inappropriate information disclosure \nB. Increased worker compliance \nC. Data loss \nD. Downtime \nE. Additional insight into the motivations of inside attackers \nF. Failure to achieve a sufficient return on investment (ROI) \n7. Which security control framework is a set of security standards  and requirements designed to ensure the protection of sensitive  credit card and debit card information? \nA. ITIL \nB. ISO 27000 \nC. PCI DSS \nD. CSF \n8. A security role is the part an individual plays in the overall  scheme of security implementation and administration within  an organization. What is the security role that has the functional  responsibility for security, including writing the security policy  and implementing it? \nA. Senior management \nB. Security professional \nC. Custodian \nD. Auditor \n9. Control Objectives for Information and Related Technologies \n(COBIT) is a documented set of best IT security practices crafted  by ISACA. It prescribes goals and requirements for security  controls and encourages the mapping of IT security ideals to  business objectives. COBIT is based on six key principles for the  governance and management of enterprise IT. Which of the  following are among these key principles? (Choose all that  apply.) \nA. Holistic Approach \nB. End-to-End Governance System \nC. Provide Stakeholder Value \nD. Maintaining Authenticity and Accountability \nE. Dynamic Governance System \n10. In today's business environment, prudence is mandatory. \nShowing due diligence and due care is the only way to disprove  negligence in an occurrence of loss. Which of the following are  true statements? (Choose all that apply.) \nA. Due diligence is establishing a plan, policy, and process to  protect the interests of an organization. \nB. Due care is developing a formalized security structure  containing a security policy, standards, baselines,  guidelines, and procedures. \nC. Due diligence is the continued application of a security  structure onto the IT infrastructure of an organization. \nD. Due care is practicing the individual activities that maintain  the security effort. \nE. Due care is knowing what should be done and planning for  it. \nF. Due diligence is doing the right action at the right time. \n11. Security documentation is an essential element of a successful  security program. Understanding the components is an early  step in crafting the security documentation. Match the following  components to their respective definitions. \n1. Policy \n2. Standard \n3. Procedure \n4. Guideline \nI. A detailed, step-by-step how-to document that describes the  exact actions necessary to implement a specific security  mechanism, control, or solution. \nII. A document that defines the scope of security needed by the  organization and discusses the assets that require  protection and the extent to which security solutions should  go to provide the necessary protection. \nIII. A minimum level of security that every system throughout  the organization must meet. \nIV. Offers recommendations on how security requirements are  implemented and serves as an operational guide for both  security professionals and users. \nV. Defines compulsory requirements for the homogenous use  of hardware, software, technology, and security controls. \nA. 1 – I; 2 – IV; 3 – II; 4 – V \nB. 1 – II; 2 – V; 3 – I; 4 – IV \nC. 1 – IV; 2 – II; 3 – V; 4 – I \nD. 1 – V; 2 – I; 3 – IV; 4 – III \n12. STRIDE is often used in relation to assessing threats against  applications or operating systems. When confidential  documents are exposed to unauthorized entities, which element  of STRIDE is used to reference that violation? \nA. S \nB. T \nC. R \nD. I \nE. D \nF. E \n13. A development team is working on a new project. During the  early stages of systems development, the team considers the  vulnerabilities, threats, and risks of their solution and integrates  protections against unwanted outcomes. What concept of threat  modeling is this? \nA. Threat hunting \nB. Proactive approach \nC. Qualitative approach \nD. Adversarial approach \n14. Supply chain risk management (SCRM) is a means to ensure  that all the vendors or links in the supply chain are reliable,  trustworthy, reputable organizations. Which of the following are  true statements? (Choose all that apply.) \nA. Each link in the supply chain should be responsible and  accountable to the next link in the chain. \nB. Commodity vendors are unlikely to have mined their own  metals, processed the oil for plastics, or etched the silicon of  their chips. \nC. If the final product derived from a supply chain meets  expectations and functional requirements, it is assured to  not have unauthorized elements. \nD. Failing to properly secure a supply chain can result in  flawed or less reliable products, or even embedded listing or  remote control mechanisms. \n15. Your organization has become concerned with risks associated  with the supply chain of their retail products. Fortunately, all  coding for their custom product is done in-house. However, a  thorough audit of a recently completed product revealed that a  listening mechanism was integrated into the solution  somewhere along the supply chain. The identified risk is  associated with what product component in this scenario? \nA. Software \nB. Services \nC. Data \nD. Hardware \n16. Cathy's employer has asked her to perform a documentation  review of the policies and procedures of a third-party supplier. \nThis supplier is just the final link in a software supply chain. \nTheir components are being used as a key element of an online  service operated for high-end customers. Cathy discovers several  serious issues with the vendor, such as failing to require  encryption for all communications and not requiring multifactor  authentication on management interfaces. What should Cathy  do in response to this finding? \nA. Write up a report and submit it to the CIO. \nB. Void the ATO of the vendor. \nC. Require that the vendor review their terms and conditions. \nD. Have the vendor sign an NDA. \n17. Whenever your organization works with a third party, its supply  chain risk management (SCRM) processes should be applied. \nOne of the common requirements is the establishment of  minimum security requirements for the third party. What  should these requirements be based on? \nA. Existing security policy \nB. Third-party audit \nC. On-site assessment \nD. Vulnerability scan results \n18. It's common to pair threats with vulnerabilities to identify  threats that can exploit assets and represent significant risks to  the organization. The ultimate goal of threat modeling is to  prioritize the potential threats against an organization's valuable  assets. Which of the following is a risk-centric threat-modeling  approach that aims at selecting or developing countermeasures  in relation to the value of the assets to be protected? \nA. VAST \nB. DREAD \nC. PASTA \nD. STRIDE \n19. The next step after threat modeling is reduction analysis. \nReduction analysis is also known as decomposing the  application, system, or environment. The purpose of this task is  to gain a greater understanding of the logic of the product, its  internal components, as well as its interactions with external  elements. Which of the following are key components to identify  when performing decomposition? (Choose all that apply.) \nA. Patch or update versions \nB. Trust boundaries \nC. Dataflow paths \nD. Open vs. closed source code use \nE. Input points \nF. Privileged operations \nG. Details about security stance and approach \n20. Defense in depth is the use of multiple controls in a series. No  one control can protect against all possible threats. Using a  multilayered solution allows for numerous different controls to  guard against whatever threats come to pass. Which of the  following are terms that relate to or are based on defense in  depth? (Choose all that apply.) \nA. Layering \nB. Classifications \nC. Zones \nD. Realms \nE. Compartments \nF. Silos \nG. Segmentations \nH. Lattice structure \nI. Protection rings ",
  "elements": {
    "summaries": [
      "Security governance, management concepts, and principles are inherent elements in a security policy and in solution deployment. They define the basic parameters needed for a secure environment. They also define the goals and objectives that both policy designers and system implementers must achieve in order to create a secure solution. The primary goals and objectives of security are contained within the CIA Triad: confidentiality, integrity, and availability. Confidentiality is the principle that objects are not disclosed to unauthorized subjects. Integrity is the principle that objects retain their veracity and are intentionally modified only by authorized subjects. Availability is the principle that authorized subjects are granted timely and uninterrupted access to objects. Other security-related concepts and principles that should be considered and addressed when designing a security policy and deploying a security solution are identification, authentication, authorization, accounting, auditing, nonrepudiation, defense in depth, abstraction, data hiding, and encryption. Security roles determine who is responsible for the security of an organization's assets. Common roles include senior manager, security professionals, asset owners, custodians, users, and auditors. A formalized security policy structure consists of policies, standards, baselines, guidelines, and procedures. These individual documents are elements essential to the design and implementation of security in any environment. To be effective, the approach to security management must be a top-down approach. Security control frameworks are structured sets of guidelines, standards, best practices, and controls designed to help organizations effectively manage and enhance their information security and cybersecurity posture. Entities and examples of SCFs include ISO, NIST, COBIT, SABSA, PCI DSS, FedRAMP, and ITIL. Threat modeling is the security process where potential threats are identified, categorized, and analyzed. Threat modeling can be performed as a proactive measure during design and development or as a reactive measure once a product has been deployed. In either case, the process identifies the potential harm, the probability of occurrence, the priority of concern, and the means to eradicate or reduce the threat. Integrating cybersecurity risk management with supply chain, acquisition strategies, and business practices is a means to ensure a more robust and successful security strategy in organizations of all sizes. When purchases are made without security considerations, the risks inherent in those products remain throughout their deployment life span. Study Essentials Understand the CIA Triad elements of confidentiality, integrity, and availability. Confidentiality is the principle that objects are not disclosed to unauthorized subjects. Integrity is the principle that objects retain their veracity and are intentionally modified only by authorized subjects. Availability is the principle that authorized subjects are granted timely and uninterrupted access to objects. Know the elements of AAA services. AAA services focus on identification, authentication, authorization, auditing, and accounting. Be able to explain how identification works. Identification is when a subject professes an identity and accounting is initiated. A subject must provide an identity to a system to start the process of authentication, authorization, and accounting. Understand the process of authentication. Authentication is the process of verifying or testing that a claimed identity is valid. Authentication requires information from the subject that must exactly correspond to the identity indicated. Know how authorization fits into a security plan. Once a subject is authenticated, its access must be authorized. The process of authorization ensures that the requested activity or object access is possible given the rights and privileges assigned to the authenticated identity. Be able to explain the auditing process. Auditing is the programmatic means by which subjects are held accountable for their actions while authenticated on a system through the documentation or recording of subject activities. Understand the importance of accounting. Security can be maintained only if subjects are held accountable for their actions. Effective accounting relies on the capability to prove a subject's identity and track their activities. Be able to explain the concept of abstraction. Abstraction is used to collect similar elements into groups, classes, or roles that are assigned security controls, restrictions, or permissions as a collective. It adds efficiency to carrying out a security plan. Know about security boundaries. A security boundary is the line of intersection between any two areas, subnets, or environments that have different security requirements or needs. Understand security governance. Security governance is the collection of practices related to supporting, defining, and directing the security efforts of an organization. Know about third-party governance. Third-party governance is the system of external entity oversight that may be mandated by law, regulation, industry standards, contractual obligation, or licensing requirements. The actual method of governance may vary, but it generally involves an outside investigator or auditor. Understand documentation review. Documentation review is the process of reading the exchanged materials and verifying them against standards and expectations. In many situations, especially those related to government or military agencies or contractors, failing to provide sufficient documentation to meet requirements of third-party governance can result in a loss of or a voiding of authorization to operate (ATO). Understand the alignment of security function to business strategy, goals, mission, and objectives. Security management planning ensures the proper creation, implementation, and enforcement of a security policy . Security management planning aligns the security functions to the strategy, goals, mission, and objectives of the organization. This includes designing and implementing security based on business cases, budget restrictions, or scarcity of resources. Know what a business case is. A business case is usually a documented argument or stated position in order to define a need to make a decision or take some form of action. To make a business case is to demonstrate a business-specific need to alter an existing process or choose an approach to a business task. A business case is often made to justify the start of a new project, especially a project related to security. Understand security management planning. Security management is based on three types of plans: strategic, tactical, and operational. A strategic plan is a long-term plan that is fairly stable. It defines the organization's goals, mission, and objectives. The tactical plan is a midterm plan developed to provide more details on accomplishing the goals set forth in the strategic plan. Operational plans are short-term and highly detailed plans based on strategic and tactical plans. Know the elements of a formalized security policy structure. To create a comprehensive security plan, you need the following items in place: security policy, standards, baselines, guidelines, and procedures. Understand key security roles. The primary security roles are senior manager, security professional, asset owner, custodian, user, and auditor. Understand due diligence and due care. Due diligence is establishing a plan, policy, and process to protect the interests of an organization. Due care is practicing the individual activities that maintain the due diligence effort. Due diligence is knowing what should be done and planning for it; due care is doing the right action at the right time. Know the basics of threat modeling. Threat modeling is the security process where potential threats are identified, categorized, and analyzed. Threat modeling can be performed as a proactive measure during design and development or as a reactive measure once a product has been deployed. Key concepts include assets/attackers/software, STRIDE, PASTA, VAST, diagramming, reduction/decomposing, and DREAD. Understand supply chain risk management (SCRM) concepts. SCRM is a means to ensure that all the vendors or links in the supply chain are reliable, trustworthy, reputable organizations that disclose their practices and security requirements to their business partners. SCRM includes evaluating risks associated with hardware, software, and services; performing third-party assessment and monitoring; establishing minimum security requirements; and enforcing service-level requirements."
    ],
    "reviewQuestions": [],
    "writtenLabs": []
  }
}