{
  "id": "chapter_2",
  "content": "\nChapter 2 \nPersonnel Security and Risk Management \nConcepts \nTHE CISSP TOPICS COVERED IN THIS CHAPTER \nINCLUDE: \nDomain 1.0: Security and Risk Management \n1.8 Contribute to and enforce personnel security policies  and procedures \n1.8.1 Candidate screening and hiring \n1.8.2 Employment agreements and policy driven  requirements \n1.8.3 Onboarding, transfers, and termination  processes \n1.8.4 Vendor, consultant, and contractor agreements  and controls \n1.9 Understand and apply risk management concepts \n1.9.1 Threat and vulnerability identification \n1.9.2 Risk analysis, assessment, and scope \n1.9.3 Risk response and treatment (e.g., cybersecurity  insurance) \n1.9.4 Applicable types of controls (e.g., preventive,  detection, corrective) \n1.9.5 Control assessments (e.g., security and privacy) \n1.9.6 Continuous monitoring and measurement \n1.9.7 Reporting (e.g., internal, external) \n1.9.8 Continuous improvement (e.g., risk maturity  modeling) \n1.9.9 Risk frameworks (e.g., International \nOrganization for Standardization (ISO), National \nInstitute of Standards and Technology (NIST), \nControl Objectives for Information and Related \nTechnology (COBIT), Sherwood Applied Business \nSecurity Architecture (SABSA), Payment Card \nIndustry (PCI)) \n1.12 Establish and maintain a security awareness,  education, and training program \n1.12.1 Methods and techniques to present awareness  and training (e.g., social engineering, phishing,  security champions, gamification) \n1.12.2 Periodic content reviews to include emerging  technologies and trends (e.g., cryptocurrency,  artificial intelligence (Al), blockchain) \n1.12.3 Program effectiveness evaluation \nAdditional elements of this domain are discussed in various  chapters: \nChapter 1, “Security Governance Through Principles and \nPolicies” \nChapter 3, “Business Continuity Planning” \nChapter 4, “Laws, Regulations, and Compliance” \nPlease review all of these chapters to have a complete perspective on  the topics of this domain. \nPersonnel Security Policies and Procedures \nHumans are often considered the weakest element in any security  solution. No matter what physical or logical controls are deployed,  humans can discover ways to avoid, circumvent, subvert, or disable  them. Thus, it is important to consider your users' humanity when  designing and deploying security solutions for your environment. To  understand and apply security governance, you must address the  potentially weakest link in your security chain—people. \nHowever, people can also become a key security asset when they are  properly trained and motivated to protect not only themselves but  the security of the organization. It is important to not treat personnel  as a problem to be solved, but as people who can become valued  partners in a security endeavor. \nIssues, problems, and compromises related to humans occur at all  stages of a security solution development. This is because humans  are involved throughout any solution's development, deployment,  and ongoing management. Therefore, you must evaluate the effect  users, designers, programmers, developers, managers, vendors,  consultants, and implementers have on the process. \nJob Descriptions and Responsibilities \nHiring new staff typically involves several distinct steps: creating a  job description or position description , setting a classification for the  job, screening employment candidates, and hiring and training  someone best suited for the job. Without a job description, there is  no consensus on what type of individual should be hired. Any job  description for any position within an organization should address  relevant security issues, such as whether the position requires  handling sensitive material or access to classified information. In  effect, the job description defines the roles to which an employee  needs to be assigned to perform their work tasks. Job roles typically  align to a rank or level of privilege, whereas job descriptions map to  specifically assigned responsibilities and tasks. \nJob responsibilities are the specific work tasks an employee is  required to perform regularly. Employees require access to various  objects, resources, and services depending on their responsibilities. \nJob responsibilities should be detailed in a job description. Thus, a  list of job responsibilities guides the assignment of access rights,  permissions, and privileges. On a secured network, users must be  granted access privileges for those elements related to their work  tasks. \nJob descriptions are not used exclusively for the hiring process; they  should be maintained throughout the organization's life. Only  through detailed job descriptions can a comparison be made between  what a person should be responsible for and what they actually are  responsible for. Managers should audit privilege assignments to  ensure that workers do not obtain access that is not strictly required  for them to accomplish their work tasks. \nCandidate Screening and Hiring \nEmployment candidate screening for a specific position is based on  the sensitivity and classification defined by the job description. Thus,  the thoroughness of the screening process should reflect the security  of the position to be filled. \nEmployment candidate screening, background checks, reference  checks, education verification, and security clearance validation are  essential elements in proving that a candidate is adequate, qualified,  and trustworthy for a secured position. Background checks include  obtaining a candidate's work and educational history; checking  references; verifying education; interviewing colleagues; checking  police and government records for arrests or illegal activities;  verifying identity through fingerprints, driver's license, and/or birth  certificate; and holding a personal interview. Depending on the job  position, this process could also include skill challenges, drug testing,  credit checks, checking driving records, and personality  testing/evaluation. \nPerforming online background checks and reviewing the social  networking accounts of applicants has become standard practice for  many organizations. If a potential employee has posted  inappropriate materials online, then they are not as promising a  candidate as those who did not. A general picture of a person's  attitude, intelligence, loyalty, common sense, diligence, honesty,  respect, consistency, and adherence to social norms and/or  corporate culture can be gleaned quickly by viewing a person's online  identity. However, being fully aware of the legal restrictions against  discrimination is essential. Various countries have vastly different  freedoms or limitations on background checks, especially criminal  history research. Always confirm with your legal department before  evaluating an applicant's online persona. \nDuring the initial applicant review process, the human resources \n(HR) staff are looking to confirm that a candidate is appropriately  qualified for a job, but they are also on the lookout for issues that  would disqualify the applicant. \nInterviewing qualified applicants is the next filter to eliminate those  not suited for the job or the organization. When conducting  interviews, it is important to have a standardized interview process  in order to treat each candidate fairly. Although some aspects of an  interview are subjective and based on the interplay of personalities of  the candidates and the interviewer, the decision whether or not to  hire someone needs to be legally defensible. \nOnboarding: Employment Agreements and Policy-Driven \nRequirements \nOnce a qualified but not-disqualified candidate is found and  interviewed, they can be offered the job. If accepted, the new hire will  need to be integrated into the organization. This process is known as  onboarding . As with all tasks within a security-focused organization,  the process of onboarding should be guided by policy-driven  requirements. \nOnboarding is the process of adding new employees to the  organization, having them review and sign employment agreements  and policies, be introduced to managers and coworkers, and be  trained in employee operations and logistics. Onboarding can also  include organizational socialization and orientation. This is the  process by which new employees are trained in order to be properly  prepared for performing their job responsibilities. It can include  training, job skill acquisition, and behavioral adaptation in an effort  to integrate employees efficiently into existing organizational culture,  processes, and procedures. Well-designed onboarding can result in  higher levels of job satisfaction, higher levels of productivity, faster  integration with existing workers, a rise in organizational loyalty,  stress reduction, and a decreased resignation rate. \nA new employee will often be provided with a computer/network  user account. This is accomplished through the identity and access  management (IAM) system of an organization, which will provision  the account and assign necessary privileges and access. The  onboarding process is also used when an employee's role or position  changes or when that person is awarded additional levels of privilege  or access. \nTo maintain security, access should be assigned according to the  principle of least privilege. The principle of least privilege states that  users should be granted the minimum amount of access necessary  for them to complete their required work tasks or job  responsibilities. True application of this principle requires low-level  granular control over all resources and functions. Further discussion  of least privilege is in Chapter 16, “Managing Security Operations.” \nWhen a new employee is hired, they should sign an employment  agreement. Such a document outlines the rules and restrictions of  the organization, the security policy, details of the job description,  violations and consequences, and the minimum or probationary  length of time the position is to be filled by the employee. These  items might be separate documents, such as an acceptable use policy \n(AUP). In such a case, the employment agreement is used to verify  that the employment candidate has read and understood the  associated documentation and signed their agreement to adhere to  the necessary policies related to their prospective job position. \nAn acceptable use policy (AUP) defines what is and  what is not an acceptable activity, practice, or use for company  equipment and resources. The AUP is specifically designed to  assign security roles within the organization as well as prescribe  the responsibilities tied to those roles. This policy defines a level  of acceptable performance and expectations of behavior and  activity. Failure to comply with the policy may result in job action  warnings, penalties, or termination. \nIn addition to employment agreements, there may be other security-  related documentation and policy-driven requirements that must be  addressed. One common document is a nondisclosure agreement \n(NDA) . An NDA is used to protect confidential information within an  organization from being disclosed by a current or former employee. \nViolations of an NDA are often met with strict penalties. Throughout  a worker's employment, they may be asked to sign additional NDAs  as their job responsibilities change and they need to access new  sensitive, proprietary, or confidential assets. When an employee  leaves the organization, they should be reminded of their legal  obligation to maintain silence on all items covered by any signed \nNDAs. In fact, they may be required to re-sign the NDA upon  departure as a means to legally confirm that they are fully aware of  their legally recognized obligation to maintain trade secrets and  other confidential information. \nThere are several forms of NDA to be aware of. A unilateral NDA,  also known as a one-way NDA, is used when one party needs to share  sensitive information with another party while retaining control and  protection over that information. A bilateral NDA (aka mutual NDA  or two-way NDA) is a legally binding contract between two parties,  often individuals or organizations, where both parties agree to  protect each other's confidential information. A multilateral NDA is a  legal contract involving three or more parties, each of whom agrees  to protect and keep confidential the sensitive information shared by  the other parties. \nAnother potential element of an employment contract is a non-  compete agreement (NCA). A non-compete agreement, often called a  non-compete clause or covenant not to compete (CNC), is a legal  contract between an employer and an employee, a business and an  independent contractor, or between business partners. The primary  purpose of a non-compete agreement is to restrict the ability of one  party (usually the employee or business partner) from engaging in  competitive activities or working for a competing entity, typically  within a specific geographical area and for a defined duration, after  the termination of their relationship with the other party. Non-  compete agreements are common in various industries to protect a  business's interests, trade secrets, and client relationships. However,  their enforceability can vary by jurisdiction, and there are often legal  restrictions on the extent to which non-compete agreements can be  applied, as they must strike a reasonable balance between protecting  a business's legitimate interests and an individual's right to pursue  their livelihood. Before entering into or enforcing a non-compete  agreement, seeking legal counsel to ensure that it complies with  applicable laws and regulations in a specific jurisdiction is advisable. \nEmployee Oversight \nThroughout the employment lifetime of personnel, managers should  regularly review or audit the job descriptions, work tasks, privileges,  and responsibilities for every staff member. It is common for work  tasks and privileges to drift over time. Drifting job responsibilities or  privilege creep can also result in security violations. Excess privileges  held by a worker represent an increased risk to the organization. \nThat risk includes the greater chance for mistakes to damage asset  confidentiality, integrity, and availability (CIA) outside of the  worker's actual responsibilities, greater ability for a disgruntled  worker to cause harm on purpose, and greater ability for an attack  that takes over a worker's account to cause harm. Reviewing and  then adjusting user capabilities to realign with the principle of least  privilege is a risk-reduction strategy. \nFor some organizations, mostly those in the financial industry, a key  part of this review process is enforcing mandatory vacations. \nMandatory vacations are used as a peer review process. This process  requires a worker to be away from the office and without remote  access for one to two weeks per year. While the worker is on \n“vacation,” a different worker (i.e., an auditor) performs the work  duties (potentially with the same account), which makes it easier to  verify the work tasks and privileges of workers while attempting to  detect abuse, fraud, or negligence. This does not mean that  passwords are shared. Mandatory vacation auditing could be  implemented by redefining the target worker's account's password  for the auditor, then redefining the password again when the worker  returns. Or another account could be created for the auditor with the  same access, permissions, and privileges as the worker's. \nOther user and worker management and evaluation techniques  include separation of duties, job rotation, and cross-training. These  concepts are discussed in Chapter 16. \nWhen several people work together to perpetrate a crime, it's called  collusion . Employing the principles of separation of duties, restricted  job responsibilities, mandatory vacations, job rotation, and cross-  training reduces the likelihood that a coworker will be willing to  collaborate on an illegal or abusive scheme because of the higher risk  of detection, reporting, or whistleblowing. Collusion and other  privilege abuses can also be reduced through strict monitoring of  special privileges and privileged accounts, such as those of an  administrator, root, and others. \nFor many job positions that are considered sensitive or critical,  especially in medical, financial, government, and military  organizations, periodic revaluation of employees may be needed. \nThis could be a process that is just as thorough as the original  background check and investigation performed when the individual  was hired, or it may require performing only a few specific checks to  confirm consistency in the person's qualifications as well as  researching for any new information regarding disqualifications. \nUser behavior analytics (UBA) and user and entity behavior  analytics (UEBA) are the concepts of analyzing the behavior of users,  subjects, visitors, customers, and so forth for some specific goal or  purpose. The E in UEBA extends the analysis to include entity  activities (i.e., devices, systems, networks, and applications) that take  place but that are not necessarily directly linked or tied to a user's  specific actions, but that can still correlate to a vulnerability,  reconnaissance, intrusion, breach, or exploit occurrence. \nInformation collected from UBA/UEBA monitoring can be used to  improve personnel security policies, procedures, training, and  related security oversight programs. \nOffboarding, Transfers, and Termination Processes \nOffboarding is the reverse of the onboarding process. Offboarding is  the removal of an employee's identity from the IAM system once that  person has left the organization. But offboarding can also be an  element used when an employee transfers to a new position at the  same organization, especially when shifting between departments,  facilities, or geographic locations. Personnel transfers may be treated  as a termination/rehire rather than a personnel move. This depends  on the organization's policies and the means they have determined to  best manage this change. Some of the elements that go into making  the decision as to which procedure to use include whether the same  user account will be retained, if their clearance will be adjusted, if  their new work responsibilities are similar to the previous position,  and if a “clean slate” account is required for auditing purposes in the  new job position. \nWhen a full offboarding is going to occur, whether as part of a  termination/rehire transfer, a retirement, or a termination, this can  include disabling and/or deleting the user account, revoking  certificates, canceling access codes, and terminating other  specifically granted privileges. It is common to deactivate the  accounts of prior employees in order to retain the identity for  auditing purposes for a few months. After the allotted time, if no  incidents are discovered regarding the former employee's account, it  can be deleted from the IAM completely. If the account is deleted  prematurely, any logged events that are of a security concern no  longer point to an actual account and thus can make tracking down  further evidence of violations more complicated. \nAn internal employee transfer should not be used to  move a problem employee into a different department rather  than firing them. Consider the overall 5 Pillars of Information \nSecurity and benefit to the organization; if a person is not  acceptable as an employee in one department, is it realistic to  assume they would be in another? Rather than passing around  the problem, the better option is to terminate the problematic  employee, especially if direct training and coaching do not  provide a resolution. \nThe offboarding process may also include informing security guards  and other physical facility and property access management  personnel to disallow entry to the former employee in the future. \nThe procedures for onboarding and offboarding should be clearly  documented to ensure consistency of application and compliance  with regulations or contractual obligations. Disclosure of these  policies may need to be a standard element of the hiring process. \nNumerous issues must be addressed when an employee must be  terminated or offboarded. A strong relationship between the security  department and HR is essential to maintain control and minimize  risks during termination. \nTerminations are typically unpleasant processes for all involved. \nHowever, they might be elevated to a neutral experience when well  planned and scripted. The intent of a termination policy is to reduce  the risk associated with employee termination while treating the  person with respect. The termination meeting should take place with  at least one witness, preferably a higher-level manager and/or a  security guard. Once the employee has been informed of their  release, they should be reminded of the liabilities and restrictions  placed on the former employee based on the employment agreement, \nNDAs, and any other security-related documentation. During this  meeting, all organization-specific identification, access, or security  badges as well as devices, cards, keys, and access tokens should be  collected (see Figure 2.1). The termination of an employee should be  handled in a private and respectful manner. However, this does not  mean that precautions should not be taken. \nFIGURE 2.1 Former employees must return all company property. \nFor nonvoluntary terminations where there is a perceived risk of a  confrontation, the termination process may need to be abrupt and  attended by security guards. Any need to resolve HR issues, retrieve  company equipment, review NDAs, and so forth can be handled  afterward through an attorney. \nFor terminations that are expected to be professional and for  voluntary separations (such as quitting, retiring, or taking extended  leave), an additional process may be called an exit interview. An exit  interview is normally done by an HR person who specializes in those  interviews with the idea of learning from the employee's experience. \nThe purpose of an exit interview is to understand why the employee  is leaving, what their perspective is of the organization (its  personnel, culture, process, etc.), and what they suggest could be  done to improve conditions for current and future employees. \nInformation learned from an exit interview may assist the  organization with retaining employees through employment  improvements and process/policy changes. \nWhether an abrupt termination process is used or a cordial process  was concluded, the now former employee should be escorted off the  premises and not allowed to return to their work area without an  escort for any reason. \nThe following list includes some other security issues that should be  handled as soon as possible: \nRemove or deactivate the employee's user account at the same  time as or just before they are notified of being terminated. \nMake sure the employee returns any organizational equipment  or supplies from their vehicle or home. \nArrange for a security department member to accompany the  released employee while they gather their personal belongings  from the work area. \nInform all security personnel and anyone else who watches or  monitors any entrance point to ensure that the former employee  does not attempt to reenter the building without an escort. \nFiring: Timing Is Everything \nFiring an employee has become a complex process. That's why  you need a well-designed termination process. However, it must  be followed correctly every time. Unfortunately, this doesn't  always happen. You might have heard of some fiasco caused by a  botched termination procedure. Common examples include  performing any of the following before the employee is officially  informed of their termination (thus giving the employee prior  warning of their termination): \nThe IT department is requesting the return of a mobile  device \nDeactivating a network user account \nBlocking a person's personal identification number (PIN) or  smartcard for building entrance \nRevoking a parking pass \nDistributing a revised company organizational chart \nPositioning a new employee in their cubicle or workspace \nAllowing layoff information to be leaked to the media \nVendor, Consultant, and Contractor Agreements and \nControls \nVendor, consultant, and contractor controls are used to define the  levels of performance, expectation, compensation, and consequences  for entities, persons, or organizations that are external to the primary  organization. \nMultiparty risk exists when several entities or organizations are  involved in a project. The risk or threats are often due to the  variations of objectives, expectations, timelines, budgets, and  security priorities of those involved. Risk management is the  processes of identifying risks, assessing those risks, then selecting  responses to risks that need mitigation. The risk response strategies  implemented by one party may in fact cause additional risks against  or from another party. Often a risk management governing body  must be established to oversee the multiparty project and enforce  consistent security parameters for the member entities, at least as  their interactions relate to the project. \nUsing service-level agreements (SLAs) is a means to ensure that  organizations providing services maintain an appropriate level of  service agreed on by the service provider, vendor, or contractor and  the customer organization. You'd be wise to put SLAs in place for any  data circuits, applications, information processing systems,  databases, or other critical components that are vital to your  organization's continued viability. SLAs are important when using  any type of third-party service provider, including cloud services. \nSLAs also commonly include financial and other contractual  remedies that kick in if the agreement is not maintained. For  example, if a critical circuit is down for more than 15 minutes, the  service provider might agree to waive all charges on that circuit for  one week. \nSLAs and vendor, consultant, and contractor controls are an  important part of risk reduction and risk avoidance. By clearly  defining the expectations and penalties for external parties, everyone  involved knows what is expected of them and what the consequences  are in the event of a failure to meet those expectations. Although it  may be very cost-effective to use outside providers for a variety of  business functions or services, it does increase potential risk by  expanding the potential attack surface and range of vulnerabilities. \nSLAs should include a focus on protecting and improving security in  addition to ensuring quality and timely services at a reasonable price. \nSome SLAs are set and cannot be adjusted, whereas, with others, you  may have significant influence over their content. You should ensure  that an SLA supports the tenets of your security policy and  infrastructure rather than being in conflict with them, which could  introduce weak points, vulnerabilities, or exceptions. \nOutsourcing is the term often used to describe the use of an external  third party, such as a vendor, consultant, or contractor, rather than  performing the task or operation in-house. Outsourcing can be used  as a risk response option known as transference or assignment (see  the “Risk Responses” section later in this chapter). However, though  the risk of operating a function internally is transferred to a third  party, other risks are taken on by using a third party. This aspect  needs to be evaluated as to whether it is a benefit or a consequence of  the SLA. For more on service-level agreements (SLAs), see Chapter \n16. \nVendors, consultants, and contractors also represent an increase in  the risk of trade secret theft or espionage. Outsiders often lack  organizational loyalty that internal employees typically have; thus,  the temptation to take advantage of intellectual property access  opportunities may seem easier or less of an internal conflict to a  perpetrator. For more on espionage, see Chapter 17, “Preventing and \nResponding to Incidents.” \nSome organizations may benefit from a vendor management system \n(VMS) . A VMS is a software solution that assists with managing and  procuring staffing services, hardware, software, and other needed  products and services. A VMS can offer ordering convenience, order  distribution, training, consolidated billing, and more. In regard to  security, a VMS can potentially keep communications and contracts  confidential, require encrypted and authenticated transactions, and  maintain a detailed activity log of events related to vendors and  suppliers. A VMS is particularly valuable for organizations that work  with a large number of vendors and require a centralized and  systematic approach to vendor relationship management. A VMS  helps enhance vendor performance, reduce costs, manage risks, and  maintain compliance while fostering collaborative and productive  relationships with external partners. \nCompliance is the act of conforming to or adhering to  rules, policies, regulations, standards, or requirements. \nCompliance is an important concern of security governance. \nUnderstand and Apply Risk Management \nConcepts \nRisk management is a detailed process of identifying factors that  could damage or disclose assets, evaluating those factors in light of  asset value and countermeasure cost, and implementing cost-  effective solutions for mitigating or reducing risk. The overall process  of risk management is used to develop and implement information  security strategies that support the mission of the organization. The  result of performing risk management for the first time is the  skeleton of a security policy. Subsequent risk management events are  used to improve and sustain an organization's security infrastructure  over time as internal and external conditions change. \nThe primary goal of risk management is to reduce risk to an  acceptable level. What that level actually is depends on the  organization, the value of its assets, the size of its budget, and many  other factors. One organization might consider something to be an  acceptable risk, whereas another organization might consider the  very same thing to be an unreasonably high level of risk. It is  impossible to design and deploy a totally risk-free environment;  however, significant risk reduction is possible, often with modest  effort. \nRisks to an IT infrastructure are not all computer-based. In fact,  many risks come from non-IT sources. It is important to consider all  possible risks when performing risk evaluation, including accidents,  natural disasters, financial threats, civil unrest, pandemics, physical  threats, technical exploitations, and social engineering attacks. \nFailing to evaluate and respond to all forms of risk properly will leave  a company vulnerable. \nRisk management is composed of two primary elements: \nRisk assessment or risk analysis is the examination of an  environment for risks, evaluating each threat event as to its  likelihood of occurring and the severity of the damage it would  cause if it did occur, and assessing the cost of various  countermeasures for each risk. This results in a sorted criticality  prioritization of risks. From there, risk response takes over. \nRisk response involves evaluating countermeasures, safeguards,  and security controls using a cost/benefit analysis; adjusting  findings based on other conditions, concerns, priorities, and  resources; and providing a proposal of response options in a  report to senior management. Based on management decisions  and guidance, the selected responses can be implemented into  the IT infrastructure and integrated into the security policy  documentation. This activity is also known as risk reduction or  risk mitigation, which is the overall goal of risk management. \nA concept related to risk management is risk awareness. Risk  awareness is the effort to increase the knowledge of risks within an  organization. This includes understanding the value of assets,  inventorying the existing threats that can harm those assets, and the  responses selected and implemented to address the identified risk. \nRisk awareness helps to inform an organization about the  importance of abiding by security policies and the consequences of  security failures. \nRisk Terminology and Concepts \nRisk management employs a vast terminology that must be clearly  understood. This section defines and discusses all the important  risk-related terminology: \nAsset An asset is anything used in a business process or task. \nIf an organization relies on a person, place, or thing, whether  tangible or intangible, then it is an asset. \nAsset Valuation Asset valuation is the value assigned to an  asset based on a number of factors, including importance to the  organization, use in critical processes, actual cost, and  nonmonetary expenses/costs (such as time, attention,  productivity, and research and development). When performing  a math-based risk evaluation (i.e., quantitative; see the \n“Quantitative Risk Analysis” section later in this chapter), a  dollar figure is assigned as the asset value (AV). \nThreats Any potential occurrence that may cause an  undesirable or unwanted outcome for an organization or for a  specific asset is a threat . Threats are any action or inaction that  could cause damage, destruction, alteration, loss, or disclosure  of assets or that could block access to or prevent maintenance of  assets. They can be intentional or accidental. They can originate  from inside or outside. You can loosely think of a threat as a  weapon that could cause harm to a target. \nThreat Agent/Actors Threat agents or threat actors  intentionally exploit vulnerabilities. Threat agents are usually  people, but they could also be programs, hardware, or systems. \nThreat agents wield threats to cause harm to targets. Aka  attacker, adversary, or bad guy. \nThreat Events Threat events are accidental occurrences and  intentional exploitations of vulnerabilities. They can also be  natural or person-made. Threat events include fire, earthquake,  flood, system failure, human error (due to a lack of training or  ignorance), and power outage. \nThreat Vector A threat vector or attack vector is the path or  means by which an attack or threat agent can gain access to a  target to cause harm. Threat vectors can include email, web  surfing, external drives, Wi-Fi networks, physical access, mobile  devices, cloud, social media, supply chain, removable media,  and commercial software. \nVulnerability The weakness in an asset or the absence or the  weakness of a safeguard or countermeasure is a vulnerability . In  other words, a vulnerability is a flaw, loophole, oversight, error,  limitation, frailty, or susceptibility that enables a threat to cause  harm. \nExposure Exposure is being susceptible to asset loss because  of a threat; there is the possibility that a vulnerability can or will  be exploited by a threat agent or event. Exposure doesn't mean  that a realized threat (an event that results in loss) is actually  occurring, just that there is the potential for harm to occur. The  quantitative risk analysis value of the exposure factor (EF) is  derived from this concept. \nRisk \nRisk is the possibility or likelihood that a threat will exploit a  vulnerability to cause harm to an asset and the severity of  damage that could result. The more likely it is that a threat  event will occur, the greater the risk. The greater the amount of  harm that could result if a threat is realized, the greater the  risk. Every instance of exposure is a risk. When written as a  conceptual formula, risk can be defined as follows:  risk = threat * vulnerability  or  risk = probability of harm * severity of harm \nSafeguards A safeguard , security control , protection  mechanism, or countermeasure is anything that removes or  reduces a vulnerability or protects against one or more specific  threats. This concept is also known as a risk response. A  safeguard is any action or product that reduces risk through the  elimination or lessening of a threat or a vulnerability. \nSafeguards are the means by which risk is mitigated or resolved. \nIt is important to remember that a safeguard need not involve  purchasing a new product; reconfiguring existing elements and  removing elements from the infrastructure are also valid  safeguards or risk responses. \nAttack An attack is intentionally exploiting a vulnerability by a  threat agent to cause damage, loss, or disclosure of assets,  whether or not the attempt is successful. An attack can also be  viewed as any violation or failure to adhere to an organization's  security policy. A malicious event does not have to succeed in  violating security to be considered an attack. \nBreach A breach , intrusion, or penetration is when a security  mechanism is bypassed or thwarted by a threat agent. A breach  is a successful attack. \nHazard \nA hazard refers to a potential source or situation that has the  capability to cause harm, loss, damage, injury, or adverse  consequences to an organization, its assets, individuals, or the  environment. \nSome of these risk terms and elements are clearly related, as shown  in Figure 2.2. Threats exploit vulnerabilities, which results in  exposure. Exposure is a risk, and risk is mitigated by safeguards. \nSafeguards protect assets that are endangered by threats. \nFIGURE 2.2 The cyclical relationships of risk elements \nThere are many approaches to risk assessment. Some are initiated by  evaluating threats, whereas others focus first on assets. Whether a  risk assessment starts with inventorying threats, then looks for assets  that could be harmed, or starts with inventorying assets, then looks  for threats that could cause harm, both approaches result in asset-  threat pairings that then need to be risk evaluated. Both approaches  have merit, and organizations should shift or alternate their risk  assessment processes between these methods. When focusing first  on threats, a broader range of harmful issues may be considered,  without being limited to the context of the assets. But this may result  in the collection of information about threats that the organization  does not need to worry about as they don't have the assets or  vulnerabilities that the threat focuses on. When focusing first on  assets, the entirety of organizational resources can be discovered  without being limited to the context of the threat list. But this may  result in spending time evaluating assets of very low value and low  risk (which would or will be defined as acceptable risk), which may  increase the overall time involved in risk assessment. \nRisk perspectives, also known as risk management perspectives or  approaches, are different lenses through which organizations and  individuals can view and address risks. Each perspective emphasizes  certain aspects of risk and can guide decision-making, risk  assessment, and mitigation strategies. There are innumerable  options of risk perspective, including asset, outcome, vulnerability,  threat, financial, strategic, operational, compliance, legal,  reputational, supply chain, third-party, and workforce. Each risk  perspective offers a unique way to approach risk management and  provides insights into different aspects of risk. An effective risk  management strategy may incorporate elements of multiple  perspectives to comprehensively assess and address risks based on  their impact, likelihood, and the organization's specific objectives. \nThe general idea of a threat-based risk assessment was discussed in \nChapter 1, “Security Governance Through Principles and Policies”—  that is, threat modeling. The discussion of risk assessment in this  chapter will focus on an asset-based risk assessment approach. \nAsset Valuation \nAn asset-based or asset-initiated risk analysis starts with  inventorying all organizational assets. Once that inventory is  complete, a valuation needs to be assigned to each asset. The  evaluation or appraisal of each asset helps establish its importance or  criticality to the business operations. If an asset has no value, there is  no need to provide protection for it. A primary goal of risk analysis is  to ensure that only cost-effective safeguards are deployed. It makes  no sense to spend $100,000 protecting an asset that is worth only \n$1,000. Therefore, the value of an asset directly affects and guides  the level of safeguards and security deployed to protect it. As a rule,  the annual costs of safeguards should not exceed the potential  annual cost of asset value loss. \nWhen the cost of an asset is evaluated, there are many aspects to  consider. The goal of asset valuation is to assign to an asset a specific  dollar value that encompasses tangible costs as well as intangible  ones. Determining the exact value of an asset is often difficult, if not  impossible, but nevertheless, a specific value must be established in  order to perform quantitative mathematical calculations. (Note that  the discussion of qualitative versus quantitative risk analysis later in  this chapter may clarify this issue; see the “Risk \nAssessment/Analysis” section.) Improperly assigning value to assets  can result in failing to protect an asset or implementing financially  infeasible safeguards properly. The following list includes tangible  and intangible issues that contribute to the valuation of assets: \nPurchase cost \nDevelopment cost \nAdministrative or management cost \nMaintenance or upkeep cost \nCost of acquiring an asset \nCost to protect or sustain an asset \nValue to owners and users \nValue to competitors \nIntellectual property or equity value \nMarket valuation (sustainable price) \nReplacement cost \nProductivity enhancement or degradation \nOperational costs of asset presence and loss \nLiability of asset loss \nUsefulness \nRelationship to research and development \nAssigning or determining the value of assets to an organization can  fulfill numerous requirements by: \nServing as the foundation for performing a cost/benefit analysis  of asset protection when performing safeguard selection \nServing as a means for evaluating the cost-effectiveness of  safeguards and countermeasures \nProviding values for insurance purposes and establishing an  overall net worth or net value for the organization \nHelping senior management understand exactly what is at risk  within the organization \nPreventing negligence of due care/due diligence and  encouraging compliance with legal requirements, industry  regulations, and internal security policies \nIf threat-based or threat-initiated risk analysis is being performed,  asset valuation occurs after the organization discovers threats and  identifies vulnerable assets to those threats. \nIdentify Threats and Vulnerabilities \nAn essential part of risk management is identifying and examining  threats. This involves creating an exhaustive list of all possible  threats for the organization's identified assets. The list should  include threat agents as well as threat events. Keep in mind that  threats can come from anywhere. Threats to IT are not limited to IT  sources or concepts. When compiling a list of threats, be sure to  consider threats from a wide range of sources. \nFor an expansive and formal list of threat examples, concepts, and  categories, consult National Institute of Standards and Technology \n(NIST) Special Publication (SP) 800-30r1 Appendix D, “Threat  sources,” and Appendix E, “Threat events.” For coverage of threat  modeling, see Chapter 1. \nIn most cases, a team rather than a single individual should perform  risk assessment and analysis. Also, the team members should be  from various departments within the organization. It is not usually a  requirement that all team members be security professionals or even  network/system administrators. The team's diversity based on the  organization's demographics will help to broadly identify and  address a wider range of threats and risks. \nThe Consultant Cavalry \nRisk assessment is a highly involved, detailed, complex, and  lengthy process. Often risk analysis cannot be properly handled  by existing employees because of the size, scope, or liability of the  risk; thus, many organizations bring in risk management  consultants to perform this work. This provides a high level of  expertise, does not bog down employees, and can be a more  reliable measurement of real-world risk. However, even risk  management consultants do not perform risk assessment and  analysis on paper only; they typically employ risk assessment  software. This software streamlines the overall task, provides  more reliable results, and produces standardized reports that are  acceptable to insurance companies, boards of directors, and so  on. \nRisk Assessment/Analysis \nRisk management is primarily the responsibility of upper  management. However, upper management typically assigns risk  analyses and risk response modeling tasks to a team from the IT and  security departments. The results of the risk assessment team will be  submitted as a proposal to upper management. Upper management  will make the final decisions as to which responses are implemented  by the organization. \nIt is the responsibility of upper management to initiate and support  risk analysis and assessment by defining the scope and purpose of  the endeavor. All risk assessments, results, decisions, actions, and  outcomes must be understood and approved by upper management  as an element in providing prudent due care/due diligence. \n“Prudent actions” and “reasonable actions” are terms used in legal  and ethical contexts to describe different standards of behavior or  decision-making, especially related to risk management. While these  standards share some similarities, they have distinct meanings. \nPrudent actions refer to actions or decisions that are marked by a  high degree of caution, care, and foresight. They are characterized by  careful consideration of potential risks, a focus on preventing harm,  and a commitment to acting in a manner that is consistent with  established best practices or industry standards. Prudent actions  often involve taking additional precautions beyond what might be  considered “reasonable” to ensure the highest level of safety and  protection. Prudence implies a proactive and diligent approach to  decision-making. In a legal context, acting prudently may serve to  protect an individual or organization from liability in cases where a  higher standard of care is expected. \nReasonable actions refer to actions or decisions that are in line with  what a person of ordinary prudence and judgment would do in  similar circumstances. These actions are based on the idea of acting  in a manner that is sensible, rational, and consistent with societal  norms and expectations. Reasonable actions are a standard often  used in legal and ethical contexts to assess whether an individual's  behavior or decisions meet a minimum threshold of acceptability. In  a legal context, “acting reasonably” often serves as a benchmark to  determine whether someone has met their duty of care, particularly  in cases where negligence or liability is in question. \nTherefore, prudent actions are characterized by an above-average  level of caution and diligence, whereas reasonable actions are aligned  with common expectations and societal norms. The choice between  these standards may depend on the specific circumstances, legal  requirements, and ethical considerations, as well as the degree of  care and caution expected in a given situation. \nAll IT systems have risk. All organizations have risk. Every task  performed by a worker has risk. There is no way to eliminate 100  percent of all risks. Instead, upper management must decide which  risks are acceptable and which are not. Determining which risks are  acceptable requires detailed and complex asset and risk assessments,  as well as a thorough understanding of the organization's budget,  internal expertise and experience, business conditions, and many  other internal and external factors. What is deemed acceptable to  one organization may not be viewed the same way by another. For  example, you might think that losing $100 is a significant loss and  impact to your monthly personal budget, but the wealthy might not  even realize if they lost or wasted hundreds or thousands of dollars. \nRisk is personal, or at least specific to an organization based on its  assets, its threats, its threat agents/actors, and its risk tolerance. \nScope refers to the extent or boundaries of a risk management  process, project, or assessment. It defines what is included and what  is excluded in the risk management efforts. Determining the scope is  a critical step in effectively managing and addressing risks, as it helps  organizations focus their resources and efforts on the most relevant  areas. Establishing a well-defined scope is essential for effective risk  management because it helps organizations prioritize their efforts,  allocate resources efficiently, and ensure that risks are adequately  assessed and mitigated in the areas that matter most. A clear and  well-communicated scope also reduces ambiguity and ensures that  all relevant parties are on the same page regarding the objectives and  boundaries of the risk management process. \nOnce an inventory of threats and assets (or assets and threats) is  developed based on a defined scope, each asset-threat pairing must  be individually evaluated and its related risk calculated or assessed. \nThere are two primary risk assessment methodologies: quantitative  and qualitative. Quantitative risk analysis assigns real dollar figures  to the loss of an asset and is based on mathematical calculations. \nQualitative risk analysis assigns subjective and intangible values to  the loss of an asset and takes into account perspectives, feelings,  intuition, preferences, ideas, and gut reactions. Both methods are  necessary for a complete perspective on organizational risk. Most  environments employ a hybrid of both risk assessment  methodologies in order to gain a balanced view of their security  concerns. \nThe goal of risk assessment is to identify risks (based on asset-threat  pairings) and rank them in order of criticality. This risk criticality  prioritization is needed in order to guide the organization in  optimizing the use of their limited resources on protections against  identified risks, from the most significant to those just above the risk  acceptance threshold. \nThe two risk assessment approaches (quantitative and qualitative)  can be seen as distinct and separate concepts or endpoints on a  sliding scale. As discussed in Chapter 1, a basic probability versus  potential damage 3×3 matrix relies on an innate understanding of  the assets and threats and relies on a judgment call of the risk analyst  to decide whether the likelihood and severity are low, medium, or  high. This is likely the simplest form of qualitative assessment. It  requires minimum time and effort. However, if it fails to provide the  needed clarity or distinction of criticality prioritization, then a more  in-depth approach should be undertaken. A 5×5 matrix or even  larger could be used. However, each increase in matrix size requires  more knowledge, more research, and more time to assign a level to  probability and severity properly. At some point, the evaluation  shifts from being mostly subjective qualitative to more substantial  quantitative. \nAnother perspective on the two risk assessment approaches is that a  qualitative mechanism can be used first to determine whether a  detailed and resource/time-expensive quantitative mechanism is  necessary. An organization can also perform both approaches and  use them to adjust or modify each other; for example, qualitative  results can be used to fine-tune quantitative priorities. \nQualitative Risk Analysis \nQualitative risk analysis is more scenario-based, perception-based,  or gut reaction-based than it is mathematically-based. Rather than  assigning exact dollar figures to possible losses, you rank threats on a  relative scale to evaluate their risks, costs, and effects. Since a purely  quantitative risk assessment is not possible, balancing the results of a  quantitative analysis is essential. The method of combining  quantitative and qualitative analysis into a final assessment of  organizational risk is known as hybrid assessment or hybrid  analysis . The process of performing qualitative risk analysis involves  judgment, intuition, and experience. You can use many techniques to  perform qualitative risk analysis: \nBrainstorming \nStoryboarding \nFocus groups \nSurveys \nQuestionnaires \nChecklists \nOne-on-one meetings \nInterviews \nScenarios \nDelphi technique \nDetermining which mechanism to employ is based on the culture of  the organization and the types of risks and assets involved. It is  common for several methods to be employed simultaneously and  their results compared and contrasted in the final risk analysis report  to upper management. Two of these that you need to be more aware  of are scenarios and the Delphi technique. \nScenarios \nThe basic process for all these mechanisms involves the creation of  scenarios. A scenario is a written description of a single major threat. \nThe description focuses on how a threat would be instigated and  what effects its occurrence could have on the organization, the IT  infrastructure, and specific assets. Generally, the scenarios are  limited to one page of text to keep them manageable. For each  scenario, several safeguards are described that would completely or  partially protect against the major threat discussed in the scenario. \nThe analysis participants then assign to the scenario a threat level, a  loss potential, and the advantages of each safeguard. These  assignments can be simple—such as High, Medium, and Low, or a  basic number scale of 1 to 10—or they can be detailed essay  responses. The responses from all participants are then compiled  into a single report that is presented to upper management. For  examples of reference ratings and levels, please see Tables D-3, D-4, \nD-5, D-6, and E-4 in NIST SP 800-30 Rev.1:  csrc.nist.gov/pubs/sp/800/30/r1/final . \nThe usefulness and validity of a qualitative risk analysis improves as  the number and diversity of the participants in the evaluation  increases. Whenever possible, include one or more people from each  level of the organizational hierarchy, from upper management to end  users. It is also important to include a cross-section from each major  department, division, office, or branch. \nDelphi Technique \nThe Delphi technique is probably the primary mechanism on the  previous list that is not immediately recognizable and understood. \nThe Delphi technique is simply an anonymous feedback-and-  response process used to enable a group to reach an anonymous  consensus. Its primary purpose is to elicit honest and uninfluenced  responses from all participants, while minimizing the influence of  bias and discrimination. The participants are usually gathered in a  single meeting room. To each request for feedback, each participant  writes down their response on paper or through digital messaging  services anonymously. The results are compiled and presented to the  group for evaluation. The process is repeated until a consensus is  reached. The goal or purpose of the Delphi technique is to facilitate  the evaluation of ideas, concepts, and solutions on their own merit  without the discrimination that often occurs based on who the idea  comes from. \nQuantitative Risk Analysis \nThe quantitative method results in concrete probability indications  or a numeric indication of relative risk potential. That means the end  result is a report that has dollar figures for levels of risk, potential  loss, cost of countermeasures, and value of safeguards. This report is  usually fairly easy to understand, especially for anyone with  knowledge of spreadsheets and budget reports. Think of quantitative  analysis as the act of assigning a quantity to risk—in other words,  placing a dollar figure on each asset and threat impact. However, a  purely quantitative analysis is not sufficient—not all elements and  aspects of the analysis can be accurately quantified because some are  qualitative, subjective, or intangible. \nThe process of quantitative risk analysis starts with asset valuation  and threat identification (which can be performed in any order). This  results in asset-threat pairings that need to have estimations of harm  potential/severity and frequency/likelihood assigned or determined. \nThis information is then used to calculate various cost functions that  are used to evaluate safeguards. \nThe major steps or phases in quantitative risk analysis are as follows \n(see Figure 2.3, with terms and concepts defined after this list of  steps): \n1. Inventory assets and assign a value (asset value [AV]). \n2. Research each asset and produce a list of all possible threats to  each individual asset. This results in asset-threat pairings. \n3. For each asset-threat pairing, calculate the exposure factor (EF). \n4. Calculate the single loss expectancy (SLE) for each asset-threat  pairing. \n5. Perform a threat analysis to calculate the likelihood of each  threat being realized within a single year—that is, the annualized  rate of occurrence (ARO). \n6. Derive the overall loss potential per threat by calculating the  annualized loss expectancy (ALE). \n7. Research countermeasures for each threat and then calculate the  changes to ARO, EF, and ALE based on an applied  countermeasure. \n8. Perform a cost/benefit analysis of each countermeasure for each  threat for each asset. Select the most appropriate response to  each threat. \nFIGURE 2.3 The six major elements of quantitative risk analysis \nThe cost functions associated with quantitative risk analysis include  the following: \nExposure Factor The exposure factor (EF) represents the  percentage of loss that an organization would experience if a  specific asset were violated by a realized risk. The EF can also be  called the loss potential . In most cases, a realized risk does not  result in the total loss of an asset. The EF simply indicates the  expected overall asset value loss because of a single realized risk. \nThe EF is usually small for assets that are easily replaceable,  such as hardware. It can be very large for assets that are  irreplaceable or proprietary, such as product designs or a  database of customers. The EF is expressed as a percentage. The \nEF is determined by using historical internal data, performing  statistical analysis, consulting public or subscription risk  ledgers/registers, working with consultants, or using a risk  management software solution. \nSingle-Loss Expectancy The single-loss expectancy (SLE)  is the potential loss associated with a single realized threat  against a specific asset. It indicates the potential amount of loss  an organization would or could experience if an asset were  harmed by a specific threat occurring. \nThe SLE is calculated using the following formula: \nSLE = asset value (AV) * exposure factor (EF)  or more simply: \nSLE = AV * EF \nThe SLE is expressed in a dollar value. For example, if an asset  is valued at $200,000 and it has an EF of 45 percent for a  specific threat, then the SLE of the threat for that asset is \n$90,000. It is not always necessary to calculate an SLE, as the \nALE is the most commonly needed value in determining  criticality prioritization. Thus, sometimes, during risk  calculation, SLE may be skipped entirely. \nAnnualized Rate of Occurrence The annualized rate of  occurrence (ARO) is the expected frequency with which a  specific threat or risk will occur (that is, become realized) within  a single year. The ARO can range from a value of 0.0 (zero),  indicating that the threat or risk will never be realized, to a very  large number, indicating that the threat or risk occurs often. \nCalculating the ARO can be complicated. It can be derived by  reviewing historical internal data, performing statistical  analysis, consulting public or subscription risk ledgers/registers,  working with consultants, or using a risk management software  solution. The ARO for some threats or risks is calculated by  multiplying the likelihood of a single occurrence by the number  of users who could initiate the threat. ARO is also known as a  probability determination. Here's an example: the ARO of an  earthquake in Tulsa may be .00001, whereas the ARO of an  earthquake in San Francisco may be .03 (for a 6.7+ magnitude),  or you can compare the ARO of an earthquake in Tulsa of \n.00001 to the ARO of an email virus in an office in Tulsa of \n10,000,000. \nAnnualized Loss Expectancy \nThe annualized loss expectancy (ALE) is the possible yearly  loss of all instances of a specific realized threat against a  specific asset. The ALE is calculated using the following  formula: \nALE = single loss expectancy (SLE) * annualized rate of  occurrence (ARO)  or \nALE = asset value (AV) * exposure factor (EF) * annualized  rate of occurrence (ARO)  or more simply: \nALE = SLE * ARO  or \nALE = AV * EF * ARO \nFor example, if the SLE of an asset is $90,000 and the ARO for  a specific threat (such as total power loss) is .5, then the ALE is \n$45,000. If the ARO for a specific threat (such as a  compromised user account) is 15 for the same asset, then the \nALE would be $1,350,000. \nThe task of calculating EF, SLE, ARO, and ALE for every asset and  every threat/risk is a daunting one. Fortunately, quantitative risk  assessment software tools can simplify and automate much of this  process. These tools produce an asset inventory with valuations and  then, using predefined AROs along with some customizing options \n(industry, geography, IT components, and so on), produce risk  analysis reports. \nOnce an ALE is calculated for each asset-threat pairing, then the  entire collection should be sorted from largest ALE to smallest. \nAlthough the actual number of the ALE is not an absolute number (it  is an amalgamation of intangible and tangible value multiplied by a  future prediction of loss multiplied by a future prediction of  likelihood), it does have relative value. The largest ALE is the biggest  problem the organization is facing and, thus, the first risk to be  addressed in risk response. \nThe “Cost vs. Benefit of Security Controls” section, later in this  chapter, discusses the various formulas associated with quantitative  risk analysis that you should be familiar with. \nBoth the quantitative and qualitative risk analysis mechanisms offer  useful results. However, each technique involves a unique method of  evaluating the same set of assets and risks. Prudent due care requires  that both methods be employed in order to obtain a balanced  perspective on risk. Table 2.1 describes the benefits and  disadvantages of these two systems. \nTABLE 2.1 Comparison of quantitative and qualitative risk analysis \nCharacteristic Qualitative Quantitative \nEmploys math functions No Yes \nUses cost/benefit analysis May Yes \nRequires estimation Yes Some \nSupports automation No Yes \nInvolves a high volume of information No Yes \nIs objective Less so More so \nRelies substantially on opinion Yes No \nRequires significant time and effort Sometimes Yes \nOffers useful and meaningful results Yes Yes \nAt this point, the risk management process shifts from risk  assessment to risk response. Risk assessment is used to identify the  risks and set criticality priorities, and then risk response is used to  determine the best defense for each identified risk. However,  identified risks need to be prioritized before any response strategies  can be selected or implemented. \nPrioritization in risk management is the process of systematically  ranking and organizing risks based on their significance, potential  impact, likelihood, or other relevant criteria. The objective of  prioritization is to identify and focus on the most critical or high-  priority risks so that limited resources, time, and attention can be  allocated effectively to address them. Prioritization is a fundamental  step in the risk management process, helping organizations make  informed decisions about risk mitigation and risk response  strategies. Risk prioritization (or criticality prioritization) can be as  simple as ordering risks from worst to least unfavorable or sorting \nALEs from largest to smallest. However, complex and integrated risk  analysis methods may integrate qualitative and quantitative  elements together, making the prioritization process a less than  simple process. \nRisk Responses \nWhether a quantitative or qualitative risk assessment was  performed, there are many elements of risk response that apply  equally to both approaches. Once the risk analysis is complete,  management must address each specific risk. There are several  possible responses to risk: \nMitigation or reduction \nAssignment or transfer \nDeterrence \nAvoidance \nAcceptance \nReject or ignore \nThese risk responses are all related to an organization's risk appetite  and risk tolerance. Risk appetite is the total amount of risk that an  organization is willing to shoulder in aggregate across all assets. Risk  capacity is the level of risk an organization is able to shoulder. An  organization's desired risk appetite may be greater than its actual  capacity. Risk tolerance is the amount or level of risk that an  organization will accept per individual asset-threat pair. This is often  related to a risk target, which is the preferred level of risk for a  specific asset-threat pairing. A risk limit is the maximum level of risk  above the risk target that will be tolerated before further risk  management actions are taken. \nYou need to know the following information about the possible risk  responses: \nRisk Mitigation Reducing risk , or risk mitigation , is the  implementation of safeguards, security controls, and  countermeasures to reduce and/or eliminate vulnerabilities or  block threats. Deploying encryption and using firewalls are  common examples of risk mitigation or reduction. Elimination  of an individual risk can sometimes be achieved, but typically,  some risk remains even after mitigation or reduction efforts. \nRisk Assignment Assigning risk or transferring risk is the  placement of the responsibility of loss due to a risk onto another  entity or organization. Purchasing cybersecurity insurance or  traditional insurance and outsourcing are common forms of  assigning or transferring risk. Aka assignment of risk and  transference of risk. \nRisk Deterrence Risk deterrence is the process of  implementing deterrents to would-be violators of security and  policy. The goal is to convince a threat agent not to attack. Some  examples include implementing auditing, security cameras, and  warning banners; using security guards; and making it known  that the organization is willing to cooperate with authorities and  prosecute those who participate in cybercrime. \nRisk Avoidance Risk avoidance is the process of selecting  alternate options or activities that have less associated risk than  the default, common, expedient, or cheap option. For example,  choosing to fly to a destination instead of driving to it is a form  of risk avoidance. Another example is to locate a business in \nArizona instead of Florida to avoid hurricanes. The risk is  avoided by eliminating the risk cause. A business leader  terminating a business endeavor because it does not align with  organizational objectives and that has a high risk-versus-reward  ratio is also an example of risk avoidance. \nRisk Acceptance Accepting risk , or acceptance of risk, is the  result after a cost/benefit analysis shows countermeasure costs  would outweigh the possible cost of loss due to a risk. It also  means that management has agreed to accept the consequences  and the loss if the risk is realized. In most cases, accepting risk  requires a clearly written statement that indicates why a  safeguard was not implemented, who is responsible for the  decision, and who will be responsible for the loss if the risk is  realized, usually in the form of a document signed by senior  management. \nRisk Rejection An unacceptable possible response to risk is  to reject risk or ignore risk . Denying that a risk exists and  hoping that it will never be realized are not valid or prudent due  care/due diligence responses to risk. Rejecting or ignoring risk  may be considered negligence in court. \nInherent risk is the level of natural, native, or default risk in an  environment, system, or product before any risk management efforts  are performed. Inherent risk can exist due to the supply chain,  developer operations, design and architecture of a system, or an  organization's knowledge and skill base. Inherent risk is also known  as initial risk or starting risk . This is the risk that is identified by the  risk assessment process. \nOnce safeguards, security controls, and countermeasures are  implemented, the risk that remains is known as residual risk. \nResidual risk consists of threats to specific assets against which  upper management chooses not to implement a response. In other  words, residual risk is the risk that management has chosen to accept  rather than mitigate. In most cases, the presence of residual risk  indicates that the cost/benefit analysis showed that the available  safeguards were not cost-effective deterrents. \nTotal risk is the amount of risk an organization would face if no  safeguards were implemented. A conceptual formula for total risk is  as follows:  threats and vulnerabilities and asset value = total risk \nThe difference between total risk and residual risk is known as the  controls gap. The controls gap is the amount of risk that is reduced  by implementing safeguards. A conceptual formula for residual risk  is as follows:  total risk – controls gap = residual risk \nAs with risk management in general, handling risk is not a onetime  process. Instead, security must be continually maintained and  reaffirmed. In fact, repeating the risk assessment and risk response  processes is a necessary function to assess the completeness and  effectiveness of the security program over time. Additionally, it helps  locate deficiencies and areas where change has occurred. Since  security changes over time, reassessing on a periodic basis is  essential to maintaining reasonable security. \nControl risk is the risk that is introduced by the introduction of the  countermeasure to an environment. Most safeguards, security  controls, and countermeasures are themselves some sort of  technology. No technology is perfect, and no security is perfect, so  some vulnerability exists in regard to the control itself. Although a  control may reduce the risk of a threat to an asset, it may also  introduce a new risk of a threat that can compromise the control  itself. Thus, risk assessment and response must be an iterative  operation that looks back on itself to make continuous  improvements. \nCybersecurity Insurance \nCybersecurity insurance, also known as cyber insurance or cyber risk  insurance, is a type of insurance policy that provides coverage and  financial protection to organizations or individuals in the event of  cyber-related incidents, data breaches, or cyberattacks. This form of  insurance is designed to help mitigate the financial and legal  consequences of cybersecurity breaches, which can result in data  loss, financial loss, legal liabilities, and reputational damage. It is a  form of risk assignment response. \nKey features and aspects of cybersecurity insurance include: \nCoverage for data breaches. Cybersecurity insurance typically  covers the costs associated with data breaches, including  expenses related to notifying affected individuals, credit  monitoring services, and the costs of investigating and  mitigating the breach. \nFinancial loss protection. It provides coverage for financial  losses resulting from cyberattacks, such as theft of funds,  fraudulent transactions, and extortion payments demanded by  cybercriminals. \nLegal liabilities. Cyber insurance can cover legal expenses and  liability costs associated with cybersecurity incidents, including  lawsuits, regulatory fines, and penalties for noncompliance with  data protection regulations. \nReputation management. Some policies include coverage for  expenses related to reputation management and public relations  efforts to rebuild trust with customers and stakeholders after a  data breach. \nBusiness interruption. Cyber insurance may offer coverage for  losses related to business interruption caused by a cyber  incident. This can include income loss due to system downtime. \nRansomware protection. Many policies include coverage for  ransomware attacks and may cover ransom payments,  investigation costs, and remediation. \nForensic services. Insurers often provide access to cybersecurity  experts and forensic services to investigate and assess the extent  of a breach. \nIncident response. Cyber insurance may include support for  incident response planning and coordination, helping  organizations navigate the complexities of managing a cyber  incident. \nRegulatory compliance. Policies may cover expenses related to  regulatory compliance and fines, particularly in cases where  data protection laws have been violated. \nThird-party liability. Coverage may extend to liabilities arising  from third parties, such as vendors, partners, and customers,  who are affected by a cybersecurity incident involving the  insured organization. \nCybersecurity insurance is often an essential component of an  organization's risk management strategy, especially as cyberthreats  continue to evolve and pose significant financial and operational  risks. It helps businesses and individuals transfer some of the  financial risks associated with cybersecurity incidents to insurance  providers, reducing the potential financial burden and providing  peace of mind in the face of cyberthreats. However, it's crucial for  policyholders to carefully review the terms, coverage limits, and  conditions of their cyber insurance policies to ensure they meet their  specific needs and risk profile. \nCost vs. Benefit of Security Controls \nOften, additional calculations are involved in risk response when a  quantitative risk assessment is performed. These relate to the  mathematical evaluation of the cost/benefit of a safeguard. For each  identified risk in criticality priority order, safeguards are considered  in regard to their potential loss reduction and benefit potential. For  each asset-threat pairing (i.e., identified risk), an inventory of  potential and available safeguards must be made. This may include  investigating the marketplace, consulting with experts, and  reviewing security frameworks, regulations, and guidelines. Once a  list of safeguards is obtained or produced for each risk, those  safeguards should be evaluated as to their benefit and their cost  relative to the asset-threat pair. This is the cost/benefit evaluation of  safeguards. \nLegal and in Compliance \nEvery organization needs to verify that its operations and policies  are legal and in compliance with its stated security policies,  industry obligations, contracts, and regulations. Auditing is  necessary for compliance testing, also called compliance  checking. Verification that a system complies with laws,  regulations, baselines, guidelines, standards, best practices,  contracts, and policies is an important part of maintaining  security in any environment. Compliance testing ensures that all  necessary and required elements of a security solution are  properly deployed and functioning as expected. These are all  important considerations when selecting risk response strategies. \nSafeguards, security controls, and countermeasures will primarily  reduce risk through a reduction in the potential rate of compromise \n(i.e., ARO). However, some safeguards will also reduce the amount  or severity of damage (i.e., EF). For those safeguards that only  reduce the ARO, the amount of loss of a single realized event (i.e., \nSLE) is the same with or without the safeguard. But for those  safeguards that also reduce the EF, any single realized event will  cause less damage than if the safeguard was not present. Either way,  a reduction of the ARO and potentially a reduction of the EF will  result in a smaller ALE with the safeguard than without. Thus, this  potential ALE with the safeguard should be calculated (ALE = AV * \nEF * ARO). We can then consider the original asset-threat pair risk \nALE as ALE1 (or ALE pre-safeguard) and the safeguard-specific ALE  as ALE2 (or ALE post-safeguard). An ALE2 should be calculated for  each potential safeguard for each asset-threat pair. The best of all  possible safeguards would reduce the ARO to 0, although this is  extremely unlikely. \nAny safeguard that is selected to be deployed will cost the  organization something. It might not be purchase cost; it could be  costs in terms of productivity loss, retraining, changes in business  processes, or other opportunity costs. An estimation of the yearly  costs for the safeguard to be present in the organization is needed. \nThis estimation can be called the annual cost of the safeguard (ACS) . \nSeveral common factors affect ACS: \nCost of purchase, development, and licensing \nCost of implementation and customization \nCost of annual operation, maintenance, administration, and so  on \nCost of annual repairs and upgrades \nProductivity improvement or loss \nChanges to environment \nCost of testing and evaluation \nThe value of the asset to be protected determines the maximum  expenditures for protection mechanisms. Security should be cost-  effective, and thus it is not prudent to spend more (in terms of cash  or resources) protecting an asset than its value to the organization. If  the cost of the countermeasure is greater than the value of the asset \n(i.e., the cost of the risk), that safeguard should not be considered a  reasonable option. Also, if the ACS is greater than the ALE1 (i.e., the  potential annual loss of an asset due to a threat), then the safeguard  is not a cost-effective solution. If no safeguard options are cost-  effective, then accepting the risk may be the only remaining option. \nOnce you know the potential annual cost of a safeguard, you can then  evaluate the benefit of that safeguard if applied to an infrastructure. \nThe final computation in this process is the cost/benefit calculation ,  or cost/benefit analysis . This calculation is used to determine  whether a safeguard actually improves security without costing too  much. To determine whether the safeguard is financially equitable,  use the following formula: \n[ALE pre-safeguard – ALE post-safeguard] – annual cost of  safeguard (ACS) = value of the safeguard to the company \nIf the result is negative, the safeguard is not a financially responsible  choice. If the result is positive, then that value is the annual savings  your organization may reap by deploying the safeguard because the  rate of occurrence is not a guarantee of occurrence. If multiple  safeguards seem to have a positive cost/benefit result, then the  safeguard with the largest benefit is the most cost-effective option. \nThe annual savings or loss from a safeguard should not be the only  consideration when evaluating safeguards. You should also consider  the issues of legal responsibility and prudent due care/due diligence. \nIn some cases, it makes more sense to lose money in the deployment  of a safeguard than to risk legal liability in the event of an asset  disclosure or loss. \nIn review, to perform the cost/benefit analysis of a safeguard, you  must calculate the following three elements: \nThe pre-safeguard ALE for an asset-threat pairing \nThe potential post-safeguard ALE for an asset-threat pairing \nThe ACS (annual cost of the safeguard) \nWith those elements, you can finally obtain a value for the  cost/benefit formula for this specific safeguard against a specific risk  against a specific asset: \n(pre-safeguard ALE – post-safeguard ALE) – ACS  or, even more simply: \n(ALE1 – ALE2) – ACS \nThe countermeasure with the greatest resulting value from this  cost/benefit formula makes the most economic sense to deploy  against the specific asset-threat pairing. \nIt is important to realize that with all the calculations used in the  quantitative risk assessment process (Table 2.2), the end values are  used for prioritization and selection. The values themselves do not  truly reflect real-world losses or costs due to security breaches. This  should be obvious because of the level of guesswork, statistical  analysis, and probability predictions required in the process. \nTABLE 2.2 Quantitative risk analysis formulas \nConcept Formula or meaning \nAsset value (AV) $ \nExposure factor (EF) % Loss \nSingle loss expectancy (SLE) SLE = AV * EF \nAnnualized rate of occurrence (ARO) # / year \nAnnualized loss expectancy (ALE) ALE = SLE * ARO or ALE = \nAV * EF * ARO \nAnnual cost of the safeguard (ACS) $ / year \nValue or benefit of a safeguard (i.e., (ALE1 – ALE2) – ACS  cost/benefit equation) \nOnce you have calculated a cost/benefit for each safeguard for each  asset-threat pair, you must then sort these values. In most cases, the  cost/benefit with the highest value is the best safeguard to  implement for that specific risk against a specific asset. But as with  all things in the real world, this is only one part of the decision-  making process. Although very important and often the primary  guiding factor, it is not the sole element of data. Other items include  actual cost, security budget, compatibility with existing systems,  skill/knowledge base of IT staff, availability of products, political  issues, partnerships, market trends, fads, marketing, contracts, and  favoritism. As part of senior management or even the IT staff, it is  your responsibility to either obtain or use all available data and  information to make the best security decision for your organization. \nFor further discussion of safeguard, security control, and  countermeasure selection issues, see the “Countermeasure Selection  and Implementation” section later in this chapter. \nMost organizations have a limited and all-too-finite budget to work  with. Thus, obtaining the best security for the cost is an essential part  of security management. To effectively manage the security function,  you must assess the budget, the benefit and performance metrics,  and the necessary resources of each security control. Only after a  thorough evaluation can you determine which controls are essential  and beneficial not only to security, but also to your bottom line. \nGenerally, it is not an acceptable excuse that the reason the  organization did not protect against an unacceptable threat or risk  was solely because of a lack of funds. The entirety of safeguard  selections needs to be considered in relation to the current budget. \nCompromise or adjustments of priorities may be necessary in order  to reduce overall risk to an acceptable level with available resources. \nKeep in mind that organizational security should be based on a  business case, be legally justifiable, and be reasonably in line with  security frameworks, regulations, and best practices. \nCountermeasure Selection and Implementation \nSelecting a countermeasure, safeguard, or control (short for security  control ) within the realm of risk management relies heavily on the  cost/benefit analysis results. However, you should consider several  other factors when assessing the value or pertinence of a security  control: \nThe cost of the countermeasure should be less than the value of  the asset. \nThe cost of the countermeasure should be less than the benefit  of the countermeasure. \nThe result of the applied countermeasure should make the cost  of an attack greater for the perpetrator than the derived benefit  from an attack. \nThe countermeasure should provide a solution to a real and  identified problem. (Don't install countermeasures just because  they are available, are advertised, or sound appealing.) \nThe benefit of the countermeasure should not be dependent on  its secrecy. Any viable countermeasure can withstand public  disclosure and scrutiny and thus maintain protection even when  known. \nThe benefit of the countermeasure should be testable and  verifiable. \nThe countermeasure should provide consistent and uniform  protection across all users, systems, protocols, and so on. \nThe countermeasure should have few or no dependencies to  reduce cascade failures. \nThe countermeasure should require minimal human  intervention after initial deployment and configuration. \nThe countermeasure should be tamperproof. \nThe countermeasure should have overrides accessible to  privileged operators only. \nThe countermeasure should provide fail-safe and/or fail-secure  options. \nKeep in mind that security should be designed to support and enable  business tasks and functions. Thus, countermeasures and safeguards  need to be evaluated in the context of a business process. If there is  no clear business case for a safeguard, it is probably not an effective  security option. \nSecurity controls, countermeasures, and safeguards can be  implemented administratively, logically/technically, or physically. \nThese three categories of security mechanisms should be  implemented in a conceptual layered defense-in-depth manner in  order to provide maximum benefit (see Figure 2.4). This idea is  based on the concept that policies (part of administrative controls)  drive all aspects of security and thus form the initial protection layer  around assets. Next, logical and technical controls provide protection  against logical attacks and exploits. Then, the physical controls  provide protection against real-world physical attacks against the  facility and devices. \nFIGURE 2.4 The categories of security controls in a defense-in-  depth implementation \nAdministrative \nThe category of administrative controls includes the policies and  procedures defined by an organization's security policy and other  regulations or requirements. They are sometimes referred to as  management controls , managerial controls , or procedural controls . \nThese controls focus on personnel oversight and business practices. \nExamples of administrative controls include policies, procedures,  hiring practices, background checks, data classifications and  labeling, security awareness and training efforts, reports and  reviews, work supervision, personnel controls, and testing. \nTechnical or Logical \nThe category of technical controls or logical controls involves the  hardware or software mechanisms used to manage access and  provide protection for IT resources and systems. Examples of logical  or technical controls include authentication methods (such as  passwords, smartcards, and biometrics), encryption, constrained  interfaces, access control lists, protocols, firewalls, routers, and  intrusion detection systems (IDSs). \nPhysical \nPhysical controls are security mechanisms focused on providing  protection to the facility and real-world objects. Examples of physical  controls include guards, fences, motion detectors, locked doors,  sealed windows, lights, cable protection, laptop locks, badges, swipe  cards, guard dogs, video cameras, access control vestibules, and  alarms. \nApplicable Types of Controls \nThe term security control refers to a broad range of controls that  perform such tasks as ensuring that only authorized users can log on  and preventing unauthorized users from gaining access to resources. \nControls mitigate a wide variety of information security risks. \nWhenever possible, you want to prevent any type of security problem  or incident. Of course, this isn't always possible, and unwanted  events occur. When they do, you want to detect the events as soon as  possible. And once you detect an event, you want to correct it. \nAs you read the control descriptions, notice that some are listed as  examples of more than one access control type. For example, a fence \n(or perimeter-defining device) placed around a building can be a  preventive control (physically barring someone from gaining access  to a building compound) and/or a deterrent control (discouraging  someone from trying to gain access). \nPreventive \nA preventive control (aka preventative control ) is deployed to  thwart or stop unwanted or unauthorized activity from occurring. \nExamples of preventive controls include fences, locks,  authentication, access control vestibules, alarm systems, separation  of duties, job rotation, data loss prevention (DLP), penetration  testing, access control methods, encryption, auditing, security  policies, security-awareness training, antimalware software,  firewalls, and intrusion prevention systems (IPSs). \nKeep in mind that there are no perfect security  mechanisms or controls. They all have issues that can allow a  threat agent to still cause harm. Controls may have  vulnerabilities, can be turned off, may be avoided, can be  overloaded, may be bypassed, can be tricked by impersonation,  may have backdoors, can be misconfigured, or have other issues. \nThus, this known imperfection of individual security controls is  addressed by using a defense-in-depth strategy. \nDetection \nA detection control (aka detective control ) is deployed to discover or  detect unwanted or unauthorized activity. Detection controls operate  after the fact and can discover the activity only after it has occurred. \nExamples of detection controls include security guards, motion  detectors, recording and reviewing of events captured by security  cameras or CCTV, job rotation, mandatory vacations, audit trails,  honeypots or honeynets, intrusion detection systems (IDSs),  violation reports, supervision and review of users, and incident  investigations. \nCorrective \nA corrective control modifies the environment to return systems to  normal after an unwanted or unauthorized activity has occurred. It  attempts to correct any problems resulting from a security incident. \nCorrective controls can be simple, such as terminating malicious  activity or rebooting a system. They also include antimalware  solutions that can remove or quarantine a virus, backup and restore  plans to ensure that lost data can be restored, and intrusion  prevention systems (IPSs) that can modify the environment to stop  an attack in progress. The control is deployed to repair or restore  resources, functions, and capabilities after a violation of security  policies. Examples include installing a spring on a door so that it will  close and relock, and using file integrity–checking tools, such as  sigverif from Windows, which will replace corrupted boot files upon  each boot event to protect the stability and security of the booted OS. \nRecovery \nRecovery controls are an extension of corrective controls but have  more advanced or complex abilities. A recovery control attempts to  repair or restore resources, functions, and capabilities after a  security policy violation. Recovery controls typically address more  significant damaging events compared to corrective controls,  especially when security violations may have occurred. Examples of  recovery controls include backups and restores, fault-tolerant drive  systems, system imaging, server clustering, antimalware software,  and database or virtual machine shadowing. In relation to business  continuity and disaster recovery, recovery controls can include hot,  warm, and cold sites; alternate processing facilities; service bureaus;  reciprocal agreements; cloud providers; rolling mobile operating  centers; and multisite solutions. \nDeterrent \nA deterrent control is deployed to discourage security policy  violations. Deterrent and preventive controls are similar, but  deterrent controls often depend on individuals being convinced not  to take an unwanted action. Some examples include policies,  security-awareness training, locks, fences, security badges, guards,  access control vestibules, and security cameras. \nDirective \nA directive control is deployed to direct, confine, or control the  actions of subjects to force or encourage compliance with security  policies. Examples of directive controls include security policy  requirements or criteria, posted notifications, guidance from a  security guard, escape route exit signs, monitoring, supervision, and  procedures. \nCompensating \nA compensating control (aka compensation control ) is deployed to  provide various options to other existing controls to aid in the  enforcement and support of security policies. They can be any  controls used in addition to, or in place of, another control. They can  be a means to improve the effectiveness of a primary control or as  the alternate or failover option in the event of a primary control  failure. For example, if a preventive control fails to stop the deletion  of a file, a backup can be a compensating control, allowing for the  restoration of that file. Here's another example: if a building's fire  prevention and suppression systems fail and the building is damaged  by fire so that it is not inhabitable, a compensating control would be  having a disaster recovery plan (DRP) with an alternate processing  site available to support work operations. \nSecurity Control Assessment \nA security control assessment (SCA) is the formal evaluation of a  security infrastructure's individual mechanisms against a baseline or  reliability expectation. The SCA can be performed in addition to or  independently of a full security evaluation, such as a penetration test  or vulnerability assessment. \nThe goals of an SCA are to ensure the effectiveness of the security  mechanisms, evaluate the quality and thoroughness of the risk  management processes of the organization, and produce a report of  the relative strengths and weaknesses of the deployed security  infrastructure. The results of an SCA may confirm that a security  mechanism has sustained its previous level of verified effectiveness  or that action must be taken to address a deficient security control. \nIn addition to verifying the reliability of security controls, an  assessment should consider whether security controls affect privacy. \nSome controls may improve privacy protection, whereas others may  in fact cause a breach of privacy. The privacy aspect of a security  control should be evaluated in light of regulations, contractual  obligations, and the organization's privacy policy/promise. \nGenerally, an SCA is a process implemented by federal agencies  based on NIST SP 800-53 Rev. 5, titled “Security and Privacy \nControls for Information Systems and Organizations.” However,  though defined as a government process, the concept of evaluating  the reliability and effectiveness of security controls should be  adopted by every organization that is committed to sustaining a  successful security endeavor. \nMonitoring and Measurement \nSecurity controls should provide benefits that can be continuously  monitored and measured. If a security control's benefits cannot be  quantified, evaluated, or compared, then it does not actually provide  any security. A security control may provide native or internal  monitoring, or external monitoring may be required. You should  take this into consideration when making initial countermeasure  selections. \nMeasuring the effectiveness of a countermeasure is not always an  absolute value. Many countermeasures offer degrees of improvement  rather than specific hard numbers as to the number of breaches  prevented or attack attempts thwarted. Often to obtain  countermeasure success or failure measurements, monitoring and  recording of events both prior to and after safeguard installation are  necessary. Benefits can only be accurately measured if the starting  point (i.e., the normal point or initial risk level) is known. Part of the  cost/benefit equation takes countermeasure monitoring and  measurement into account. Just because a security control provides  some level of increased security does not necessarily mean that the  benefit gained is cost-effective. A significant improvement in security  should be identified to clearly justify the expense of a new  countermeasure deployment. \nRisk Reporting and Documentation \nRisk reporting is a key task to perform at the conclusion of a risk  analysis. Risk reporting involves the production of a risk report and a  presentation of that report to the interested/relevant parties. For  many organizations, risk reporting is an internal concern only,  whereas other organizations may have regulations that mandate  third-party or public reporting of their risk findings. A risk report  should be accurate, timely, comprehensive of the entire organization,  clear and precise to support decision-making, and updated on a  regular basis. \nInternal and external reporting in risk management are processes  through which organizations communicate information about their  risk-related activities, assessments, and strategies to different  stakeholders. These two forms of reporting serve distinct purposes  and audiences: \nInternal reporting in risk management is primarily intended for  an organization's internal stakeholders, including executives,  management, employees, and relevant departments. The  primary purpose is to support informed decision-making, risk  mitigation, and the overall management of risks within the  organization. Internal reports typically contain detailed  information about the organization's risk assessments, risk  exposures, risk control measures, and the effectiveness of risk  management strategies. These reports may include risk  registers, risk heat maps, key risk indicators (KRIs), and the  results of risk assessments. \nExternal reporting in risk management is intended for external  stakeholders, including regulatory bodies, shareholders,  investors, creditors, customers, and the general public. The  primary purpose is to provide transparency and disclosure of an  organization's risk profile, risk exposure, and risk management  practices to external parties. External reports typically focus on  high-level information about the organization's risk exposure, its  policies and practices for risk management, and the potential  impact of risks on the organization's financial health and  operations. These reports may include annual reports, financial  statements, disclosures in compliance with accounting  standards, and regulatory filings. \nIt's important for organizations to maintain a clear distinction  between internal and external reporting in risk management. \nBalancing these two forms of reporting is essential for effective risk  management and maintaining transparency and trust with both  internal and external audiences. \nA risk register or risk log is a document that inventories all the  identified risks to an organization or system or within an individual  project. A risk register is used to record and track the activities of  risk management, including the following: \nIdentifying risks \nEvaluating the severity of and prioritizing those risks \nPrescribing responses to reduce or eliminate the risks \nTracking the progress of risk mitigation \nA risk register can serve as a project management document to track  completion of risk response activities as well as a historical record of  risk management over time. The contents of a risk register could be  shared with others to facilitate a more realistic evaluation of real-  world threats and risks through the amalgamation of risk  management activities by other organizations. \nA risk matrix or risk heat map is a form of risk assessment that is  performed on a basic graph or chart. It is sometimes labeled as a  qualitative risk assessment. The simplest form of a risk matrix is a \n3×3 grid comparing probability and damage potential. This was  covered in Chapter 1. \nContinuous Improvement \nRisk analysis is performed to provide upper management with the  details necessary to decide which risks should be mitigated, which  should be transferred, which should be deterred, which should be  avoided, and which should be accepted. The result is a cost/benefit  comparison between the expected cost of asset loss and the cost of  deploying safeguards against threats and vulnerabilities. Risk  analysis identifies risks, quantifies the impact of threats, and aids in  budgeting for security. It helps integrate the needs and objectives of  the security policy with the organization's business goals and  intentions. The risk analysis/risk assessment is a “point-in-time”  metric. Threats and vulnerabilities constantly change, and the risk  assessment needs to be redone periodically in order to support  continuous improvement. \nSecurity is always changing. Thus, any implemented security  solution requires updates and changes over time. If a continuous  improvement path is not provided by a selected countermeasure, it  should be replaced with one that offers scalable improvements to  security. \nAn enterprise risk management (ERM) program can be evaluated  using the Risk Maturity Model (RMM) . An RMM assesses the key  indicators and activities of a mature, sustainable, and repeatable risk  management process. There are several RMM systems, each  prescribing various means to achieve greater risk management  capability. They generally relate the assessment of risk maturity  against a five-level model (similar to that of the Capability Maturity \nModel [CMM]; see Chapter 20, “Software Development Security”). \nThe typical RMM levels are as follows: \n1. Ad hoc. A chaotic starting point from which all organizations  initiate risk management. \n2. Preliminary. Loose attempts are made to follow risk  management processes, but each department may perform risk  assessment uniquely. \n3. Defined. A common or standardized risk framework is adopted  organization-wide. \n4. Integrated. Risk management operations are integrated into  business processes, metrics are used to gather effectiveness  data, and risk is considered an element in business strategy  decisions. \n5. Optimized. Risk management focuses on achieving objectives  rather than just reacting to external threats, increased strategic  planning is geared toward business success rather than just  avoiding incidents, and lessons learned are reintegrated into the  risk management process. \nTo learn more about RMM, see “Developing a Generic Risk Maturity \nModel (GRMM) for Evaluating Risk Management in Construction \nProjects.” This is an interesting study of numerous RMM systems  and the attempt to derive a generic RMM from the common  elements. \nLegacy Risk \nAn often-overlooked area of risk is that of legacy devices, which may  be EOL and/or EOS/EOSL: \nEnd of life (EOL) is the point at which a manufacturer no longer  produces a product. Service and support may continue for a  period of time after EOL, but no new versions will be made  available for sale or distribution. An EOL product should be  scheduled for replacement before it fails or reaches end of  support (EOS) or end of service life (EOSL). EOL is sometimes  perceived or used as the equivalent of EOSL. \nEnd of service-life (EOSL) or end of support (EOS) are those  systems that are no longer receiving updates and support from  the vendor. If an organization continues to use an EOSL system,  then the risk of compromise is high because any future  exploitation will never be patched or fixed. It is of utmost  importance to move off EOSL systems in order to maintain a  secure environment. It might not seem initially cost-effective or  practical to move away from a solution that still works just  because the vendor has terminated support. However, the  security management efforts you will expend will likely far  exceed the cost of developing and deploying a modern system–  based replacement. For example, Windows 10 will reach its \nEOSL on October 14, 2025. Microsoft recommends moving on to \nWindows 11 by that deadline. \nRisk Frameworks \nA risk framework is a guideline or recipe for how risk is to be  assessed, resolved, and monitored. NIST established the Risk \nManagement Framework (RMF) and the Cybersecurity Framework \n(CSF). These are both U.S. government guides for establishing and  maintaining security, but the CSF is designed for critical  infrastructure and commercial organizations, whereas the RMF  establishes mandatory requirements for federal agencies. RMF was  established in 2010, and the CSF was established in 2014. \nExam Outline objective 1.9.9 includes a list of risk  frameworks. All of these risk frameworks are also listed in  objective 1.3.4 as security control frameworks. It is common for a  security control framework to be either directly used as a risk  framework or have a subset of elements that are a risk  framework. The following concepts are covered in Chapter 1 as  security control frameworks, but they are also relevant to the  concepts here in Chapter 2 as risk frameworks: \nInternational Organization for Standardization (ISO) \nNational Institute of Standards and Technology (NIST) \nControl Objectives for Information and Related Technologies \n(COBIT) \nSherwood Applied Business Security Architecture (SABSA) \nPayment Card Industry (PCI) \nThe Cybersecurity Framework (CSF) 2.0 (released in early 2024) is  based on a framework core that consists of six functions: \nIdentify. Understand and catalog assets, risks, and  vulnerabilities. \nProtect. Implement safeguards to protect assets and data. \nDetect. Develop and deploy mechanisms for identifying and  detecting security incidents. \nRespond. Define strategies and processes for responding to and  mitigating cybersecurity incidents. \nRecover. Develop and implement strategies for recovery and  resilience after a cybersecurity incident. \nGovern. Establish, communicate, and oversee roles,  responsibilities, and policies that ensure a proactive and  adaptive approach to cybersecurity. \nThe CSF is not a checklist or procedure—it is a prescription of  operational activities that are to be performed on an ongoing basis  for the support and improvement of security over time. The CSF is  more of an improvement system rather than its own specific risk  management process or security infrastructure. The CSF provides a  structured approach for organizations to assess, develop, and  enhance their cybersecurity posture and resilience against  cyberthreats. \nThe Risk Management Framework (RMF) , defined by NIST in SP \n800-37 Rev. 2, is a structured and comprehensive framework used  by the U.S. federal government and other organizations to manage  and mitigate information security and cybersecurity risks associated  with their information systems and networks. RMF establishes  mandatory security requirements for U.S. federal agencies. The RMF  has seven phases (six of which are used cyclically) (see Figure 2.5): \nPrepare to execute the RMF from an organization- and system-  level perspective by establishing a context and priorities for  managing security and privacy risk. \nCategorize the system and the information processed, stored,  and transmitted by the system based on an analysis of the  impact of loss. \nSelect an initial set of controls for the system and tailor the  controls as needed to reduce risk to an acceptable level based on  an assessment of risk. \nImplement the controls and describe how the controls are  employed within the system and its environment of operation. \nAssess the controls to determine if the controls are  implemented correctly, operating as intended, and producing  the desired outcomes with respect to satisfying the security and  privacy requirements. \nAuthorize the system or common controls based on a  determination that the risk to organizational operations and  assets, individuals, other organizations, and the Nation is  acceptable. \nMonitor the system and the associated controls on an ongoing  basis to include assessing control effectiveness, documenting  changes to the system and environment of operation,  conducting risk assessments and impact analyses, and reporting  the security and privacy posture of the system. \n[From NIST SP 800-37 Rev. 2] \nFIGURE 2.5 The elements of the risk management framework \n(RMF) (from NIST SP 800-37 Rev. 2, Figure 2) \nThe later six phases are to be performed in order and repeatedly  throughout the life of the organization. RMF is intended as a risk  management process to identify and respond to threats. Use of the \nRMF will result in the establishment of a security infrastructure and  a process for ongoing improvement of the secured environment. \nThere is significantly more detail about RMF in the official NIST  publication; we encourage you to review this publication in its  entirety for a complete perspective on the RMF. \nAnother important risk framework or guide to risk management is  the ISO/IEC 31000 document “Risk Management — Guidelines.” \nThis is a high-level overview of the idea of risk management that  many will benefit from reading. This ISO guideline is intended to be  useful to any type of organization, whether government or private  sector. Another related guideline is ISO/IEC 27005, “Information \nSecurity, Cybersecurity and Privacy Protection: Guidance on \nManaging Information Security Risks.” \nA companion guide, ISO/IEC 31004 “Risk \nManagement — Guidance for the Implementation of ISO 31000” \n( www.iso.org/standard/56610.html ), might also be of interest. \nHowever, ISO 31004 has been withdrawn and had not been  replaced as of Q1 2024. \nWhile the NIST RMF is a common focus of the CISSP, you might  want to review other risk management frameworks for use in the real  world. Please consider the following for future research: \nThe Committee of Sponsoring Organizations (COSO) of the \nTreadway Commission's Enterprise Risk Management — \nIntegrated Framework \nISACA's Risk IT Framework \nOperationally Critical Threat, Asset, and Vulnerability \nEvaluation (OCTAVE) \nFactor Analysis of Information Risk (FAIR) \nThreat Assessment and Remediation Analysis (TARA) \nUnderstanding that there are a number of well-recognized  frameworks and that selecting one that fits your organization's  requirements and style is important. \nSocial Engineering \nSocial engineering is a form of attack that exploits human nature  and human behavior. People are a weak link in security because they  can make mistakes, be fooled into causing harm, or intentionally  violate company security. Social engineering attacks exploit human  characteristics such as a basic trust in others, a desire to provide  assistance, or a propensity to show off. It is important to consider the  risks that personnel represent to your organization and implement  security strategies to minimize and handle those risks. \nSocial engineering attacks take two primary forms: convincing  someone to perform an unauthorized operation or convincing  someone to reveal confidential information. In just about every case,  the social engineering attacker tries to convince the victim to  perform some activity or reveal a piece of information that they  shouldn't. The result of a successful attack is information leakage or  the attacker being granted logical or physical access to a secure  environment. \nHere are some example scenarios of common social engineering  attacks: \nA website claims to offer free temporary access to its products  and services, but it requires web browser and/or firewall  alterations in order to download the access software. These  alterations may reduce the security protections or encourage the  victim to install malicious browser helper objects (also known as  plug-ins, extensions, or add-ons). \nThe help desk receives a call from someone claiming to be a  department manager who is currently involved in a sales  meeting in another city. The caller claims to have forgotten their  password and needs it to be reset so that they can log in  remotely to download an essential presentation. \nSomeone who looks like a repair technician claims a service call  was received for a malfunctioning device in the building. The \n“technician” is sure the unit can be accessed from inside your  office work area and asks to be given access to repair the system. \nIf a worker receives a communication from someone asking to  talk with a coworker by name, and there is no such person  currently or previously working for the organization, this could  be a ruse to either reveal the names of actual employees or  convince you to “provide assistance” because the caller has  incorrect information. \nWhen a contact on a discussion forum asks personal questions,  such as your education, history, and interests, they could be  focused on learning the answers to password reset questions. \nSome of these examples may also be legitimate and benign  occurrences, but you can see how they could mask the motives and  purposes of an attacker. Social engineers attempt to mask and hide  their true intentions by crafting their attacks to seem as normal and  typical as possible. \nWhenever a security breach occurs, an investigation should be  performed to determine what was affected and whether the attack is  ongoing. Personnel should be retrained to detect and avoid similar  social engineering attacks in the future. Although social engineering  attacks primarily focus on people, the results of an attack can be a  disclosure of private or confidential materials, physical damage to a  facility, or remote access to an IT environment. Therefore, any  attempted or successful social engineering breach should be  thoroughly investigated and responded to. \nMethods to protect against social engineering include the following: \nTraining personnel about social engineering attacks and how to  recognize common signs \nRequiring authentication when performing activities for  personnel over the phone \nDefining restricted information that is never communicated over  the phone or through plaintext communications such as  standard email \nAlways verifying the credentials of a repair person and verifying  that a real service call was placed by authorized personnel \nNever following the instructions of an email without verifying  the information with at least two independent and trusted  sources \nAlways erring on the side of caution when dealing with anyone  you don't know or recognize, whether in person, over the phone,  or over the Internet/network \nIf several workers report the same odd event, such as a call or email,  an investigation should look into what the contact was about, who  initiated it, and what the intention or purpose was. \nThe most important defense against social engineering attacks is  user education and awareness training. A healthy dose of paranoia  and suspicion will help users detect or notice more social engineering  attack attempts than without such preparation. Training should  include role-playing and walking through numerous examples of the  various forms of social engineering attacks. However, keep in mind  that attackers are constantly altering their approaches and improving  their means of attack. So, keeping current with newly discovered  means of social engineering attacks is also necessary to defend  against this human-focused threat. \nUsers should receive training when they first enter an organization,  and they should receive periodic refresher training, even if it's just an  email from the administrator or training officer reminding them of  the threats. \nSocial Engineering Principles \nSocial engineering works so well because we're human. The  principles of social engineering attacks are designed to focus on  various aspects of human nature and take advantage of them. \nAlthough not every target succumbs to every attack, most of us are  vulnerable to one or more of the following common social  engineering principles. \nAuthority \nAuthority is an effective technique because most people are likely to  respond to authority with obedience. The trick is to convince the  target that the attacker is someone with valid internal or external  authority. Some attackers claim their authority verbally, and others  assume authority by wearing a costume or uniform. \nAn example is an email sent using the spoofed email of the CEO in  which workers are informed that they must visit a specific universal  resource locator (URL)/universal resource indicator (URI) to fill out  an important HR document. This method works when the victims  blindly follow instructions that claim to be from a person of  authority. \nIntimidation \nIntimidation can sometimes be seen as a derivative of the authority  principle. Intimidation uses authority, confidence, or even the threat  of harm to motivate someone to follow orders or instructions. Often,  intimidation is focused on exploiting uncertainty in a situation where  a clear directive of operation or response isn't defined. \nAn example is expanding on a previous CEO and HR document email  to include a statement claiming that employees will face a penalty if  they do not fill out the form promptly. The penalty could be a loss of  casual Friday, exclusion from Taco Tuesday, a reduction in pay, or  even termination. \nConsensus \nConsensus or social proof is the act of taking advantage of a person's  natural tendency to mimic what others are doing or are perceived as  having done in the past. For example, bartenders often seed their tip  jar with money to make it seem as if previous patrons were  appreciative of the service. As a social engineering principle, the  attacker attempts to convince the victim that a particular action or  response is necessary to be consistent with social norms or previous  occurrences. \nAn example is an attacker claiming that a worker who is currently  out of the office promised a large discount on a purchase and that the  transaction must occur now with you as the salesperson. \nScarcity \nScarcity is a technique used to convince someone that an object has  a higher value based on the object's scarcity. This could relate to the  existence of only a few items produced or limited opportunities, or  that the majority of stock is sold and only a few items remain. \nAn example is an attacker claiming that there are only two tickets left  to your favorite team's final game, and it would be a shame if  someone else enjoyed the game rather than you. If you don't grab  them now, the opportunity will be lost. This principle is often  associated with the principle of urgency. \nFamiliarity \nFamiliarity or liking, as a social engineering principle, attempts to  exploit a person's native trust in that which is familiar. The attacker  often tries to appear to have a common contact or relationship with  the target, such as mutual friends or experiences, or uses a facade to  take on the identity of another company or person. If the target  believes a message is from a known entity, such as a friend or their  bank, they're much more likely to trust the content and even act or  respond. \nAn example is an attacker using a vishing attack while falsifying the  caller ID as their doctor's office. \nTrust \nTrust as a social engineering principle involves an attacker working  to develop a relationship with a victim. This may take seconds or  months, but eventually, the attacker attempts to use the value of the  relationship (the victim's trust in the attacker) to convince the victim  to reveal information or perform an action that violates company  security. \nAn example is an attacker approaching you as you walk along the  street, when they appear to pick up a $100 bill from the ground. The  attacker asks you to hold the money while they ask around to find  someone who lost it. When they return, the attacker says that since  the two of you were close when the money was found, you two should  split it. They ask if you have change to split the found money. Since  the attacker had you hold the money while they went around to find  the person who lost it, this might have caused you to have trust in  this stranger so that you are willing to take cash out of your wallet  and give it to them. But you won't realize until later that the $100  was counterfeit and you've been robbed. \nUrgency \nUrgency often dovetails with scarcity, because the need to act  quickly increases as scarcity indicates a greater risk of missing out. \nUrgency is often used as a method to get a quick response from a  target before they have time to carefully consider or refuse  compliance. \nAn example is an attacker using an invoice scam through business  email compromise (BEC) to convince you to pay an invoice  immediately because either an essential business service is about to  be cut off or the company will be reported to a collection agency. \nEliciting Information \nEliciting information is the activity of gathering or collecting  information from systems or people. In the context of social  engineering, it is used as a research method in order to craft a more  effective pretext. A pretext is a false statement crafted to sound  believable in order to convince you to act or respond in favor of the  attacker. Any and all of the social engineering techniques covered in  this chapter can be used both as a weapon to harm the target victim  and as a means to obtain more information (or access). Thus, social  engineering is a tool of both reconnaissance and attack. Data  gathered via social engineering can be used to support a physical or  logical/technical attack. \nAny means or method by which a social engineer can gather  information from the target is eliciting information. Any fact, truth,  or detail that can be collected, gathered, or gleaned from the target  can be used to form a more complete and believable pretext or false  story, which in turn may increase the chance of success of the next  level or stage of an attack. \nConsider that many cyberattacks are similar to actual warfare  attacks. The more the attacker knows about the targeted enemy, the  more effectively a plan of attack can be crafted. \nDefending against eliciting information events generally involves the  same precautions as those used against social engineering. Those  include classifying information, controlling the movement of  sensitive data, watching for attempted abuses, training personnel,  and reporting any suspicious activity to the security team. \nPrepending \nPrepending is the adding of a term, expression, or phrase to the  beginning or header of some other communication. Often,  prepending is used in order to further refine or establish the pretext  of a social engineering attack, such as spam, hoaxes, and phishing. \nAn attacker can precede the subject of an attack message with RE: or \nFW: (which indicates “in regard to” and “forwarded,” respectively) to  make the receiver think the communication is the continuance of a  previous conversation rather than the first contact of an attack. \nOther often-used prepending terms are EXTERNAL, PRIVATE, and \nINTERNAL. \nPrepending attacks can also be used to fool filters, such as spam  filters, antimalware, firewalls, and intrusion detection systems \n(IDSs). This could be accomplished with SAFE, FILTERED, \nAUTHORIZED, VERIFIED, CONFIRMED, or APPROVED, among  others. It might even be possible to interject alternate email header  values, such as “X-Spam-Category: LEGIT” or “X-Spam-Condition: \nSAFE,” which could fool spam and abuse filters. \nPhishing \nPhishing is a form of social engineering attack focused on stealing  credentials or identity information from any potential target. It is  derived from “fishing” for information. Phishing can be waged in  numerous ways using a variety of communication media, including  email and the web; in face-to-face interactions or over the phone;  and even through more traditional communication mediums, such as  the post office or couriered packages. \nAttackers send phishing emails indiscriminately as spam, without  knowing who will get them but in the hope that some users will  respond. Phishing emails sometimes inform the user of a bogus  problem and say that if the user doesn't take action, the company will  lock the user's account. The From email address is often spoofed to  look legitimate, but the Reply To email address is an account  controlled by the attacker. Sophisticated attacks include a link to a  bogus website that looks legitimate, but that captures credentials and  passes them to the attacker. \nSometimes, the goal of phishing is to install malware on user  systems. The message may include an infected file attachment or a  link to a website that installs a malicious drive-by download without  the user's knowledge. \nA drive-by download is a type of malware that  installs itself without the user's knowledge when the user visits a  website. Drive-by downloads take advantage of vulnerabilities in  browsers or plug-ins. \nTo defend against phishing attacks, end users should be trained to do  the following: \nBe suspicious of unexpected email messages or email messages  from unknown senders. \nNever open unexpected email attachments. \nNever share sensitive information via email. \nAvoid clicking any link received via email, instant messaging, or  a social network message. \nIf a message claims to be from a known source, such as a website  commonly visited, the user should visit the supposed site by using a  preestablished bookmark or by searching for the site by name. If,  after accessing their account on the site, a duplicate message does  not appear in the online messaging or alert system, the original  message is likely an attack or a fake. Any such false communications  should be reported to the targeted organization, and then the  message should be deleted. If the attack relates to your organization  or employer, it should be reported to the security team there as well. \nOrganizations should consider the consequences and increased risk  that granting workers access to personal email and social networks  through company systems pose. Some companies have elected to  block access to personal Internet communications while using  company equipment or through company-controlled network  connections. This reduces the risk to the organization even if an  individual succumbs to a phishing attack on their own. \nA phishing simulation is a tool used to evaluate the ability of  employees to resist or fall for a phishing campaign. A security  manager or penetration tester crafts a phishing attack so that any  clicks by victims are redirected to a notification that the phishing  message was a simulation and they may need to attend additional  training to avoid falling for a real attack. \nSmishing \nShort Message Service (SMS) phishing or smishing (spam over  instant messaging [SPIM]) is a social engineering attack that occurs  over or through standard text messaging services. There are several  smishing threats to watch out for, including these: \nText messages asking for a response or reply. In some cases,  replies could trigger a cramming event. Cramming is when a  false or unauthorized charge is placed onto your mobile service  plan. \nText messages could include a hyperlink/URI/URL to a  phishing or scam website or trigger the installation of malicious  code. \nText messages could contain pretexts to get you involved in a  conversation. \nText messages could include phone numbers. Always research a  phone number before calling it, especially from an unknown  source. There are phone numbers with the same structure as  local or domestic numbers, but that may actually be long  distance and not included in your calling service or plan, and  calling them could cause a connection charge and a high per-  minute toll charge. \nAlthough smishing refers to SMS-based attacks, it can sometimes be  used to refer to similar attacks occurring through Multimedia \nMessaging Service (MMS), Rich Communication Services (RCS), \nGoogle Chat, Android Messages (i.e., SMS), Facebook Messenger, \nWeChat, Apple/iPhone iMessage, WhatsApp, Slack, Discord, \nMicrosoft Teams, and so on. \nVishing \nVishing (i.e., voiced-based phishing) or SpIT (spam over internet  telephony) is phishing done over any telephony or voice  communication system. This includes traditional phone lines, voice-  over-IP (VoIP) services, and mobile phones. Most of the social  engineers waging vishing campaigns use VoIP technology to support  their attacks. VoIP allows the attacker to be located anywhere in the  world, make free phone calls to victims, and be able to falsify or  spoof their origin caller ID. \nVishing calls can display a caller ID or phone number from any  source the attacker thinks might cause the victim to answer the call. \nSome attackers just duplicate your area code and prefix in order to  trick the victim into thinking the call is from a neighbor or other local  entity. Vishing is simply another form of phishing attack. Vishing  involves the pretexting of the displayed caller ID and the story the  attacker spouts. Always assume caller ID is false or at least incorrect. \nSpear Phishing \nSpear phishing is a more targeted form of phishing where the  message is crafted and directed specifically to a group of individuals. \nOften, attackers use a stolen customer database to send false  messages crafted to seem like a communication from the  compromised business but with falsified source addresses and  incorrect URI/URLs. The hope of the attacker is that someone who  already has an online/digital relationship with an organization is  more likely to fall for the false communication. \nAll of the concepts and defenses discussed in the previous section, \n“Phishing,” apply to spear phishing. \nSpear phishing can also be crafted to seem as if it originated from a \nCEO or other top office in an organization. This version of spear  phishing is called business email compromise (BEC) . BEC is often  focused on convincing members of accounting or financial  departments to transfer funds or pay invoices based on instructions  seeming to originate from a boss, manager, or executive. BEC has  defrauded organizations of billions of dollars in the last few years. \nBEC is also known as CEO fraud or CEO spoofing . \nAs with most forms of social engineering, defenses for spear phishing  require the following: \nLabeling information, data, and assets with their value,  importance, or sensitivity \nTraining personnel on proper handling of those assets based on  their labels \nRequesting clarification or confirmation on any actions that  seem abnormal, off-process, or otherwise overly risky to the  organization \nSome abusive concepts to watch out for are requests to pay bills or  invoices using prepaid gift cards, changes to wiring details (especially  at the last minute), or requests to purchase products that are atypical  for the requester and that are needed in a rush. When seeking to  confirm a suspected BEC, do not use the same communication  medium that the BEC used. Make a phone call, go to their office,  text-message their cell phone, or use the company-approved internal  messaging service. Establishing a second “out-of-band” contact with  the requester will further confirm whether the message is legitimate  or false. \nWhaling \nWhaling is a form of spear phishing that targets specific high-value  individuals (by title, by industry, from media coverage, and so forth),  such as the CEO or other C-level executives, administrators, or high-  net-worth clients. Whaling attacks require significantly more  research, planning, and development on the part of the attackers in  order to fool the victim. That is because these high-level personnel  are often well aware that they are a high-value target. \nSpam \nSpam is any type of email that is undesired and/or unsolicited. But  spam is not just unwanted advertisements; it can also include  malicious content and attack vectors as well. Spam is often used as  the carrier of social engineering attacks. \nSpam is a problem for numerous reasons: \nSome spam carries malicious code such as viruses, logic bombs,  ransomware, or Trojan horses. \nSome spam carries social engineering attacks (also known as  hoax messages). \nUnwanted email wastes your time while you sort through it,  looking for legitimate messages. \nSpam wastes internet resources: storage capacity, computing  cycles, and throughput. \nThe primary countermeasure against spam is an email spam filter. \nThese email filters can examine the header, subject, and contents of a  message to look for keywords or phrases that identify it as a known  type of spam, and then take the appropriate actions to discard,  quarantine, or block the message. \nAntispam software is a variation on the theme of antimalware  software. It specifically monitors email communications for spam  and other forms of unwanted email in order to stop hoaxes, identity  theft, waste of resources, and possible distribution of malicious  software. Antispam software can often be installed on email servers  to protect an entire organization as well as on local client systems for  supplemental filtering by the user. \nIn addition to client application or client-side spam filters, there are  enterprise spam tools, including Sender Policy Framework (SPF), \nDomain Keys Identified Mail (DKIM), and Domain Message \nAuthentication Reporting and Conformance (DMARC) (see Chapter \n12, “Secure Communications and Network Attacks”). \nAnother important issue to address when managing spam is spoofed  email. A spoofed email is a message that has a fake or falsified source  address. DMARC is used to filter spoofed messages. \nSpam is most commonly associated with email, but spam also exists  in instant messaging (IM), SMS, USENET (Network News Transfer \nProtocol [NNTP]), social media apps, and web content (such as  threaded discussions, forums, comments, and blogs). Failing to block  spam allows it to waste resources, consume bandwidth, distract  workers from productive activities, and potentially expose users and  systems to malware. \nShoulder Surfing \nShoulder surfing is often a physical world or in-person form of social  engineering. Shoulder surfing occurs when someone is able to watch  a user's keyboard or view their display. Often, shoulder surfing is  stopped by dividing worker groups by sensitivity levels and limiting  access to certain areas of the building by using locked doors. \nAdditionally, users should not orient their displays to be visible  through windows (from outside) or walkways/doorways (for internal  issues). And they should not work on sensitive data while in a public  space. Password fields should mask characters as they are typed. \nAnother defense against shoulder surfing is the use of screen filters,  which limit the field of view to mostly a perpendicular orientation. \nInvoice Scams \nInvoice scams are social engineering attacks that often attempt to  steal funds from an organization or individuals through the  presentation of a false invoice, often followed by strong inducements  to pay. Attackers often try to target members of financial  departments or accounting groups. Some invoice scams are actually  spear phishing scams in disguise. It is also possible for a social  engineer to use an invoice scam approach over a voice connection. \nThis attack is similar to some forms of the BEC concept. In fact, some  invoice scams are combined with BEC so that the invoice sent to an  accounting worker is seemingly sent from the CEO. This intertwining  of attack elements adds more legitimacy to the invoice, thus  potentially convincing the target to pay the invoice. \nTo protect against invoice scams, workers must be informed of the  proper channels through which they should receive invoices and the  means by which to confirm that any invoices are actually valid. One  such method is the use of assigned purchase order numbers from  authorized work orders, which must then be included on all related  invoices. When invoices arrive, they should be compared against the  expected bills based on approved acquisitions. Any invoice that is not  expected or otherwise abnormal should trigger a face-to-face  discussion with the supervisor or other financial executive. \nSeparation of duties should exist between workers who place orders  for products and services and those who pay invoices. These two  groups should also have a third group that audits and governs their  activities. All potential acquisitions should be reviewed and approved  by a supervisor, and then notice of the acquisition should be sent to  the accounts payable department by that supervisor. \nDiscovery of any fraudulent invoices must be reported to the  authorities. Digital transmission and postal delivery of invoice scams  are considered a crime of fraud and potential theft. The sending of  false invoices through the U.S. Postal Service may be considered  postal fraud as well. \nHoax \nA hoax is a form of social engineering designed to convince targets to  perform an action that will cause problems or reduce their IT  security. A hoax can be an email that proclaims some imminent  threat is spreading across the Internet and that you must perform  certain tasks in order to protect yourself. The hoax often claims that  taking no action will result in harm. Victims may be instructed to  delete files, change configuration settings, or install fraudulent  security software, which results in a compromised OS, a nonbooting \nOS, or a reduction in their security defenses. Additionally, hoax  emails often encourage the victim to forward the message to all their  contacts in order to “spread the word.” Hoax messages are often  spoofed without a verifiable origin. \nWhenever you encounter a potential hoax or just are concerned that  a claimed threat is real, do the research. A couple of great places to  check for hoax information or to look up your suspected hoax  message are snopes.com and phishtank.com . \nImpersonation and Masquerading \nImpersonation is the act of taking on the identity of someone else. \nThis can take place in person, over the phone, through email, by  logging into someone's account, or through any other means of  communication. Impersonation can also be known as  masquerading , spoofing, and even identity fraud. In some  circumstances, impersonation is defined as a more sophisticated and  complex attack, whereas masquerading is amateurish and simpler. \nThis distinction is emphasized in the difference between renting an \nElvis costume (i.e., masquerading) for a party versus being a career \nElvis impersonator. \nDefenses against physical location impersonation can include the use  of access badges and security guards, and requiring the presentation  and verification of ID at all entrances. If nontypical personnel are to  visit a facility, the visit should be prearranged and the security  guards provided with reasonable and confirmed notice that a  nonemployee will be visiting. The organization from which the  visitor hails should provide identification details, including a photo \nID. When the person arrives, their identity should be compared  against the provided credentials. In most secure environments,  visitors are not allowed to roam free. Instead, an escort must  accompany the visitor for their entire time within the company's  security perimeter. \nTailgating and Piggybacking \nTailgating occurs when an unauthorized entity gains access to a  facility under the authorization of a valid worker but without their  knowledge. This attack can occur when a worker uses their valid  credentials to unlock and open a door, then walks into the building  as the door closes, granting the attacker the opportunity to stop the  door from closing and to sneak in without the victim realizing. \nTailgating is an attack that does not depend on the consent of the  victim—just their obliviousness to what occurs behind them as they  walk into a building. \nEach and every time a user unlocks or opens a door, they should  ensure that it is closed and locked before walking away. This action  alone eliminates tailgating, but it does require that workers change  their behavior. There is also social pressure to hold open a door for  someone who is walking up behind you, but this courtesy should not  be extended to include secure entry points, even if you think you  know the person walking up behind. \nCompany policy should be focused on changing user behavior toward  more security, but realize that working against human nature is very  hard. Therefore, other means of enforcing tailgating protections  should be implemented. These can include the use of access control  vestibules (previously known as mantraps), security cameras, and  security guards. Security cameras act as a deterrent more than a  prevention, but having a recording of tailgating events can help track  down the perpetrators as well as pinpoint the workers who need  more security training. A security guard can watch over an entrance  to ensure that only valid personnel are let through a security  checkpoint. \nA problem similar to tailgating is piggybacking. Piggybacking occurs  when an unauthorized entity gains access to a facility under the  authorization of a valid worker by tricking the victim into providing  consent. This could happen when the intruder feigns the need for  assistance by holding a large box or lots of paperwork and asks  someone to “hold the door.” The goal of the intruder is to distract the  victim while the attacker gains access in order to prevent the victim  from realizing that the attacker did not provide their own  credentials. This ploy depends on the good nature of most people to  believe the pretext, especially when the intruder seems to have \n“dressed the part.” \nWhen someone asks for assistance in holding open a secured door,  users should ask for proof of authorization or offer to swipe the  person's access card on their behalf. Or, the worker should redirect  the person to the main entrance controlled by security guards or call  over a security guard to handle the situation. Also, the use of access  control vestibules, turnstiles, and security cameras is useful in  response to piggybacking. These controls reduce the chance of an  outsider bluffing their way into your secured areas. \nBaiting \nWhen direct physical entry isn't possible or attempts fail,  adversaries may use a baiting technique to deposit malware onto  internal systems. Baiting is when the attacker drops USB sticks,  optical discs, or even wallets in a location where a worker is likely  to encounter it. The hope is the worker will plug the USB drive or  insert the disc into a work computer where the malware will auto-  infect the system. The wallet often has a note in it with a URL or \nIP address along with credentials. The hope is the victim will visit  the site from a work computer and be infected by a drive-by-  download event or be tricked by a phishing site. \nDumpster Diving \nDumpster diving is the act of digging through trash, discarded  equipment, or abandoned locations in order to obtain information  about a target organization or individual. Typical collected items  include old calendars, calling lists, handwritten meeting notes,  discarded forms, product boxes, user manuals, sticky notes, printed  reports, or the test sheet from a printer. Just about anything that is  of any minor internal value or sensitivity is a treasure to be  discovered through dumpster diving. The materials gathered via  dumpster diving can be used to craft a more believable pretext. \nTo prevent dumpster diving, or at least reduce its value to an  attacker, all documents should be shredded and/or incinerated  before being discarded. Additionally, no storage media should ever  be discarded in the trash; use a secure disposal technique or service. \nSecure storage media disposal often includes incineration,  shredding, or chipping. \nIdentity Fraud \nIdentity fraud and identity theft are terms that are often used  interchangeably. In fact, the U.S. Department of Justice (DoJ) states  that “Identity theft and identity fraud are terms used to refer to all  types of crime in which someone wrongfully obtains and uses  another person's personal data in some way that involves fraud or  deception, typically for economic gain.” Identity fraud and identity  theft can be both the purpose of a social engineering attack (i.e., to  steal PII) as well as a tool used to further the success of a social  engineering attack. \nHowever, it is important to recognize that while we can use the terms  as synonyms (especially in casual conversation), there is more value  to be gained by understanding how they are different. \nIdentity theft is the act of stealing someone's identity. Specifically,  this can refer to the initial act of information gathering or elicitation  where usernames, emails, passwords, answers to secret questions,  credit card numbers, Social Security numbers, healthcare services  numbers, and other related and relevant facts are stolen or otherwise  obtained by the attacker. So, the first definition of identity theft is the  actual theft of the credentials and information for someone's  accounts or financial positions. \nA second definition of identity theft is when those stolen credentials  and details are used to take over someone's account. This could  include logging into their account on an online service; making false  charges to their credit card, ATM card, or debit card; writing false  checks against their checking account; or opening a new line of credit  in the victim's name using their Social Security number. When an  attacker steals and uses a victim's credentials, this is known as  credential hijacking . \nThis second definition of identity theft is also very similar to the  definition of identity fraud. Fraud is when you claim something that  is false to be true. Identity fraud is when you falsely claim to be  someone else through the use of stolen information from the victim. \nIdentity fraud is criminal impersonation or intentional deception for  personal or financial gain. Examples of identity fraud include taking  employment under someone else's Social Security number, initiating  phone service or utilities in someone else's name, or using someone  else's health insurance to gain medical services. \nYou can consider identity theft and identity fraud to be a form of  spoofing. Spoofing is any action to hide a valid identity, often by  taking on the identity of something else. In addition to the concept of  human-focused spoofing (i.e., identity fraud), spoofing is a common  tactic for malicious hackers against technology. Attackers often spoof  email addresses, IP addresses, media access control (MAC)  addresses, Address Resolution Protocol (ARP) communications, Wi- \nFi networks, websites, mobile phone apps, and more. These and  other spoofing-related topics are covered elsewhere in this book. \nIdentity theft and identity fraud are also related to impersonation. \nImpersonation is the act of taking on someone's identity. This might  be accomplished by logging into their account with stolen credentials  or claiming to be someone else when on the phone. These and other  impersonation concepts were covered earlier in the “Impersonation  and Masquerading” section. \nAs a current or future victim of identity theft/fraud, you should take  actions to reduce your vulnerability, increase the chance of detecting  such attacks, and improve your defenses against this type of  injustice. \nTyposquatting \nTyposquatting is a practice employed to capture and redirect traffic  when a user mistypes the domain name or IP address of an intended  resource. This is a social engineering attack that takes advantage of a  person's potential to mistype a fully qualified domain name (FQDN)  or address. A malicious site squatter predicts URL typos and then  registers those domain names to direct traffic to their own site. This  can be done for competition or for malicious intent. The variations  used for typosquatting include common misspellings (such as  googel.com ), typing errors (such as gooogle.com ), variations on a  name or word (for example, plurality, as in googles.com ), and  different top-level domains (TLDs) (such as google.edu ). \nURL hijacking can also refer to the practice of displaying a link or  advertisement that looks like that of a well-known product, service,  or site but, when clicked, redirects the user to an alternate location,  service, or product. This may be accomplished by posting sites and  pages and exploiting search engine optimization (SEO) to cause your  content to occur higher in search results, or through the use of  adware that replaces legitimate ads and links with those leading to  alternate or malicious locations. \nClickjacking is a means to redirect a user's click or selection on a web  page to an alternate, often malicious target instead of the intended  and desired location. This can be accomplished through several  techniques. Some alter the code of the original web page in order to  include a script that will automatically replace the valid URL with an  alternate URL at the moment the mouse click or selection occurs. \nAnother means is to add an invisible or hidden overlay, frame, or  image map over the displayed page. The user sees the original page,  but any mouse click or selection will be captured by the floating  frame and redirected to the malicious target. Clickjacking can be  used to perform phishing attacks, hijacking, and Adversary-in-the- \nMiddle ([AitM], aka on-path, previously known as Man-in-the- \nMiddle [MitM]) attacks. \nInfluence Campaigns \nInfluence campaigns are social engineering attacks that attempt to  guide, adjust, or change public opinion. Although such attacks might  be undertaken by attackers against individuals or organizations,  most influence campaigns seem to be waged by nation-states against  their real or perceived foreign enemies. \nInfluence campaigns are linked to the distribution of false or  misleading content, including: \nDisinformation. Intentionally false or misleading information  spread with the purpose of deceiving or manipulating people. It  is often used as a tool for political, ideological, or malicious  agendas. \nMisinformation. Inaccurate or misleading information that is  spread without malicious intent. It can be the result of errors,  misunderstandings, or the unintentional sharing of false  information. \nPropaganda. A systematic effort to spread ideas, information,  or opinions, often of a biased or misleading nature, to promote a  particular cause, political viewpoint, or ideology. It aims to  shape public perception and behavior. \nFalse information. Any information that is factually incorrect or  inaccurate. It can be created or spread unintentionally or  intentionally and may or may not have a specific agenda. \n“Fake news.” A term used to describe deliberately fabricated  news stories or hoaxes presented as genuine journalism. It often  serves to misinform or deceive readers, and it may be politically  motivated or created for profit. It can also be used to label  genuine journalism as false. \nDoxing. Short for “document tracing” or “dropping documents.” \nInvolves researching and publishing private or personally  identifiable information about an individual, such as their real  name, address, contact details, or other sensitive data, often  with malicious intent, such as harassment or public shaming. \nDoxing can also refer to the release of false and fabricated  information. Doxing can also be against organizations. \nMisleading, incomplete, crafted, and altered information can be used  as part of an influence campaign to adjust the perception of readers  and viewers to the concepts, thoughts, and ideologies of the  influencer. These tactics have been used by invaders for centuries to  turn a population against their own government. In the current  digital information age, influence campaigns are easier to wage than  ever before and some of the perpetrators are domestic. Modern  influence campaigns don't need to rely on the distribution of printed  materials but can digitally transmit the propaganda directly to the  targets. \nHybrid Warfare \nNations no longer limit their attacks against their real or perceived  enemies using traditional, kinetic weaponry. Now they combine  classical military strategy with modern capabilities, including social  engineering, digital influence campaigns, psychological warfare  efforts, political tactics, and cyberwarfare capabilities. This is known  as hybrid warfare . Some entities use the term nonlinear warfare or  irregular warfare to refer to this concept. \nIt is important to realize that nations will use whatever tools or  weapons are available to them when they feel threatened or decide  they must strike first. With the use of hybrid warfare tactics, there is  far greater risk to every individual than in battles of the past. Now  with cyberwar and influence campaigns, every person can be  targeted and potentially harmed. Keep in mind that harm is not just  physical in hybrid warfare; it can also damage reputation, finances,  digital infrastructure, and relationships. \nFor a more thorough look at hybrid warfare, read the U.S. \nGovernment Accountability Office's “Hybrid Warfare” report. \n“Cyberwarfare: Origins, Motivations and What You \nCan Do in Response” is a helpful paper you can find at  www.globalknowledge.com/us-en/resources/resource-  library/white-papers/cyberwarfare-origins-motivations-and-  what-you-can-do-in-response . \nSocial Media \nSocial media has become a weapon in the hands of nation-states as  they wage elements of hybrid warfare against their targets. In the last  decade, we have seen evidence of several nations, including our own,  participating in social media–based influence campaigns. You should  realize that you cannot just assume that the content you see on a  social network is accurate, valid, or complete. Even when quoted by  your friends, when referenced in popular media, when seemingly in  line with your own expectations, you have to be skeptical of  everything that reaches you through your digital communication  devices. The use and abuse of social media by adversaries, foreign  and domestic, brings the social engineering attack concept to a whole  new level. \nA great resource for learning how not to fall for false  information distributed through the Internet is the “Navigating \nDigital Information” series presented by the YouTube channel \nCrashCourse: www.youtube.com/playlist?  list=PL8dPuuaLjXtN07XYqqWSKpPrtNDiCHTzU . \nWorkers can easily waste time and system resources by interacting  with social media when that task is not part of their job description. \nThe company's acceptable user policy (AUP) should indicate that  workers need to focus on work while at work rather than spending  time on personal or non-work-related tasks. \nSocial media can be a means by which workers intentionally or  accidentally distribute internal, confidential, proprietary, or PII data  to outsiders. This may be accomplished by typing in messages or  participating in chats in which they reveal confidential information. \nThis can also be accomplished by distributing or publishing sensitive  documents. Responses to social media issues can include blocking  access to social media sites by adding IP blocks to firewalls and  resolution filters to Domain Name System (DNS) queries. Violating  workers need to be reprimanded or even terminated. \nEstablish and Maintain a Security \nAwareness, Education, and Training Program \nThe successful implementation of a security solution requires  changes in user behavior. These changes primarily consist of  alterations in normal work activities to comply with the standards,  guidelines, and procedures mandated by the security policy. \nBehavior modification involves some level of learning on the part of  the user. To develop and manage security education, training, and  awareness, all relevant items of knowledge transference must be  clearly identified and programs of presentation, exposure, synergy,  and implementation crafted. \nAwareness \nA prerequisite to security training is awareness . The goal of creating  awareness is to bring security to the forefront and make it a  recognized entity for users. Awareness establishes a common  baseline or foundation of security understanding across the entire  organization and focuses on key or basic topics and issues related to  security that all employees must understand. Awareness is not  exclusively created through a classroom type of presentation but also  through the work environment reminders such as posters, newsletter  articles, and screen savers. \nInstructor-led awareness, training, and education  provide the best opportunity for real-time feedback from  attendees. \nAwareness establishes a minimum standard common denominator  or foundation of security understanding. All personnel should be  fully aware of their security responsibilities and liabilities. They  should be trained to know what to do and what not to do. \nThe issues that users must be aware of include avoiding waste, fraud,  and unauthorized activities. All members of an organization, from  senior management to temporary interns, need the same level of  awareness. The awareness program in an organization should be tied  in with its security policy, incident-handling plan, business  continuity, and disaster recovery procedures. For an awareness-  building program to be effective, it must be fresh, creative, and  updated often. The awareness program should also be tied to an  understanding of how the corporate culture will affect and impact  security for individuals as well as the organization as a whole. If  employees do not see enforcement of security policies and standards  among the C-level executives, especially at the awareness level, then  they may not feel obligated to abide by them either. \nTraining \nTraining is teaching employees to perform their work tasks and to  comply with the security policy. Training is typically hosted by an  organization and is targeted to groups of employees with similar job  functions. All new employees require some level of training so they  will be able to comply with all standards, guidelines, and procedures  mandated by the security policy. Training is an ongoing activity that  must be sustained throughout the lifetime of the organization for  every employee. It is considered an administrative security control. \nMethods and techniques to present awareness and training should  be revised and improved over time to maximize benefits. This will  require that training metrics be collected and evaluated. Improved  awareness and training programs may include post-learning testing  as well as monitoring for job consistency improvements and  reductions in downtime, security incidents, or mistakes. This can be  considered a program effectiveness evaluation. \nAwareness and training are often provided in-house. That means  these teaching tools are created and deployed by and within the  organization itself. However, the next level of knowledge distribution  is usually obtained from an external third-party source. \nEducation \nEducation is a detailed endeavor in which students and users learn  much more than they actually need to know to perform their work  tasks. Education is most often associated with users pursuing  certification or seeking job promotion. It is typically a requirement  for personnel seeking security professional positions. A security  professional needs extensive knowledge of security and the local  environment for the entire organization and not just for their specific  work tasks. \nA new development in the security education arena is  micro-training (aka micro-learning, micro-education, or fast  learning). Micro-training is a training and learning approach that  involves delivering short, focused, and bite-sized learning  modules or content to learners. These brief learning units are  typically designed to be highly specific, addressing a single  learning objective or a small set of related objectives in a concise  and easily digestible format. Micro-training is characterized by its  brevity and effectiveness in conveying information, making it well  suited for the fast-paced and attention-challenged digital age. \nOften, micro-training is delivered via mobile apps. \nImprovements \nThe following are techniques for improving security awareness and  training: \nChange the target focus of the training. Sometimes you want to  focus on the individual, sometimes on customers and clients,  and other times on the organization. \nChange around topic orders or emphasis; maybe focus on social  engineering during one training, then next time focus on mobile  device security, and then family and travel security after that. \nUse a variety of presentation methods, such as in-person  instruction, prerecorded videos, computer software/simulations,  virtual reality (VR) experiences, off-site training, interactive  websites, or assigned reading of either prepared courseware or  off-the-shelf books (such as Scam Me If You Can: Simple \nStrategies to Outsmart Today's Rip-off Artists or The Art of the \nCon: How to Think Like a Real Hustler and Avoid Being \nScammed , both by Frank Abagnale). \nUse role-playing by providing attendees with parts in a  reenactment both as attacker and defender, but allow various  people to offer ideas related to defending or responding to the  attacks. \nDevelop and encourage security champions . These are people who  take the lead in a project, such as development, leadership, or  training, to enable, support, and encourage the adoption of security  knowledge and practices through peer leadership, behavior  demonstration, and social encouragement. Often a security  champion is a member of a group who decides (or is assigned) to  take charge of leading the adoption and integration of security  concepts into the group's work activities. Security champions are  often non-security employees who take up the mantle to encourage  others to support and adopt more security practices and behaviors. \nSecurity champions are often found in software development, but  this concept can be useful in any group of employees in any  department. \nSecurity awareness and training can often be improved through  gamification. Gamification is a means to encourage compliance and  engagement by integrating common elements of gameplay into other  activities, such as security compliance and behavior change. This can  include rewarding compliance behaviors and potentially punishing  violating behaviors. Many aspects of gameplay (derived from card  games, board games, sports, video games, and so on) can be  integrated into security training and adoption, such as scoring  points, earning achievements or badges, competing/cooperating with  others, following a set of common/standard rules, having a defined  goal, seeking rewards, developing group stories/experiences, and  avoiding pitfalls or negative game events. Well-applied game  dynamics can result in improved worker engagement with training,  an increase in organizational application of lessons, expansion of the  comprehension of application of concepts, more efficient workflow,  integration of more group activities such as crowdsourcing and  brainstorming, increased knowledge retention, and a reduction of  worker apathy. In addition to gamification, ways to improve security  training include capture-the-flag drills, phishing simulations,  computer-based training (CBT), and role-based training, among  many others. \nEffectiveness Evaluation \nIt is also important to perform periodic content reviews of all  training materials. Reviews help ensure that the training materials  and presentation stay in line with business goals, organizational  mission, and security objectives. This periodic evaluation of training  materials also provides the opportunity to adjust focus, add/remove  topics (especially related to emerging technologies and trends), and  integrate new training techniques into the courseware. \nThe Exam Outline objective 1.12.2 gives examples of  emerging technologies and trends that should be integrated into  training materials. These examples are cryptocurrency and  blockchain (which are covered in Chapters 7 and 9) and artificial  intelligence (Al) (which is covered in Chapter 17). These are only  a few of the new concepts that every organization should be  addressing as part of their security management processes,  including training personnel on how to use, handle, avoid, or  detect. \nAdditionally, new bold and subtle methods and techniques to present  awareness and training should be implemented to keep the content  fresh and relevant. Without periodic reviews for content relevancy,  materials will become stale and workers will likely resort to making  up their own guidelines and procedures. It is the responsibility of the  security governance team to establish security rules as well as  provide training and education to further the implementation of  those rules. \nTroubleshooting personnel issues should include verifying that all  personnel have attended awareness training on standard  foundational security behaviors and requirements, evaluating the  access and activity logs of users, and determining whether violations  were intentional, coerced, accidental, or due to ignorance. \nA policy violation occurs when a user breaks a rule. Users must be  trained on the organization's policies and know their specific  responsibilities with regard to abiding by those security rules. If a  violation occurs, an internal investigation should evaluate whether it  was an accident or an intentional event. If accidental, the worker  should be trained on how to avoid the accident in the future, and new  countermeasures may need to be implemented. If intentional, the  severity of the issue may dictate a range of responses, including  retraining, reassignment, and termination. \nAn example of a policy violation is the distribution of an internal  company memo to external entities via a social network posting. \nDepending on the content of the memo, this could be a minor  violation (such as posting a memo due to humorous or pointless  content according to the worker) or a major issue (such as posting a  memo that discloses a company secret or private information related  to customers). \nCompany policy violations are not always the result of an accident or  oversight on the part of the worker, nor are they always an  intentional malicious choice. In fact, many internal breaches of  company security are the result of intentional manipulation by  malicious third parties. \nTraining and awareness program effectiveness evaluation should  take place on an ongoing or continuous basis. Never assume that just  because a worker was marked as attending or completing a training  event they actually learned anything or will be changing their  behavior. Some means of verification should be used to measure  whether the training is beneficial or a waste of time and resources. In  some circumstances, a quiz or test can be administered to workers  immediately after a training session. A follow-up quiz should be  performed three to six months later to see if they retained the  information presented in the training. Event and incident logs  should be reviewed for the rate of occurrences of security violations  due to employee actions and behaviors to see if there is any  noticeable difference in the rate of occurrence or trends of incidents  before and after a training presentation. Good training (and  teachable employees) would be confirmed with a marked difference  in user behaviors, especially a reduction of security infractions. High  scores on subsequent security quizzes months later demonstrate that  security concepts are retained. A combination of these processes of  evaluation can help determine if a training or awareness program is  being effective and is reducing the security incident rate and related  response and management costs. A well-designed, engaging, and  successful security training program should result in a measurable  reduction in employee-related security incident management costs,  hopefully far exceeding the cost of the training program itself. This  would, therefore, be a good return on security investment. \nSummary \nWhen designing and deploying security solutions, you need to  protect your environment from potential human threats. The aspects  of secure hiring practices, defining roles, setting policies, following  standards, reviewing guidelines, detailing procedures, performing  risk management, providing awareness training, and cultivating  management planning all contribute to protecting assets. \nSecure hiring practices require detailed job descriptions. Job  descriptions are used as a guide for selecting candidates and properly  evaluating them for a position. Job responsibilities are the specific  work tasks an employee is required to perform on a regular basis. \nEmployment candidate screening, background checks, reference  checks, education verification, and security clearance validation are  essential elements in proving that a candidate is adequate, qualified,  and trustworthy for a secured position. \nOnboarding involves integrating a new hire into the organization,  which includes organizational socialization and orientation. When a  new employee is hired, they should sign an employment  agreement/contract and possibly a nondisclosure agreement (NDA). \nThese documents define the responsibilities and legal liabilities of  the relationship between the employee and the organization. \nThroughout the employment lifetime of personnel, managers should  regularly review or audit the job descriptions, work tasks, privileges,  and responsibilities for every staff member. For some industries,  mandatory vacations may be needed. Collusion and other privilege  abuses can be reduced through strict monitoring of special privileges. \nOffboarding is the removal of an employee's identity from the IAM  system, or it may be a part of the process of employee transfer to  another division of the organization. A termination policy is needed  to protect an organization and its remaining employees. The  termination procedure should include an exit interview, reminder of \nNDAs, return of company property, and disabling of network access. \nVendor, consultant, and contractor controls (i.e., an SLA) are used to  define the levels of performance, expectation, compensation, and  consequences for external entities, persons, or organizations. \nCompliance is the act of conforming to or adhering to rules, policies,  regulations, standards, or requirements. Compliance is an important  concern for security governance. \nThe primary goal of risk management is to reduce risk to an  acceptable level. Determining this level depends on the organization,  the value of its assets, and the size of its budget. Risk  analysis/assessment is the process by which risk management is  achieved and includes inventorying assets, analyzing an environment  for threats, and evaluating each risk as to its likelihood of occurring  and the cost of the resulting damage. Risk response is the assessing  of the cost of various countermeasures for each risk and creating a  cost/benefit report for safeguards to present to upper management. \nSocial engineering is a form of attack that exploits human nature and  human behavior. Social engineering attacks take two primary forms:  convincing someone to perform an unauthorized operation or  convincing someone to reveal confidential information. The most  effective defense against social engineering attacks is user education  and awareness training. \nThe common social engineering principles are authority,  intimidation, consensus, scarcity, familiarity, trust, and urgency. \nEliciting information is the activity of gathering or collecting  information from systems or people. Social engineering attacks  include phishing, spear phishing, business email compromise (BEC),  whaling, smishing, vishing, spam, shoulder surfing, invoice scams,  hoaxes, impersonation, masquerading, tailgating, piggybacking,  baiting, dumpster diving, identity fraud, typosquatting, and  influence campaigns. \nFor a security solution to be successfully implemented, user behavior  must change. Behavior modification involves some level of learning  on the part of the user. There are three commonly recognized  learning levels: awareness, training, and education. \nSecurity-focused awareness and training programs should be  reassessed and revised regularly. Some security awareness and  training programs can benefit from security champions or  gamification. \nStudy Essentials \nUnderstand the security implications of hiring new  employees. To properly plan for security, you must have  standards in place for job descriptions, job classification, work tasks,  job responsibilities, prevention of collusion, candidate screening,  background checks, security clearances, employment agreements,  and nondisclosure agreements. By deploying such mechanisms, you  ensure that new hires are aware of the required security standards,  thus protecting your organization's assets. \nUnderstand onboarding and offboarding. Onboarding is the  process of adding new employees to the organization using  socialization and orientation. Offboarding is the removal of an  employee's identity from the IAM system once that person has left  the organization. \nKnow the principle of least privilege. The principle of least  privilege states that users should be granted the minimum amount of  access necessary for them to complete their required work tasks or  job responsibilities. \nKnow about employee oversight. Throughout the employment  lifetime of personnel, managers should regularly review or audit the  job descriptions, work tasks, privileges, and responsibilities for every  staff member. \nKnow why mandatory vacations are necessary. Mandatory  vacations of one to two weeks are used to audit and verify the work  tasks and privileges of employees. This often results in easy detection  of abuse, fraud, or negligence. \nKnow about UBA and UEBA. User behavior analytics (UBA)  and user and entity behavior analytics (UEBA) are the concepts of  analyzing the behavior of users, subjects, visitors, customers, etc. for  some specific goal or purpose. \nUnderstand employee transfers. Personnel transfers may be  treated as a termination/rehire rather than a personnel move. This  depends on the organization's policies and the means they have  determined to best manage this change. Some of the elements that  go into making the decision as to which procedure to use include  whether the same user account will be retained, if their clearance will  be adjusted, if their new work responsibilities are similar to the  previous position, and if a “clean slate” account is required for  auditing purposes in the new job position. \nBe able to explain proper termination policies. A  termination policy defines the procedure for terminating employees. \nIt should include items such as always having a witness, disabling the  employee's network access, and performing an exit interview. A  termination policy should also include escorting the terminated  employee off the premises and requiring the return of security tokens  and badges and company property. \nBe able to define overall risk management. The process of  identifying factors that could damage or disclose data, evaluating  those factors in light of data value and countermeasure cost, and  implementing cost-effective solutions for mitigating or reducing risk  is known as risk management. By performing risk management, you  lay the foundation for reducing risk overall. \nUnderstand risk analysis and the key elements involved. \nRisk analysis is the process by which upper management is provided  with details to make decisions about which risks are to be mitigated,  which should be transferred, and which should be accepted. To fully  evaluate risks and subsequently take the proper precautions, you  must analyze the following: assets, asset valuation, threats,  vulnerability, exposure, risk, realized risk, safeguards,  countermeasures, attacks, and breaches. \nKnow how to evaluate threats. Threats can originate from  numerous sources, including IT, humans, and nature. Threat  assessment should be performed as a team effort to provide the  widest range of perspectives. By fully evaluating risks from all angles,  you reduce your system's vulnerability. \nUnderstand qualitative risk analysis. Qualitative risk analysis  is based more on scenarios than calculations. Exact dollar figures are  not assigned to possible losses; instead, threats are ranked on a scale  to evaluate their risks, costs, and effects. Such an analysis assists  those responsible for creating proper risk management policies. \nUnderstand quantitative risk analysis. Quantitative risk  analysis focuses on hard values and percentages. A complete  quantitative analysis is not possible because of intangible aspects of  risk. The process involves valuing assets and identifying threats and  then determining a threat's potential frequency and the resulting  damage, which leads to the risk response tasks of the cost/benefit  analysis of safeguards. \nKnow what single loss expectancy (SLE) is and how to  calculate it. SLE is an element of quantitative risk analysis that  represents the cost associated with a single realized risk against a  specific asset. The formula is SLE = asset value (AV) * exposure  factor (EF). \nKnow what annualized loss expectancy (ALE) is and how to  calculate it. ALE is an element of quantitative risk analysis that  represents the possible yearly cost of all instances of a specific  realized threat against a specific asset. The formula is ALE = single  loss expectancy (SLE) * annualized rate of occurrence (ARO). \nKnow the formula for safeguard evaluation. In addition to  determining the annual cost of a safeguard, you must calculate the \nALE for the asset if the safeguard is implemented. Use this formula: \nALE before safeguard – ALE after implementing the safeguard –  annual cost of safeguard = value of the safeguard to the company, or \n(ALE1 – ALE2) – ACS. \nKnow the options for handling risk. Reducing risk, or risk  mitigation, is the implementation of safeguards and  countermeasures. Assigning risk or transferring a risk places the cost  of loss a risk represents onto another entity or organization. \nPurchasing insurance is one form of assigning or transferring risk. \nRisk deterrence is the process of implementing deterrents to would-  be violators of security and policy. Risk avoidance is the process of  selecting alternate options or activities that have less associated risk  than the default, common, expedient, or cheap option. Accepting risk  means management has evaluated the cost/benefit analysis of  possible safeguards and has determined that the cost of the  countermeasure greatly outweighs the possible cost of loss due to a  risk. It also means that management has agreed to accept the  consequences and the loss if the risk is realized. \nUnderstand security control assessment (SCA). An SCA is  the formal evaluation of a security infrastructure's individual  mechanisms against a baseline or reliability expectation. \nUnderstand security monitoring and measurement. \nSecurity controls should provide benefits that can be monitored and  measured. If a security control's benefits cannot be quantified,  evaluated, or compared, then it does not actually provide any  security. \nUnderstand risk reporting. Risk reporting involves the  production of a risk report and a presentation of that report to the  interested/relevant parties. A risk report should be accurate, timely,  comprehensive of the entire organization, clear and precise to  support decision-making, and updated on a regular basis. \nUnderstand the Risk Maturity Model (RMM). The Risk \nMaturity Model (RMM) is a means to assess the key indicators and  activities of a mature, sustainable, and repeatable risk management  process. The RMM levels are ad hoc, preliminary, defined,  integrated, and optimized. \nKnow about legacy system security risk. Legacy systems are  often a threat because they may not be receiving security updates  from their vendors. End of life (EOL) is the point at which a  manufacturer no longer produces a product. End of service life \n(EOSL) or end of support (EOS) are those that are no longer  receiving updates and support from the vendor. \nUnderstand social engineering. Social engineering is a form of  attack that exploits human nature and human behavior. The  common social engineering principles are authority, intimidation,  consensus, scarcity, familiarity, trust, and urgency. Such attacks may  be used to elicit information or gain access through the use of  pretexting and/or prepending. Social engineering attacks include  phishing, spear phishing, business email compromise (BEC),  whaling, smishing, vishing, spam, shoulder surfing, invoice scams,  hoaxes, impersonation, masquerading, tailgating, piggybacking,  baiting, dumpster diving, identity fraud, typosquatting, and  influence campaigns. \nKnow how to implement security awareness training and  education. Before actual training can take place, awareness of  security as a recognized entity must be created for users. Once this is  accomplished, training, or teaching employees to perform their work  tasks and to comply with the security policy, can begin. All new  employees require some level of training so that they will be able to  comply with all standards, guidelines, and procedures mandated by  the security policy. Education is a more detailed endeavor in which  students/users learn much more than they actually need to know to  perform their work tasks. Education is most often associated with  users pursuing certification or seeking job promotion. \nKnow about the need for periodic content reviews and  effectiveness evaluations. It is important to perform periodic  content reviews of all training materials. This is to ensure that the  training materials and presentation stays in line with business goals,  organizational mission, and security objectives. Some means of  verification should be used to measure whether the training is  beneficial or a waste of time and resources. \nWritten Lab \n1. Name six different administrative controls used to secure  personnel. \n2. What are the basic formulas or values used in quantitative risk  assessment? \n3. Describe the process or technique used to reach an anonymous  consensus during a qualitative risk assessment. \n4. Discuss the need to perform a balanced risk assessment. What  are the techniques that can be used and why is this necessary? \n5. What are the main types of social engineering principles? \n6. Name several types or methods of social engineering. \nReview Questions \n1. You have been tasked with overseeing the security improvement  project for your organization. The goal is to reduce the current  risk profile to a lower level without spending considerable  amounts of money. You decide to focus on the largest concern  mentioned by your CISO. Which of the following is likely the  element of the organization that is considered the weakest? \nA. Software products \nB. Internet connections \nC. Security policies \nD. Humans \n2. Due to recent organization restructuring, the CEO believes that  new workers should be hired to perform necessary work tasks  and support the mission and goals of the organization. When  seeking to hire new employees, what is the first step? \nA. Create a job description. \nB. Set position classification. \nC. Screen candidates. \nD. Request résumés. \n3. _________________ is the process of adding new employees  to the organization, having them review and sign policies, be  introduced to managers and coworkers, and be trained in  employee operations and logistics. \nA. Reissue \nB. Onboarding \nC. Background checks \nD. Site survey \n4. After repeated events of retraining, a particular worker was  caught for the fourth time attempting to access documents that  were not relevant to their job position. The CSO decides this was  the last chance, and the worker is to be fired. The CSO reminds  you that the organization has a formal termination process that  should be followed. Which of the following is an important task  to perform during the termination procedure to reduce future  security issues related to this former employee? \nA. Return the exiting employee's personal belongings. \nB. Review the nondisclosure agreement. \nC. Evaluate the exiting employee's performance. \nD. Cancel the exiting employee's parking permit. \n5. Which of the following is a true statement in regard to vendor,  consultant, and contractor controls? \nA. Using business email compromise (BEC) is a means to  ensure that organizations providing services maintain an  appropriate level of service agreed on by the service  provider, vendor, or contractor and the customer  organization. \nB. Outsourcing can be used as a risk response option known as  acceptance or appetite. \nC. Multiparty risk exists when several entities or organizations  are involved in a project. The risk or threats are often due to  the variations of objectives, expectations, timelines,  budgets, and security priorities of those involved. \nD. Risk management strategies implemented by one party do  not cause additional risks against or from another party. \n6. Match the term to its definition: \n1. Asset \n2. Threat \n3. Vulnerability \n4. Exposure \n5. Risk \nI. The weakness in an asset, or the absence or the weakness of  a safeguard or countermeasure. \nII. Anything used in a business process or task. \nIII. Being susceptible to asset loss because of a threat; there is  the possibility that a vulnerability can or will be exploited. \nIV. The possibility or likelihood that a threat will exploit a  vulnerability to cause harm to an asset and the severity of  damage that could result. \nV. Any potential occurrence that may cause an undesirable or  unwanted outcome for an organization or for a specific  asset. \nA. 1-II, 2-V, 3-I, 4-III, 5-IV \nB. 1-I, 2-II, 3-IV, 4-II, 5-V \nC. 1-II, 2-V, 3-I, 4-IV, 5-III \nD. 1-IV, 2-V, 3-III, 4-II, 5-I \n7. While performing a risk analysis, you identify a threat of fire and  a vulnerability of things being flammable because there are no  fire extinguishers. Based on this information, which of the  following is a possible risk? \nA. Virus infection \nB. Damage to equipment \nC. System malfunction \nD. Unauthorized access to confidential information \n8. During a meeting of company leadership and the security team,  discussion focuses on defining the value of assets in dollars,  inventorying threats, predicting the specific amount of harm of a  breach, and determining the number of times a threat could  cause harm to the company each year. What is being performed? \nA. Qualitative risk assessment \nB. Delphi technique \nC. Risk avoidance \nD. Quantitative risk assessment \n9. You have performed a risk assessment and determined the  threats that represent the most significant concern to your  organization. When evaluating safeguards, what is the rule that  should be followed in most cases? \nA. The expected annual cost of asset loss should not exceed the  annual costs of safeguards. \nB. The annual costs of safeguards should equal the value of the  asset. \nC. The annual costs of safeguards should not exceed the  expected annual cost of asset value loss. \nD. The annual costs of safeguards should not exceed 10  percent of the security budget. \n10. During a risk management project, an evaluation of several  controls determines that none are cost-effective in reducing the  risk related to a specific important asset. What risk response is  being exhibited by this situation? \nA. Mitigation \nB. Ignoring \nC. Acceptance \nD. Assignment \n11. During the annual review of the company's deployed security  infrastructure, you have been reevaluating each security control  selection. How is the value of a safeguard to a company  calculated? \nA. ALE before safeguard – ALE after implementing the  safeguard – annual cost of safeguard \nB. ALE before safeguard * ARO of safeguard \nC. ALE after implementing safeguard + annual cost of  safeguard – controls gap \nD. Total risk – controls gap \n12. Which of the following are valid definitions for risk? (Choose all  that apply.) \nA. An assessment of probability, possibility, or chance \nB. Anything that removes a vulnerability or protects against  one or more specific threats \nC. Risk = threat * vulnerability \nD. The presence of a vulnerability when a related threat exists \n13. A new web application was installed onto the company's public  web server last week. Over the weekend a malicious attacker was  able to exploit the new code and gained access to data files  hosted on the system. This is an example of what issue? \nA. Inherent risk \nB. Risk matrix \nC. Qualitative assessment \nD. Residual risk \n14. Your organization is courting a new business partner. During  the negotiations the other party defines several requirements of  your organization's security that must be met prior to the  signing of the SLA and business partners agreement (BPA). One  of the requirements is that your organization demonstrate their  level of achievement on the Risk Maturity Model (RMM). The  requirement is specifically that a common or standardized risk  framework is adopted organization-wide. Which of the five  possible levels of RMM is being required of your organization? \nA. Preliminary \nB. Integrated \nC. Defined \nD. Optimized \n15. The Risk Management Framework (RMF) provides a  disciplined, structured, and flexible process for managing  security and privacy risk that includes information security  categorization; control selection, implementation, and  assessment; system and common control authorizations; and  continuous monitoring. The RMF has seven steps or phases. \nWhich phase of the RMF focuses on determining whether  system or common controls based on a determination that the  risk to organizational operations and assets, individuals, other  organizations, and the Nation are acceptable? \nA. Categorize \nB. Authorize \nC. Assess \nD. Monitor \n16. Company proprietary data is discovered on a public social media  posting by the CEO. While investigating, a significant number of  similar emails were discovered to have been sent to employees,  which included links to malicious sites. Some employees report  that they had received similar messages to their personal email  accounts as well. What improvements should the company  implement to address this issue? (Choose two.) \nA. Deploy a web application firewall. \nB. Block access to personal email from the company network. \nC. Update the company email server. \nD. Implement multifactor authentication (MFA) on the  company email server. \nE. Perform an access review of all company files. \nF. Prohibit access to social networks on company equipment. \n17. What process or event is typically hosted by an organization and  is targeted to groups of employees with similar job functions? \nA. Education \nB. Awareness \nC. Training \nD. Termination \n18. Which of the following could be classified as a form of social  engineering attack? (Choose all that apply.) \nA. A user logs in to their workstation and then decides to get a  soda from the vending machine in the stairwell. As soon as  the user walks away from their workstation, another person  sits down at their desk and copies all the files from a local  folder onto a network share. \nB. You receive an email warning about a dangerous new virus  spreading across the Internet. The message tells you to look  for a specific file on your hard drive and delete it, since it  indicates the presence of the virus. \nC. A website claims to offer free temporary access to their  products and services but requires that you alter the  configuration of your web browser and/or firewall in order  to download the access software. \nD. A secretary receives a phone call from a person claiming to  be a client who is running late to meet the CEO. The caller  asks for the CEO's private cell phone number so that they  can call them. \n19. Often a _____________ is a member of a group who decides \n(or is assigned) to take charge of leading the adoption and  integration of security concepts into the group's work activities. \n_____________ are often non-security employees who take  up the mantle to encourage others to support and adopt more  security practices and behaviors. \nA. CISO(s) \nB. Security champion(s) \nC. Security auditor(s) \nD. Custodian(s) \n20. The CSO has expressed concern that after years of security  training and awareness programs, the level of minor security  violations has actually increased. A new security team member  reviews the training materials and notices that it was crafted  four years ago. They suggest that the materials be revised to be  more engaging and to include elements that allow for the ability  to earn recognition, team up with coworkers, and strive toward a  common goal. They claim these efforts will improve security  compliance and foster security behavior change. What is the  approach that is being recommended? \nA. Program effectiveness evaluation \nB. Onboarding \nC. Compliance enforcement \nD. Gamification ",
  "elements": {
    "summaries": [
      "When designing and deploying security solutions, you need to protect your environment from potential human threats. The aspects of secure hiring practices, defining roles, setting policies, following standards, reviewing guidelines, detailing procedures, performing risk management, providing awareness training, and cultivating management planning all contribute to protecting assets. Secure hiring practices require detailed job descriptions. Job descriptions are used as a guide for selecting candidates and properly evaluating them for a position. Job responsibilities are the specific work tasks an employee is required to perform on a regular basis. Employment candidate screening, background checks, reference checks, education verification, and security clearance validation are essential elements in proving that a candidate is adequate, qualified, and trustworthy for a secured position. Onboarding involves integrating a new hire into the organization, which includes organizational socialization and orientation. When a new employee is hired, they should sign an employment agreement/contract and possibly a nondisclosure agreement (NDA). These documents define the responsibilities and legal liabilities of the relationship between the employee and the organization. Throughout the employment lifetime of personnel, managers should regularly review or audit the job descriptions, work tasks, privileges, and responsibilities for every staff member. For some industries, mandatory vacations may be needed. Collusion and other privilege abuses can be reduced through strict monitoring of special privileges. Offboarding is the removal of an employee's identity from the IAM system, or it may be a part of the process of employee transfer to another division of the organization. A termination policy is needed to protect an organization and its remaining employees. The termination procedure should include an exit interview, reminder of NDAs, return of company property, and disabling of network access. Vendor, consultant, and contractor controls (i.e., an SLA) are used to define the levels of performance, expectation, compensation, and consequences for external entities, persons, or organizations. Compliance is the act of conforming to or adhering to rules, policies, regulations, standards, or requirements. Compliance is an important concern for security governance. The primary goal of risk management is to reduce risk to an acceptable level. Determining this level depends on the organization, the value of its assets, and the size of its budget. Risk analysis/assessment is the process by which risk management is achieved and includes inventorying assets, analyzing an environment for threats, and evaluating each risk as to its likelihood of occurring and the cost of the resulting damage. Risk response is the assessing of the cost of various countermeasures for each risk and creating a cost/benefit report for safeguards to present to upper management. Social engineering is a form of attack that exploits human nature and human behavior. Social engineering attacks take two primary forms: convincing someone to perform an unauthorized operation or convincing someone to reveal confidential information. The most effective defense against social engineering attacks is user education and awareness training. The common social engineering principles are authority, intimidation, consensus, scarcity, familiarity, trust, and urgency. Eliciting information is the activity of gathering or collecting information from systems or people. Social engineering attacks include phishing, spear phishing, business email compromise (BEC), whaling, smishing, vishing, spam, shoulder surfing, invoice scams, hoaxes, impersonation, masquerading, tailgating, piggybacking, baiting, dumpster diving, identity fraud, typosquatting, and influence campaigns. For a security solution to be successfully implemented, user behavior must change. Behavior modification involves some level of learning on the part of the user. There are three commonly recognized learning levels: awareness, training, and education. Security-focused awareness and training programs should be reassessed and revised regularly. Some security awareness and training programs can benefit from security champions or gamification. Study Essentials Understand the security implications of hiring new employees. To properly plan for security, you must have standards in place for job descriptions, job classification, work tasks, job responsibilities, prevention of collusion, candidate screening, background checks, security clearances, employment agreements, and nondisclosure agreements. By deploying such mechanisms, you ensure that new hires are aware of the required security standards, thus protecting your organization's assets. Understand onboarding and offboarding. Onboarding is the process of adding new employees to the organization using socialization and orientation. Offboarding is the removal of an employee's identity from the IAM system once that person has left the organization. Know the principle of least privilege. The principle of least privilege states that users should be granted the minimum amount of access necessary for them to complete their required work tasks or job responsibilities. Know about employee oversight. Throughout the employment lifetime of personnel, managers should regularly review or audit the job descriptions, work tasks, privileges, and responsibilities for every staff member. Know why mandatory vacations are necessary. Mandatory vacations of one to two weeks are used to audit and verify the work tasks and privileges of employees. This often results in easy detection of abuse, fraud, or negligence. Know about UBA and UEBA. User behavior analytics (UBA) and user and entity behavior analytics (UEBA) are the concepts of analyzing the behavior of users, subjects, visitors, customers, etc. for some specific goal or purpose. Understand employee transfers. Personnel transfers may be treated as a termination/rehire rather than a personnel move. This depends on the organization's policies and the means they have determined to best manage this change. Some of the elements that go into making the decision as to which procedure to use include whether the same user account will be retained, if their clearance will be adjusted, if their new work responsibilities are similar to the previous position, and if a “clean slate” account is required for auditing purposes in the new job position. Be able to explain proper termination policies. A termination policy defines the procedure for terminating employees. It should include items such as always having a witness, disabling the employee's network access, and performing an exit interview. A termination policy should also include escorting the terminated employee off the premises and requiring the return of security tokens and badges and company property. Be able to define overall risk management. The process of identifying factors that could damage or disclose data, evaluating those factors in light of data value and countermeasure cost, and implementing cost-effective solutions for mitigating or reducing risk is known as risk management. By performing risk management, you lay the foundation for reducing risk overall. Understand risk analysis and the key elements involved. Risk analysis is the process by which upper management is provided with details to make decisions about which risks are to be mitigated, which should be transferred, and which should be accepted. To fully evaluate risks and subsequently take the proper precautions, you must analyze the following: assets, asset valuation, threats, vulnerability, exposure, risk, realized risk, safeguards, countermeasures, attacks, and breaches. Know how to evaluate threats. Threats can originate from numerous sources, including IT, humans, and nature. Threat assessment should be performed as a team effort to provide the widest range of perspectives. By fully evaluating risks from all angles, you reduce your system's vulnerability. Understand qualitative risk analysis. Qualitative risk analysis is based more on scenarios than calculations. Exact dollar figures are not assigned to possible losses; instead, threats are ranked on a scale to evaluate their risks, costs, and effects. Such an analysis assists those responsible for creating proper risk management policies. Understand quantitative risk analysis. Quantitative risk analysis focuses on hard values and percentages. A complete quantitative analysis is not possible because of intangible aspects of risk. The process involves valuing assets and identifying threats and then determining a threat's potential frequency and the resulting damage, which leads to the risk response tasks of the cost/benefit analysis of safeguards. Know what single loss expectancy (SLE) is and how to calculate it. SLE is an element of quantitative risk analysis that represents the cost associated with a single realized risk against a specific asset. The formula is SLE = asset value (AV) * exposure factor (EF). Know what annualized loss expectancy (ALE) is and how to calculate it. ALE is an element of quantitative risk analysis that represents the possible yearly cost of all instances of a specific realized threat against a specific asset. The formula is ALE = single loss expectancy (SLE) * annualized rate of occurrence (ARO). Know the formula for safeguard evaluation. In addition to determining the annual cost of a safeguard, you must calculate the ALE for the asset if the safeguard is implemented. Use this formula: ALE before safeguard – ALE after implementing the safeguard – annual cost of safeguard = value of the safeguard to the company, or (ALE1 – ALE2) – ACS. Know the options for handling risk. Reducing risk, or risk mitigation, is the implementation of safeguards and countermeasures. Assigning risk or transferring a risk places the cost of loss a risk represents onto another entity or organization. Purchasing insurance is one form of assigning or transferring risk. Risk deterrence is the process of implementing deterrents to would- be violators of security and policy. Risk avoidance is the process of selecting alternate options or activities that have less associated risk than the default, common, expedient, or cheap option. Accepting risk means management has evaluated the cost/benefit analysis of possible safeguards and has determined that the cost of the countermeasure greatly outweighs the possible cost of loss due to a risk. It also means that management has agreed to accept the consequences and the loss if the risk is realized. Understand security control assessment (SCA). An SCA is the formal evaluation of a security infrastructure's individual mechanisms against a baseline or reliability expectation. Understand security monitoring and measurement. Security controls should provide benefits that can be monitored and measured. If a security control's benefits cannot be quantified, evaluated, or compared, then it does not actually provide any security. Understand risk reporting. Risk reporting involves the production of a risk report and a presentation of that report to the interested/relevant parties. A risk report should be accurate, timely, comprehensive of the entire organization, clear and precise to support decision-making, and updated on a regular basis. Understand the Risk Maturity Model (RMM). The Risk Maturity Model (RMM) is a means to assess the key indicators and activities of a mature, sustainable, and repeatable risk management process. The RMM levels are ad hoc, preliminary, defined, integrated, and optimized. Know about legacy system security risk. Legacy systems are often a threat because they may not be receiving security updates from their vendors. End of life (EOL) is the point at which a manufacturer no longer produces a product. End of service life (EOSL) or end of support (EOS) are those that are no longer receiving updates and support from the vendor. Understand social engineering. Social engineering is a form of attack that exploits human nature and human behavior. The common social engineering principles are authority, intimidation, consensus, scarcity, familiarity, trust, and urgency. Such attacks may be used to elicit information or gain access through the use of pretexting and/or prepending. Social engineering attacks include phishing, spear phishing, business email compromise (BEC), whaling, smishing, vishing, spam, shoulder surfing, invoice scams, hoaxes, impersonation, masquerading, tailgating, piggybacking, baiting, dumpster diving, identity fraud, typosquatting, and influence campaigns. Know how to implement security awareness training and education. Before actual training can take place, awareness of security as a recognized entity must be created for users. Once this is accomplished, training, or teaching employees to perform their work tasks and to comply with the security policy, can begin. All new employees require some level of training so that they will be able to comply with all standards, guidelines, and procedures mandated by the security policy. Education is a more detailed endeavor in which students/users learn much more than they actually need to know to perform their work tasks. Education is most often associated with users pursuing certification or seeking job promotion. Know about the need for periodic content reviews and effectiveness evaluations. It is important to perform periodic content reviews of all training materials. This is to ensure that the training materials and presentation stays in line with business goals, organizational mission, and security objectives. Some means of verification should be used to measure whether the training is beneficial or a waste of time and resources."
    ],
    "reviewQuestions": [],
    "writtenLabs": []
  }
}