{
  "id": "chapter_19",
  "content": "\nChapter 19 \nInvestigations and Ethics \nTHE CISSP TOPICS COVERED IN THIS CHAPTER \nINCLUDE: \nDomain 1.0: Security and Risk Management \n1.1 Understand, adhere to, and promote professional  ethics \n1.1.1 ISC2 Code of Professional Ethics \n1.1.2 Organizational code of ethics \n1.5 Understand requirements for investigation types (e.g.,  administrative, criminal, civil, regulatory, industry  standards) \nDomain 7.0: Security Operations \n7.1 Understand and comply with investigations \n7.1.1 Evidence collection and handling \n7.1.2 Reporting and documentation \n7.1.3 Investigative techniques \n7.1.4 Digital forensics tools, tactics, and procedures \n7.1.5 Artifacts (e.g., data, computer, network, mobile  device) \nIn this chapter, we explore the process of investigating computer  security incidents and collecting evidence when appropriate. This  chapter also includes a complete discussion of ethical issues and the  code of conduct for information security practitioners. \nAs a security professional, you must be familiar with the various  types of investigations. These include administrative, criminal, civil,  and regulatory investigations, as well as investigations that involve  industry standards. You must be familiar with the standards of  evidence used in each investigation type and the forensic procedures  used to gather evidence in support of investigations. \nInvestigations \nEvery information security professional will, at one time or another,  encounter a security incident that requires an investigation. In many  cases, this investigation will be a brief, informal determination that  the matter is not serious enough to warrant further action or the  involvement of law enforcement authorities. However, in some cases,  the threat posed or damage done will be severe enough to require a  more formal inquiry. When this occurs, investigators must be careful  to ensure that proper procedures are followed. Failure to abide by  the correct procedures may violate the civil rights of those  individual(s) being investigated and could result in a failed  prosecution or even legal action against the investigator. \nInvestigation Types \nSecurity practitioners may find themselves conducting investigations  for a wide variety of reasons. Some of these investigations involve  law enforcement and must follow rigorous standards designed to  produce evidence that will be admissible in court. Other  investigations support internal business processes and require much  less rigor. \nAdministrative Investigations \nAdministrative investigations are internal investigations that  examine either operational issues or a violation of the organization's  policies. They may be conducted as part of a technical  troubleshooting effort or in support of other administrative  processes, such as human resources disciplinary procedures. \nOperational investigations examine issues related to the  organization's computing infrastructure and have the primary goal of  resolving operational issues. For example, an IT team noticing  performance issues on their web servers may conduct an operational  investigation designed to determine the cause of the performance  problems. \nAdministrative investigations may quickly transition to  another type of investigation. For example, an investigation into a  performance issue may uncover evidence of a system intrusion  that may then become a criminal investigation. \nOperational investigations have the loosest standards for collection  of information. They are not intended to produce evidence because  they are for internal operational purposes only. Therefore,  administrators conducting an operational investigation will only  conduct analysis necessary to reach their operational conclusions. \nThe collection need not be thorough or well documented, because  resolving the issue is the primary goal. \nIn addition to resolving the operational issue, operational  investigations often conduct a root cause analysis that seeks to  identify the reason that an operational issue occurred. The root cause  analysis often highlights issues that require remediation to prevent  similar incidents in the future. \nAdministrative investigations that are not operational in nature may  require a stronger standard of evidence, especially if they may result  in sanctions against an individual. There is no set guideline for the  appropriate standard of evidence in these investigations. Security  professionals should consult with the sponsor of the investigation as  well as their legal team to determine appropriate evidence collection,  handling, and retention guidelines for administrative investigations. \nCriminal Investigations \nCriminal investigations, typically conducted by law enforcement  personnel, investigate the alleged violation of criminal law. Criminal  investigations may result in charging suspects with a crime and the  prosecution of those charges in criminal court. \nMost criminal cases must meet the beyond a reasonable doubt  standard of evidence. Following this standard, the prosecution must  demonstrate that the defendant committed the crime by presenting  facts from which there are no other logical conclusions. For this  reason, criminal investigations must follow strict evidence collection  and preservation processes. \nCivil Investigations \nCivil investigations typically do not involve law enforcement but  rather involve internal employees and outside consultants working  on behalf of a legal team. They prepare the evidence necessary to  present a case in civil court resolving a dispute between two parties. \nMost civil cases do not follow the beyond a reasonable doubt  standard of proof. Instead, they use the weaker preponderance of the  evidence standard. Meeting this standard simply requires that the  evidence demonstrate that the outcome of the case is more likely  than not. For this reason, evidence collection standards for civil  investigations are not as rigorous as those used in criminal  investigations. \nRegulatory Investigations \nGovernment agencies may conduct regulatory investigations when  they believe that an individual or corporation has violated  administrative law. Regulators typically conduct these investigations  with a standard of proof commensurate with the venue where they  expect to try their case. Regulatory investigations vary widely in  scope and procedure and are often conducted by government agents. \nIndustry Standards \nSome regulatory investigations may not involve government  agencies. These are based on industry standards, such as the \nPayment Card Industry Data Security Standard (PCI DSS). These  industry standards are not laws but are contractual obligations  entered into by the participating organizations. In some cases,  including PCI DSS, the organization may be required to submit to  audits, assessments, and investigations conducted by an independent  third party. Failure to participate in these investigations or negative  investigation results may lead to fines or other sanctions. Therefore,  investigations into violations of industry standards should be treated  in a similar manner as regulatory investigations. \nElectronic Discovery \nIn legal proceedings, each side has a duty to preserve evidence  related to the case and, through the discovery process, share  information with their adversary in the proceedings. This discovery  process applies to both paper records and electronic records, and the  electronic discovery (or eDiscovery) process facilitates the processing  of electronic information for disclosure. \nThe Electronic Discovery Reference Model (EDRM) describes a  standard process for conducting eDiscovery with nine aspects: \nInformation Governance Ensures that information is well  organized for future eDiscovery efforts \nIdentification Locates the information that may be responsive to  a discovery request when the organization believes that litigation is  likely \nPreservation Ensures that potentially discoverable information is  protected against alteration or deletion \nCollection Gathers the relevant information centrally for use in  the eDiscovery process \nProcessing Screens the collected information to perform a “rough  cut” of irrelevant information, reducing the amount of information  requiring detailed screening \nReview Examines the remaining information to determine what  information is relevant to the request and removes any information  protected by attorney-client privilege \nAnalysis Performs deeper inspection of the content and context of  remaining information \nProduction Places the information into a format that may be  shared with others and delivers it to other parties, such as opposing  counsel \nPresentation Displays the information to witnesses, the court,  and other parties \nFor more information on the EDRM, see  http://edrm.net/resources/frameworks-and-standards/edrm-  model . \nConducting eDiscovery is a complex process and requires careful  coordination between IT professionals and legal counsel. \nEvidence \nTo successfully prosecute a crime, the prosecuting attorneys must  provide sufficient evidence to prove an individual's guilt beyond a  reasonable doubt. In the following sections, we'll explain the  requirements that evidence must meet before it is allowed in court,  the various types of evidence that may be introduced, and the  requirements for handling and documenting evidence. The items of  evidence that you maintain and may use in court are also known as  artifacts and may include physical devices, such as computers,  mobile devices, and network devices, the logs and data generated by  those devices, and many other forms of evidence. \nThe National Institute of Standards and Technology's \nGuide to Integrating Forensic Techniques into Incident Response \n(SP 800-86) is a great reference and is available at  https://csrc.nist.gov/pubs/sp/800/86/final . \nAdmissible Evidence \nThere are three basic requirements for evidence to be introduced  into a court of law. To be considered admissible evidence , it must  meet all three of these requirements, as determined by a judge, prior  to being discussed in open court: \nThe evidence must be relevant to determining a fact. \nThe fact that the evidence seeks to determine must be material \n(that is, related) to the case. \nThe evidence must be competent , meaning it must have been  obtained legally. Evidence that results from an illegal search  would be inadmissible because it is not competent. \nTypes of Evidence \nMany different types of evidence can be used in a court of law. \nDepending on the reference you consult, these may be grouped in  many different ways. However, you should be familiar with these  four major categories: real evidence, documentary evidence,  testimonial evidence, and demonstrative evidence. Each has slightly  different additional requirements for admissibility. \nReal Evidence Real evidence (also known as object evidence )  consists of things that may actually be brought into a court of law. In  common criminal proceedings, this may include items such as a  murder weapon, clothing, or other physical objects. In a computer  crime case, real evidence might include seized computer equipment,  such as a keyboard with fingerprints on it or a hard drive from a  malicious actor's computer system. Depending on the circumstances,  real evidence may also be conclusive evidence , such as DNA, that is  incontrovertible. \nDocumentary Evidence Documentary evidence includes any  written items brought into court to prove a fact at hand. This type of  evidence must also be authenticated. For example, if an attorney  wants to introduce a computer log as evidence, they must bring a  witness (for example, the system administrator) into court to testify  that the log was collected as a routine business practice and is indeed  the actual log that the system collected. \nTwo additional evidence rules apply specifically to documentary  evidence: \nThe best evidence rule states that when a document is used as  evidence in a court proceeding, the original document must be  introduced. Copies or descriptions of original evidence (known  as secondary evidence ) will not be accepted as evidence unless  certain exceptions to the rule apply. \nThe parol evidence rule states that when an agreement between  parties is put into written form, the written document is  assumed to contain all the terms of the agreement and no verbal  agreements may modify the written agreement. \nIf documentary evidence meets the materiality, competency, and  relevancy requirements and also complies with the best evidence  and parol evidence rules, it can be admitted into court. \nChain of Evidence \nReal evidence, like any type of evidence, must meet the relevancy,  materiality, and competency requirements before being admitted  into court. Additionally, real evidence must be authenticated. \nThis can be done by a witness who can actually identify an object  as unique (for example, “That knife with my name on the handle  is the one that the intruder took off the table in my house and  used to stab me”) and unaltered, meaning that it has not been  tampered with from the time of collection until the time of use in  court. \nIn many cases, it is not possible for a witness to uniquely identify  an object in court. In those cases, a chain of evidence (also known  as a chain of custody ) must be established. The chain of evidence  documents everyone who handles evidence—including the police  who originally collect it, the evidence technicians who process it,  and the lawyers who use it in court. The location of the evidence  must be fully documented from the moment it was collected to  the moment it appears in court to ensure that it is indeed the  same item. This requires thorough labeling of evidence and  comprehensive logs, noting who had access to the evidence at  specific times and the reasons they required such access. \nWhen evidence is labeled to preserve the chain of custody, the  label should include the following types of information about the  collection: \nGeneral description of the evidence \nTime and date the evidence was collected \nExact location the evidence was collected from \nName of the person collecting the evidence \nRelevant circumstances surrounding the collection \nEach person who handles the evidence must sign the chain of  custody log, indicating the time they took direct responsibility for  the evidence and the time they handed it off to the next person in  the chain of custody. The chain must provide an unbroken  sequence of events accounting for the evidence from the time it  was collected until the time of the trial. \nTestimonial Evidence Testimonial evidence is, quite simply,  evidence consisting of the testimony of a witness, either verbal  testimony in court or written testimony in a recorded deposition. \nWitnesses must take an oath agreeing to tell the truth, and they must  have personal knowledge on which their testimony is based. \nFurthermore, witnesses must remember the basis for their testimony \n(they may consult written notes or records to aid their memory). \nWitnesses can offer direct evidence : oral testimony that proves or  disproves a claim based on their own direct observation. The  testimonial evidence of most witnesses must be strictly limited to  direct evidence based on the witness's factual observations. However,  this does not apply if a witness has been accepted by the court as an  expert in a certain field. In that case, the witness may offer an expert  opinion based on the other facts presented and their personal  knowledge of the field. \nHearsay Rule \nWhen a witness offers testimony in court, they must normally  avoid the act of hearsay, meaning that they cannot testify about  what someone else told them outside of court because the court  has no way to substantiate that evidence and find it admissible. \nThat said, the hearsay rule is one that has many, many  exceptions. These include past testimony given by a witness  under oath that is no longer available, a statement made against  the interest of the person making the statement, a dying  utterance, public records, and many other situations. \nAn extremely important exception to this rule for forensic  analysts is the business records exception to the hearsay rule. \nThis says that business records, such as the logs generated by a  computer system, may be admitted as evidence if they were made  at the time of the event by someone or something with direct  knowledge, that they were kept in the course of regular business  activity, and that keeping those records is a regular practice of the  organization. \nRecords admitted under the business records exception must be  accompanied by the testimony of an individual qualified to show  that these criteria were met. This exception is commonly used to  introduce system logs and other records generated by computer  systems. \nDemonstrative Evidence Demonstrative evidence is evidence  used to support testimonial evidence. It consists of items that may or  may not be admitted into evidence themselves but are used to help a  witness explain a concept or clarify an issue. For example,  demonstrative evidence might include a diagram explaining the  contents of a network packet or showing the process used to conduct  a distributed denial-of-service attack. The admissibility of  demonstrative evidence is a matter left to the trial court with the  general principle that demonstrative evidence must assist the jury in  understanding a case. \nArtifacts, Evidence Collection, and Forensic Procedures \nCollecting digital evidence is a tricky process and should be  attempted only by professional forensic technicians. The \nInternational Organization on Computer Evidence (IOCE) outlines  five principles to guide digital evidence technicians as they perform  media analysis, network analysis, and software analysis in the  pursuit of forensically recovered evidence: \nUpon seizing digital evidence, actions taken should not change  that evidence. \nWhen it is necessary for a person to access original digital  evidence, that person must be forensically competent. \nAll activity relating to the seizure, access, storage, or transfer of  digital evidence must be fully documented, preserved, and  available for review. \nAn individual is responsible for all actions taken with respect to  digital evidence while the digital evidence is in their possession. \nAny agency that is responsible for seizing, accessing, storing, or  transferring digital evidence is responsible for compliance with  these principles. \nAs you conduct forensic evidence collection, it is important to  preserve the original evidence. Remember that the very conduct of  your investigation may alter the evidence you are evaluating. \nTherefore, when analyzing digital evidence, it's best to work with a  copy of the actual evidence whenever possible. For example, when  conducting an investigation into the contents of a hard drive, make  an image of that drive, seal the original drive in an evidence bag, and  then use the disk image for your investigation. \nMedia Analysis Media analysis, a branch of computer forensic  analysis, involves the identification and extraction of information  from storage media. This may include magnetic media (e.g., hard  disks, tapes) or optical media (e.g., CDs, DVDs, Blu-ray discs). \nTechniques used for media analysis may include the recovery of  deleted files from unallocated sectors of the physical disk, the live  analysis of storage media connected to a computer system \n(especially useful when examining encrypted media), and the static  analysis of forensic images of storage media. \nWhen gathering information from storage devices, analysts should  never access hard drives or other media from a live system. Instead,  they should power off the system (after collecting other evidence),  remove the storage device, and then attach the storage device to a  dedicated forensic workstation, using a write blocker . Write  blockers are hardware adapters that physically sever the portion of  the cable used to connect the storage device that would write data to  the device, reducing the likelihood of accidental tampering with the  device. \nAfter connecting the device to a live workstation, the analyst should  immediately calculate a cryptographic hash of the device contents  and then use forensic tools to create a forensic image of the device: a  bitwise copy of the data stored on the device. The analyst should  then compute the cryptographic hash of that image to ensure that it  is identical to the original media contents. \nAfter creating and verifying a forensic image, the original image file  should be preserved as evidence. Analysts should create copies of  that image (verifying the integrity of the hash) and then use those  images for any analysis. This careful process reduces the likelihood  of error and ensures the preservation of the chain of custody. \nIn-Memory Analysis Investigators often wish to collect  information from the memory of live systems. This is a tricky  undertaking, since it can be difficult to work with memory without  actually altering its contents. When gathering the contents of  memory, analysts should use trusted tools to generate a memory  dump file and place it on a forensically prepared device, such as a \nUSB drive. This memory dump file contains all the contents collected  from memory and may then be used for analysis. As with other types  of digital evidence, the analyst collecting the memory dump should  compute a cryptographic hash of the dump file to later prove its  authenticity. The analyst should preserve the original collected dump  and work from copies of that dump file. \nNetwork Analysis Forensic investigators are also often  interested in the activity that took place over the network during a  security incident. This is often difficult to reconstruct due to the  volatility of network data—if it isn't deliberately recorded at the time  it occurs, it generally is not preserved. \nNetwork forensic analysis, therefore, often depends on either prior  knowledge that an incident is under way or the use of preexisting  security controls that log network activity. These include: \nIntrusion detection and prevention system logs \nNetwork flow data captured by a flow monitoring system \nPacket captures deliberately collected during an incident \nLogs from firewalls and other network security devices \nWhen collecting data directly from a network during a live analysis,  forensic technicians should use a SPAN port on a switch (which  mirrors data sent to one or more other ports for analysis) or a  network tap, which is a hardware device that performs the same  function as a SPAN port. Both of these approaches generate packet  dumps without actually altering the network traffic being exchanged  between two systems. In cases where this is not possible, the analyst  may run a software protocol analyzer on one of the communicating  systems, but this approach is not as reliable as using a dedicated  hardware device. \nAfter collecting network packets, they should be treated in the same  manner as any other digital evidence. The tools creating the packet  capture should write them to forensically prepared media. Analysts  should compute cryptographic hashes of the original evidence files  and work only with copies of those original files. \nThe task of the network forensic analyst is to collect and correlate  information from these disparate sources and produce as  comprehensive a picture of network activity as possible. \nSoftware Analysis Forensic analysts may also be called on to  conduct forensic reviews of applications or the activity that takes  place within a running application. In some cases, when malicious  insiders are suspected, the forensic analyst may be asked to conduct  a review of software code, looking for backdoors, logic bombs, or  other security vulnerabilities. For more on these topics, see Chapter \n21, “Malicious Code and Application Attacks.” \nIn other cases, forensic analysts may be asked to review and  interpret the log files from application or database servers, seeking  other signs of malicious activity, such as SQL injection attacks,  privilege escalations, or other application attacks. These are also  discussed in Chapter 21. \nSoftware analysis may also include the validation of file hash values  against known file types. The National Software Reference Library \n(NSRL) maintained by the National Institute of Standards and \nTechnology includes the cryptographic hash values for over 130  million known applications, making it easier for forensic analysts to  detect authentic and manipulated files. For more information on the \nNSRL, see www.nist.gov/itl/ssd/software-quality-  group/national-software-reference-library-nsrl . \nHardware/Embedded Device Analysis Finally, forensic  analysts often must review the contents of hardware and embedded  devices. This may include a review of: \nPersonal computers \nSmartphones \nTablet computers \nEmbedded computers in cars, security systems, and other  devices \nAnalysts conducting these reviews must have specialized knowledge  of the systems under review. An organization may have to call in  expert consultants who are familiar with the memory, storage  systems, and operating systems of such devices. Because of the  complex interactions between software, hardware, and storage, the  discipline of hardware analysis requires skills in both media analysis  and software analysis. \nLocard's Exchange Principle \nLocard's exchange principle is the core principle that underlies  the field of forensic science. The principle is the work of Dr. \nEdmond Locard, one of the pioneers of criminal forensics. Locard  started a criminal forensics lab in Lyon, France, where he  developed the first police laboratory and created many forensics  techniques that are the basis for evidence analysis that is still  performed today. \nLocard's exchange principle, clearly stated, is that “every contact  leaves a trace.” That means that when two objects touch each  other, there will be some evidence left behind. That might be a  fingerprint, a carpet fiber, a drop of blood or spit, a scratch, or  virtually anything else. It then becomes the work of the forensic  scientist to discover those traces and interpret them to learn  more about a crime that took place. \nMost digital forensics experts believe that Locard's principle  applies in the digital world as well. Whenever there is contact  between two digital objects, that contact leaves a trace. It's up to  cybersecurity experts to discover and interpret those traces. \nLet's think about this in the context of an example. Suppose that  an attacker conducts a SQL injection attack against a website. \nThat attack is going to leave evidence in all of the systems that are  touched as part of the attack. Let's think about what some of  those places may be. \nFirst, the attacker used some sort of device to wage the  attack. That might be a laptop or desktop computer, a  smartphone, a virtual server instance, or something else. \nThat device is going to contain some evidence of the attack. \nIt might have logs that show who was logged into the device,  tools that were used in the attack, or the device itself might  have physical fingerprints on it or be in an area covered by a  security camera. \nNext, the attacker was connected to some network. Maybe  they were at home or in an office, or perhaps they waged the  attack from a coffee shop or airport Wi-Fi. The network used  by the attacker will likely have logs that might reveal  important information about the attack. \nThat traffic had to cross through several security devices. \nCertainly, the web server was protected by a network  firewall. It might also be protected by an intrusion  prevention system, a web application firewall, or other  controls. Each of those devices may have identified portions  of the attack and maintained records helpful to the  investigation. Those might be log entries from the successful  attack, or perhaps the attacker tried some other things that  didn't work that created important log entries. \nFrom there, the traffic moved on to the web server hosting  the application that was attacked. That server should have  logging configured that captured the actual requests received  during the attack, and those requests can be used to  reconstruct the commands sent by the attacker through the  web server to the database server. \nThe database server may also have relevant information. If  logging is enabled on that server, you'll see the commands  executed against the database and be able to reconstruct the  attacker's actions. \nThose are a ton of different information sources, and they're all  brought to us by thinking through an attack in the context of \nLocard's exchange principle. If we think about how an attack took  place and remember that every contact leaves a trace, we'll have  plenty of different information sources we can use to piece  together our investigation. \nInvestigation Process \nWhen you initiate a computer security investigation, you should first  assemble a team of competent analysts to assist with the  investigation. This team should operate under the organization's  existing incident response policy and be given a charter that clearly  outlines the scope of the investigation; the authority, roles, and  responsibilities of the investigators; and any rules of engagement  that they must follow while conducting the investigation. These rules  of engagement define and guide the actions that investigators are  authorized to take at different phases of the investigation, such as  calling in law enforcement, interrogating suspects, collecting  evidence, and disrupting system access. \nGathering Evidence \nIt is common to confiscate equipment, software, or data to perform a  proper investigation. The manner in which the evidence is  confiscated is important. The confiscation of evidence must be  carried out in a proper fashion. There are several possible  approaches. \nFirst, the person who owns the evidence could voluntarily surrender  it or grant consent to a search. This method is generally appropriate  only when the attacker is not the owner. Few guilty parties willingly  surrender evidence they know will incriminate them. Less  experienced attackers may believe they have successfully covered  their tracks and voluntarily surrender important evidence. A good  forensic investigator can extract much “covered-up” information  from a computer. In most cases, asking for evidence from a  suspected attacker just alerts the suspect that you are close to taking  legal action. \nIn the case of an internal investigation, you will gather  the vast majority of your information through voluntary  surrender. Most likely, you're conducting the investigation under  the auspices of a senior member of management, who will  authorize you to access any organizational resources necessary to  complete your investigation. \nSecond, you could get a court to issue a subpoena , or court order,  that compels an individual or organization to surrender evidence,  and then have the subpoena served by law enforcement. Again, this  course of action provides sufficient notice for someone to alter the  evidence and render it useless in court. \nThird, a law enforcement officer performing a legally permissible  duty may seize evidence that is visible to the officer in plain view and  where the officer has probable cause to believe that it is associated  with criminal activity. This is known as the plain view doctrine . \nThe fourth option is a search warrant . This option should be used  only when you must have access to evidence without tipping off the  evidence's owner or other personnel. You must have a strong  suspicion with credible reasoning to convince a judge to pursue this  course of action. \nFinally, a law enforcement officer may collect evidence when exigent  circumstances exist. This means that a reasonable person would  believe that the evidence would be destroyed if not immediately  collected or that another emergency exists, such as the risk of  physical harm. When officers enter a premises under exigent  circumstances, they may conduct a warrantless search. \nThese options apply to confiscating equipment both inside and  outside an organization, but there is another step you can take to  ensure that the confiscation of equipment that belongs to your  organization is carried out properly. It is common to have all new  employees sign an agreement that provides consent to search and  seize any necessary evidence during an investigation. In this manner,  consent is provided as a term of the employment agreement. This  makes confiscation much easier and reduces the chances of a loss of  evidence while waiting for legal permission to seize it. Make sure  your security policy addresses this important topic. \nWhen conducting searches in the workplace, an important  consideration is whether the employee has a reasonable expectation  of privacy . Outside of government workplaces, most jurisdictions  have laws or precedents that state that employees do not have an  expectation of privacy under most workplace situations. Employers  generally have the authority to search electronic systems that they  own and operate. The law gets much more nuanced and complex  when searches might violate personal privacy, such as searching an  employee's person or belongings. In cases where this may be  necessary, always consult an attorney to ensure that the search is  done in compliance with all local laws and regulations. \nCalling in Law Enforcement \nOne of the first decisions that must be made in an investigation is  whether law enforcement authorities should be called in. This is a  relatively complicated decision that should involve senior  management officials. There are many factors in favor of calling in  the experts. For example, the FBI runs a nationwide Cyber Division  that serves as a center of excellence for the investigation of  cybercrimes. Additionally, local FBI field offices now have agents  who are specifically trained to handle cybercrime investigations. \nThese agents investigate federal offenses in their region and may also  consult with local law enforcement, upon request. The U.S. Secret \nService has similarly skilled staff in their headquarters and field  offices. \nOn the other hand, two major factors may cause a company to shy  away from calling in the authorities. First, the investigation will more  than likely become public and may embarrass the company. Second,  law enforcement authorities are bound to conduct an investigation  that complies with the Fourth Amendment and other legal  requirements that may not apply if the organization conducted its  own private investigation. \nSearch Warrants \nEven the most casual viewer of American crime television is  familiar with the question, “Do you have a warrant?” The Fourth \nAmendment of the U.S. Constitution outlines the burden placed  on investigators to have a valid search warrant before conducting  certain searches and the legal hurdles they must overcome to  obtain a warrant: \nThe right of the people to be secure in their persons, houses,  papers and effects, against unreasonable searches and  seizures, shall not be violated, and no warrants shall issue,  but upon probable cause, supported by oath or affirmation,  and particularly describing the place to be searched, and the  persons or things to be seized. \nThis amendment contains several important provisions that  guide the activities of law enforcement personnel: \nInvestigators must obtain a warrant before searching a  person's private belongings, assuming that there is a  reasonable expectation of privacy. There are a number of  documented exceptions to this requirement, such as when an  individual consents to a search, the evidence of a crime is in  plain view, or there is a life-threatening emergency  necessitating the search. \nWarrants can be issued only based on probable cause. There  must be some type of evidence that a crime took place and  that the search in question will yield evidence relating to that  crime. The standard of “probable cause” required to get a  warrant is much weaker than the standard of evidence  required to secure a conviction. Most warrants are “sworn  out” based solely on the testimony of investigators. \nWarrants must be specific in their scope. The warrant must  contain a detailed description of the legal bounds of the  search and seizure. \nIf investigators fail to comply with even the smallest detail of  these provisions, they may find their warrant invalidated and the  results of the search deemed inadmissible. This leads to another  one of those American colloquialisms: “They got off on a  technicality.” \nConducting the Investigation \nIf you elect not to call in law enforcement, you should still attempt to  abide by the principles of a sound investigation to ensure the  accuracy and fairness of your inquiry. It is important to remember a  few key principles: \nOther than collecting a memory dump or other live forensic  techniques, never conduct your investigation on an actual  system that was compromised. Take the system offline, make a  backup, and use the backup to investigate the incident. \nNever attempt to “hack back” and avenge a crime. You may  inadvertently attack an innocent third party and find yourself  liable for computer crime charges. \nIf in doubt, call in expert assistance. If you don't want to call in  law enforcement, contact a private investigations firm with  specific experience in the field of computer security  investigations. \nInterviewing Individuals \nDuring the course of an investigation, you may find it necessary to  speak with individuals who might have information relevant to your  investigation. If you seek only to gather information to assist with  your investigation, this is called an interview . If you suspect the  person of involvement in a crime and intend to use the information  gathered in court, this is called an interrogation . \nBefore conducting an interview or interrogation, the interviewer  should carefully plan the topics to be discussed with the subject. It is  helpful to begin with a standard checklist of topics/questions and  then customize that list based on the unique circumstances of the  interview. This helps ensure that all topics are addressed and that  interviews of different subjects are conducted consistently. Of  course, the interviewer must use their own skill and discretion to  conduct the interview in an appropriate manner, which may involve  deviating from the checklist based on the behavior of the subject,  information uncovered during the interview, and other  circumstances. \nInterviewing and interrogating individuals are specialized skills and  should be performed only by trained investigators. Improper  techniques may jeopardize the ability of law enforcement to  successfully prosecute an offender. Additionally, many laws govern  holding or detaining individuals, and you must abide by them if you  plan to conduct private interrogations. Always consult an attorney  before conducting any interviews. \nData Integrity and Retention \nNo matter how persuasive evidence may be, it can be thrown out of  court if you somehow alter it during the evidence collection process. \nMake sure you can prove that you maintained the integrity of all  evidence. But what about the integrity of data before it is collected? \nYou may not detect all incidents as they are happening. Sometimes  an investigation reveals that there were previous incidents that went  undetected. It is discouraging to follow a trail of evidence and find  that a key log file that could point back to an attacker has been  purged. Carefully consider the fate of log files or other possible  evidence locations. A simple archiving policy can help ensure that  key evidence is available upon demand no matter how long ago the  incident occurred. \nBecause many log files can contain valuable evidence, attackers often  attempt to sanitize them after a successful attack. Take steps to  protect the integrity of log files and to deter their modification. One  technique is to implement remote logging, where all systems on the  network send their log records to a centralized log server that is  locked down against attack and does not allow for the modification  of data. This technique provides protection from postincident log file  cleansing. Administrators also often use digital signatures to prove  that log files were not tampered with after initial capture. For more  on digital signatures, see Chapter 7, “PKI and Cryptographic \nApplications.” \nAs with every aspect of security planning, there is no single solution. \nGet familiar with your system, and take the steps that make the most  sense for your organization to protect it. \nReporting and Documenting Investigations \nEvery investigation you conduct should result in a final report that  documents the goals of the investigation, the procedures followed,  the evidence collected, and the final results of the investigation. The  degree of formality behind this report will vary based on the  organization's policy and procedures, as well as the nature of the  investigation. \nPreparing formal documentation is important because it lays the  foundation for escalation and potential legal action. You may not  know when an investigation begins (or even after it concludes) that it  will be the subject of legal action, but you should prepare for that  eventuality. Even internal investigations into administrative matters  may become part of an employment dispute or other legal action. \nThe use of standard procedures and checklists for the collection and  documentation of evidence helps ensure that evidence is collected in  a manner that will be admissible down the road. Organizations  should also ensure that anyone involved in the collection or analysis  of potential evidence receives proper training. \nIt's a good idea to establish a relationship with your corporate legal  personnel and the appropriate law enforcement agencies. Find out  who the appropriate law enforcement contacts are for your  organization and talk with them. When the time comes to report an  incident, your efforts at establishing a prior working relationship will  pay off. You will spend far less time in introductions and  explanations if you already know the person with whom you are  talking. It is a good idea to identify, in advance, a single point of  contact in your organization who will act as your liaison with law  enforcement. This provides two benefits. First, it ensures that law  enforcement hears a single perspective from your organization and  knows the “go-to” person for updates. Second, it allows the  predesignated contact to develop working relationships with law  enforcement personnel. \nOne great way to establish technical contacts with  law enforcement is to participate in the FBI's InfraGard program. \nInfraGard exists in most major metropolitan areas in the United \nStates and provides a forum for law enforcement and business  security professionals to share information in a closed  environment. For more information, visit www.infragard.org . \nMajor Categories of Computer Crime \nThere are many ways to attack a computer system and many  motivations to do so. Information system security practitioners  generally put crimes against or involving computers into different  categories. Simply put, a computer crime is a crime (or violation of a  law or regulation) that involves a computer. The crime could be  against the computer, or the computer could have been used in the  actual commission of the crime. Each of the categories of computer  crimes represents the purpose of an attack and its intended result. \nAny individual who violates one or more of your security policies is  considered to be an attacker . An attacker uses different techniques  to achieve a specific goal. Understanding the goals helps clarify the  different types of attacks. Remember that crime is crime, and the  motivations behind computer crime are no different from the  motivations behind any other type of crime. The only real difference  may be in the methods the attacker uses to strike. \nComputer crimes are generally classified as one of the following  types: \nMilitary and intelligence attacks \nBusiness attacks \nFinancial attacks \nTerrorist attacks \nGrudge attacks \nThrill attacks \nHacktivist attacks \nIt is important to understand the differences among the categories of  computer crime to best understand how to protect a system and  react when an attack occurs. The type and amount of evidence left by  an attacker is often dependent on their expertise. In the following  sections, we'll discuss the different categories of computer crimes  and the types of evidence you might find after an attack. This  evidence can help you determine the attacker's actions and intended  target. You may find that your system was only a link in the chain of  network hops used to reach the real victim, making the trail harder  to follow back to the true attacker. \nMilitary and Intelligence Attacks \nMilitary and intelligence attacks are launched primarily to obtain  secret and restricted information from law enforcement or military  and technological research sources. The disclosure of such  information could compromise investigations, disrupt military  planning, and threaten national security. Attacks to gather military  information or other sensitive intelligence often precede other, more  damaging attacks. \nAn attacker may be looking for the following kinds of information: \nMilitary descriptive information of any type, including  deployment information, readiness information, and order of  battle plans \nSecret intelligence gathered for military or law enforcement  purposes \nDescriptions and storage locations of evidence obtained in a  criminal investigation \nAny secret information that could be used in a later attack \nBecause of the sensitive nature of information collected and used by  the military and intelligence agencies, their computer systems are  often attractive targets for experienced attackers. To protect from  more numerous and more sophisticated attackers, you will generally  find more formal security policies in place on systems that house  such information. As you learned in Chapter 1, “Security Governance \nThrough Principles and Policies,” data can be classified according to  sensitivity and stored on systems that support the required level of  security. It is common to find stringent perimeter security as well as  internal controls to limit access to classified documents on military  and intelligence agency systems. \nYou can be sure that serious attacks to acquire military or  intelligence information are carried out by professionals. \nProfessional attackers are generally very thorough in covering their  tracks. There is usually little evidence to collect after such an attack. \nAttackers in this category are the most successful and the most  satisfied when no one is aware that an attack occurred. \nAdvanced Persistent Threats \nRecent years have marked the rise of sophisticated attacks known  as advanced persistent threats (APTs). The attackers are well  funded and have advanced technical skills and resources. They  act on behalf of a nation-state, organized crime, terrorist group,  or other sponsor and wage highly effective attacks against a very  focused target. \nBusiness Attacks \nBusiness attacks focus on illegally jeopardizing the confidentiality,  integrity, or availability of information and systems operated by a  business. \nFor example, an attacker might focus on obtaining an organization's  confidential information. This could be information that is critical to  the operation of the organization, such as a secret recipe, or  information that could damage the organization's reputation if  disclosed, such as personal information about its employees. The  gathering of a competitor's confidential intellectual property, also  called corporate espionage or industrial espionage , is not a new  phenomenon. Businesses have used illegal means to acquire  competitive information for many years. Perhaps what has changed  is the source of the espionage, as state-sponsored espionage has  become a significant threat. The temptation to steal a competitor's  trade secrets and the ease with which a savvy attacker can  compromise some computer systems makes this type of attack  attractive. \nThe goal of these attacks may be solely to extract confidential  information. The use of the information gathered during the attack  usually causes more damage than the attack itself. A business that  has suffered an attack of this type can be put into a position from  which it might not ever recover. \nOther attacks may focus on integrity and/or availability of  information. For example, although ransomware attacks may  jeopardize the confidentiality of information, their primary purpose  is to disrupt availability, preventing the target from accessing their  own data and forcing the payment of a ransom to restore access. \nFinancial Attacks \nFinancial attacks are carried out to unlawfully obtain money or  services. They are the type of computer crime you most commonly  hear about in the news. The goal of a financial attack could be to steal  credit card numbers, increase the balance in a bank account, or  obtain fraudulent funds transfers. \nShoplifting and burglary are both examples of financial attacks. You  can usually tell the sophistication of the attacker by the dollar  amount of the damages. Less sophisticated attackers seek easier  targets, but although the damages are usually minimal, they can add  up over time. \nFinancial attacks launched by sophisticated attackers can result in  substantial damages. Even attacks that siphon off small amounts of  money in each transaction can accumulate and become serious  financial attacks that result in losses amounting to millions of  dollars. As with the attacks previously described, the ease with which  you can detect an attack and track an attacker is largely dependent  on the attacker's skill level. \nFinancial attacks may also take the form of cybercrime for hire ,  where the attacker engages in mercenary activity, conducting  cyberattacks against targets for their clients. One of the most  common examples of this type of attack is in the conduct of  distributed denial-of-service (DDoS) attacks. Attackers have  assembled large botnets of systems they then lease out to customers  for use in DDoS attacks. Here, the attacker actually has no  motivation other than receiving money from the customer, who has  some other motivation for the attack. \nTerrorist Attacks \nTerrorist attacks are a reality in modern society. Our increasing  reliance on information systems makes them more and more  attractive to terrorists. Such attacks differ from military and  intelligence attacks. The purpose of a terrorist attack is to disrupt  normal life and instill fear, whereas a military or intelligence attack  is designed to extract secret information. Intelligence gathering  generally precedes any type of terrorist attack. The very systems that  are victims of a terrorist attack were probably compromised in an  earlier attack to collect intelligence. The more diligent you are in  detecting attacks of any type, the better prepared you will be to  intervene before more serious attacks occur. \nPossible targets of a computer terrorist attack could be systems that  regulate power plants or control telecommunications or power  distribution. Many such control and regulatory systems are  computerized and vulnerable to terrorist action. In fact, the  possibility exists of a simultaneous physical and computerized  terrorist attack. Our ability to respond to such an attack would be  greatly diminished if the physical attack were simultaneously  launched with a computer attack designed to knock out power and  communications. \nMost large power and communications companies have dedicated a  security staff to ensure the security of their systems, but many  smaller businesses that have systems connected to the Internet are  more vulnerable to attacks. You must diligently monitor your  systems to identify any attacks and then respond swiftly when an  attack is discovered. \nGrudge Attacks \nGrudge attacks are attacks that are carried out to damage an  organization or a person. The damage could be in the loss of  information or information processing capabilities or harm to the  organization or a person's reputation. The motivation behind a  grudge attack is usually a feeling of resentment, and the attacker  could be a current or former employee or someone who wishes ill  will upon an organization. The attacker is disgruntled with the victim  and takes out their frustration in the form of a grudge attack. \nAn employee who has recently been fired is a prime example of a  person who might carry out a grudge attack to “get back” at the  organization. Another example is a person who has been rejected in a  personal relationship with another employee. The person who has  been rejected might launch an attack to destroy data on the victim's  system. \nThe Insider Threat \nIt's common for security professionals to focus on the threat from  outside an organization. Indeed, many of our security  technologies are designed to keep unauthorized individuals out. \nWe often don't pay enough (or much!) attention to protecting our  organizations against the malicious insider, even though they  often pose the greatest risk to our computing assets. \nOne of the authors of this book had a consulting engagement with  a medium-sized subsidiary of a large, well-known corporation. \nThe company had suffered a serious security breach, involving  the theft of thousands of dollars and the deliberate destruction of  sensitive corporate information. The IT leaders in the  organization needed someone to work with them to diagnose the  cause of the event and protect themselves against similar events  in the future. \nAfter only a very small amount of digging, it became apparent  that they were dealing with an insider attack. The intruder's  actions demonstrated knowledge of the company's IT  infrastructure as well as an understanding of which data was  most important to the company's ongoing operations. \nAdditional investigation revealed that the culprit was a former  employee who ended his employment with the firm on less-than-  favorable terms. He left the building with a chip on his shoulder  and an ax to grind. Unfortunately, he was a system administrator  with a wide range of access to corporate systems, and the  company had an immature deprovisioning process that failed to  remove all of his access upon his termination. He simply found  several accounts that remained active and used them to access  the corporate network through a VPN. \nThe moral of this story? Don't underestimate the insider threat. \nTake the time to evaluate your controls to mitigate the risk that  malicious current and former employees pose to your  organization. \nIt's also important to understand that not all insider attacks are  malicious in origin. Employees with privileged access to systems  may make errors that jeopardize security and unintentionally  enable an external attacker to carry out a malicious attack. \nYour security policy should address the potential of insider  attacks. For example, as soon as an employee is terminated, all  system access for that employee should be terminated. This  action reduces the likelihood of a grudge attack and removes  unused access accounts that could be used in future attacks. \nAlthough most grudge attackers are just disgruntled people with  limited attacking and cracking abilities, some possess the skills to  cause substantial damage. An unhappy cracker can be a handful for  security professionals. Take extreme care when a person with known  cracking ability leaves your company. At the least, you should  perform a vulnerability assessment of all systems the person could  access. You may be surprised to find one or more “backdoors” left in  the system. (For more on backdoors, see Chapter 21.) But even in the  absence of any backdoors, a former employee who is familiar with  the technical architecture of the organization may know how to  exploit its weaknesses. \nGrudge attacks can be devastating if allowed to occur unchecked. \nDiligent monitoring and assessing systems for vulnerabilities is the  best protection from most grudge attacks. \nThrill Attacks \nThrill attacks are the attacks launched only for the fun of it. \nAttackers who lack the ability to devise their own attacks will often  download programs that do their work for them. These attackers are  often called script kiddies because they run only other people's  programs, or scripts, to launch an attack. \nThe main motivation behind these attacks is the “high” of  successfully breaking into a system. If you are the victim of a thrill  attack, the most common fate you will suffer is a service interruption. \nAlthough an attacker of this type may destroy data, the main  motivation is to compromise a system and perhaps use it to launch  an attack against another victim. \nOne common type of thrill attack involves website defacements,  where the attacker compromises a web server and replaces an  organization's legitimate web content with other pages, often  boasting about the attacker's skills. For example, attackers launched  a series of automated website defacement attacks in 2017 that  exploited a vulnerability in the widely used WordPress web  publishing platform. Those attacks managed to deface more than 1.8  million web pages in one week. \nHacktivists \nRecently, the world has seen a rise in the field of “hacktivism.” These  attackers, known as hacktivists (a combination of hacker and  activist ), often combine political motivations with the thrill of  hacking. They organize themselves loosely into groups with names  like Anonymous and LulzSec and use automated tools to create  large-scale DoS attacks with little knowledge required. Their purpose  is to disrupt the activity of organizations that they differ with  philosophically. \nEthics \nSecurity professionals hold themselves and each other to a high  standard of conduct because of the sensitive positions of trust they  occupy. The rules that govern personal conduct are collectively  known as rules of ethics . They are the moral codes and rules of  personal behavior that guide our day-to-day activities in any realm. \nIn the world of business, ethics describe how a business should  govern itself to ensure that its actions are appropriate and just. \nBusiness ethics cover a wide variety of topics, including financial  dealings, conflicts of interest, nondiscrimination, and social  responsibility. \nIn the world of cybersecurity, ethical codes guide the conduct of  cybersecurity professionals to ensure that they act in a manner that  is responsible and just. Several organizations have recognized the  need for standard ethics rules, or codes, and have devised guidelines  for ethical behavior. \nWe present several codes of ethics in the following sections. These  rules are not laws—they are minimum standards for professional  behavior. They should provide you with a basis for sound, ethical  judgment. We expect all security professionals to abide by these  guidelines regardless of their area of specialty or employer. Make  sure you understand and agree with the codes of ethics outlined in  the following sections. \nOrganizational Code of Ethics \nAlmost every organization has its own code of ethics that is  published to employees to help guide their everyday work. These  may come in the form of an official ethics statement, or they may be  embodied in the policies and procedures that the organization uses  to carry out routine business activities. \nIn cases where an ethical code is published as a separate statement,  it is usually high-level, designed to provide general guidance and  direction rather than address specific situations. The organizational  code of ethics may be supplemented by other policies and rules that  provide detailed guidance on specific issues. \nFor example, the U.S. government has a Code of Ethics for \nGovernment Service that is written into federal law. Passed by \nCongress in 1980, this code says that any person in government  service should: \nPut loyalty to the highest moral principles and to country above  loyalty to persons, party, or Government department. \nUphold the Constitution, laws, and regulations of the United \nStates and of all governments therein and never be a party to  their evasion. \nGive a full day's labor for a full day's pay; giving earnest effort  and best thought to the performance of duties. \nSeek to find and employ more efficient and economical ways of  getting tasks accomplished. \nNever discriminate unfairly by the dispensing of special favors  or privileges to anyone, whether for remuneration or not; and  never accept, for himself or herself or for family members,  favors or benefits under circumstances which might be  construed by reasonable persons as influencing the performance  of governmental duties. \nMake no private promises of any kind binding upon the duties of  office, since a Government employee has no private word which  can be binding on public duty. \nEngage in no business with the Government, either directly or  indirectly, which is inconsistent with the conscientious  performance of governmental duties. \nNever use any information gained confidentially in the  performance of governmental duties as a means of making  private profit. \nExpose corruption wherever discovered. \nUphold these principles, ever conscious that public office is a  public trust. \nISC2 Code of Professional Ethics \nThe governing body that administers the CISSP certification is the \nInternational Information System Security Certification Consortium,  or ISC2. The ISC2 Code of Ethics was developed to provide the basis  for CISSP behavior. It is a simple code with a preamble and four  canons. The following is a short summary of the major concepts of  the Code of Ethics. \nAll CISSP candidates should be familiar with the entire \nISC2 Code of Ethics because they have to sign an agreement that  they will adhere to this code. We won't cover the code in depth,  but you can find further details about the ISC2's Code of Ethics at  www.isc2.org/ethics . You need to visit this site and read the  entire code. \nCode of Ethics Preamble \nThe Code of Ethics preamble is as follows: \nThe safety and welfare of society and the common good, duty to  our principals, and to each other, requires that we adhere, and  be seen to adhere, to the highest ethical standards of behavior. \nTherefore, strict adherence to this Code is a condition of  certification. \nCode of Ethics Canons \nThe Code of Ethics ( www.isc2.org/Ethics ) includes the following  canons: \nI. Protect society, the common good, necessary public trust and  confidence, and the infrastructure . Security professionals have  great social responsibility. We are charged with the burden of  ensuring that our actions benefit the common good. \nII. Act honorably, honestly, justly, responsibly, and legally . \nIntegrity is essential to the conduct of our duties. We cannot  carry out our duties effectively if others within our organization,  the security community, or the general public have doubts about  the accuracy of the guidance we provide or the motives behind  our actions. \nIII. Provide diligent and competent service to principals . Although  we have responsibilities to society as a whole, we also have  specific responsibilities to those who have hired us to protect  their infrastructure. We must ensure that we are in a position to  provide unbiased, competent service to our organization. \nIV. Advance and protect the profession . Our chosen profession  changes on a continuous basis. As security professionals, we  must ensure that our knowledge remains current and that we  contribute our own knowledge to the community's common  body of knowledge. \nCode of Ethics Complaints \nISC2 members who encounter a potential violation of the Code of \nEthics may report the possible violation to ISC2 for investigation by  filing a formal ethics complaint. This complaint must identify the  specific canon of the Code of Ethics that the member believes has  been violated. Furthermore, complaints are only accepted from those  who believe they have been injured by the alleged behavior. This  personal injury provides standing to file a complaint and is  determined based on the canon involved: \nAny member of the general public may file a complaint involving \nCanon I or II. \nOnly an employer or someone with a contracting relationship  with the individual may file a complaint under Canon III. \nOther professionals may file a complaint under Canon IV. It is  important to note that this is not limited to cybersecurity  professionals. Anyone who is certified or licensed as a  professional and subscribes to a code of ethics as part of that  licensure or certification is eligible to file a Canon IV complaint. \nComplaints under the Code of Ethics must be in writing and in the  form of a sworn affidavit. When ISC2 receives a properly submitted  complaint, they will undertake a formal investigation. For more  information on the complaint and investigation process, see  www.isc2.org/Ethics . Violations of the Code of Ethics may be  punished by sanctions up to and including the revocation of an  individual's certification. \nEthics and the Internet \nA variety of ethical frameworks also exist to help guide digital  activities. These codes are not binding on any particular organization  but are useful references for ethical decision-making. \nRFC 1087 \nIn January 1989, the Internet Architecture Board (IAB) recognized  that the Internet was rapidly expanding beyond the initial trusted  community that created it. Understanding that misuse could occur as  the Internet grew, IAB issued a statement of policy concerning the  proper use of the Internet. The contents of this statement are valid  even today. It is important that you know the basic contents of the  document, titled “Ethics and the Internet,” request for comments \n(RFC) 1087, because most codes of ethics can trace their roots back  to this document. \nThe statement is a brief list of practices considered unethical. \nWhereas a code of ethics states what you should do, this document  outlines what you should not do. RFC 1087 states that any activity  with the following purposes is unacceptable and unethical: \nSeeks to gain unauthorized access to the resources of the \nInternet \nDisrupts the intended use of the Internet \nWastes resources (people, capacity, computer) through such  actions \nDestroys the integrity of computer-based information \nCompromises the privacy of users \nTen Commandments of Computer Ethics \nThe Computer Ethics Institute created its own code of ethics \n( http://cpsr.org/issues/ethics/cei ). The Ten Commandments of \nComputer Ethics are as follows: \n1. Thou shalt not use a computer to harm other people. \n2. Thou shalt not interfere with other people's computer work. \n3. Thou shalt not snoop around in other people's computer files. \n4. Thou shalt not use a computer to steal. \n5. Thou shalt not use a computer to bear false witness. \n6. Thou shalt not copy or use proprietary software for which you  have not paid. \n7. Thou shalt not use other people's computer resources without  authorization or proper compensation. \n8. Thou shalt not appropriate other people's intellectual output. \n9. Thou shalt think about the social consequences of the program  you are writing or the system you are designing. \n10. Thou shalt always use a computer in ways that ensure  consideration and respect for your fellow humans. \nCode of Fair Information Practices \nAnother formative document that guides many ethical decision-  making efforts is the Code of Fair Information Practices, developed  by a government advisory committee in 1973. This code outlines five  principles for handling personal information in an ethical and  responsible manner: \n1. There must be no personal data record-keeping systems whose  very existence is secret. \n2. There must be a way for a person to find out what information  about the person is in a record and how it is used. \n3. There must be a way for a person to prevent information about  the person that was obtained for one purpose from being used or  made available for other purposes without the person's consent. \n4. There must be a way for a person to correct or amend a record of  identifiable information about the person. \n5. Any organization creating, maintaining, using, or disseminating  records of identifiable personal data must assure the reliability  of the data for their intended use and must take precautions to  prevent misuses of the data. \nSummary \nInformation security professionals must be familiar with the  investigation process. This involves gathering and analyzing the  evidence required to conduct an investigation. Security professionals  should be familiar with the major categories of evidence, including  real evidence, documentary evidence, and testimonial evidence. \nElectronic evidence is often gathered through the analysis of  hardware, software, storage media, and networks. It is essential to  gather evidence using appropriate procedures that do not alter the  original evidence and preserve the chain of custody. \nComputer crimes are grouped into several major categories, and the  crimes in each category share common motivations and desired  results. Understanding what an attacker is after can help in properly  securing a system. \nFor example, military and intelligence attacks are launched to  acquire secret information that could not be obtained legally. \nBusiness attacks are similar except that they target civilian systems. \nOther types of attacks include financial attacks and terrorist attacks \n(which, in the context of computer crimes, are attacks designed to  disrupt normal life). There are also grudge attacks, the purpose of  which is to cause damage by destroying data or using information to  embarrass an organization or person, and thrill attacks, launched by  inexperienced crackers to compromise or disable a system. Although  generally not sophisticated, thrill attacks can be annoying and costly. \nFinally, hacktivists take their potentially sophisticated skills and  apply them to issues where they have a political interest. \nThe set of rules that govern your personal behavior is a code of  ethics. There are several codes of ethics, from general to specific in  nature, that security professionals can use to guide them. ISC2  makes the acceptance of its Code of Ethics a requirement for  certification. \nStudy Essentials \nKnow the definition of computer crime. Computer crime is a  crime (or violation of a law or regulation) that is directed against, or  directly involves, a computer. \nBe able to list and explain the six categories of computer  crimes. Computer crimes are grouped into seven categories:  military and intelligence attack, business attack, financial attack,  terrorist attack, grudge attack, thrill attack, and hacktivist attack. Be  able to explain the motive of each type of attack. \nKnow the importance of collecting evidence. As soon you  discover an incident, you must begin to collect evidence and as much  information about the incident as possible. The evidence can be used  in a subsequent legal action or in finding the identity of the attacker. \nEvidence can also assist you in determining the extent of damage. \nUnderstand the eDiscovery process. Organizations that  believe they will be the target of a lawsuit have a duty to preserve  digital evidence in a process known as electronic discovery, or  eDiscovery. The eDiscovery process includes information  governance, identification, preservation, collection, processing,  review, analysis, production, and presentation activities. \nKnow how to investigate intrusions and how to gather  sufficient artifacts from the equipment, software, and  data. You must have possession of equipment, software, or data to  analyze it and use it as evidence. You must acquire the evidence  without modifying it or allowing anyone else to modify it. \nKnow the basic alternatives for confiscating evidence and  when each one is appropriate. First, the person who owns the  evidence could voluntarily surrender it. Second, a subpoena could be  used to compel the subject to surrender the evidence. Third, a law  enforcement officer performing a legally permissible duty may seize  visible evidence that the officer has probable cause to believe is  associated with criminal activity. Fourth, a search warrant is most  useful when you need to confiscate evidence without giving the  subject an opportunity to alter it. Fifth, a law enforcement officer  may collect evidence when exigent circumstances exist. \nKnow the importance of retaining investigatory data. \nBecause you will discover some incidents after they have occurred,  you will lose valuable evidence unless you ensure that critical log files  are retained for a reasonable period of time. You can retain log files  and system status information either in place or in archives. \nKnow the basic requirements for evidence to be admissible  in a court of law. To be admissible, evidence must be relevant to  a fact at issue in the case, the fact must be material to the case, and  the evidence must be competent or legally collected. \nExplain the various types of evidence that may be used in a  criminal or civil trial. Real evidence consists of actual objects  that can be brought into the courtroom. Documentary evidence  consists of written documents that provide insight into the facts. \nTestimonial evidence consists of verbal or written statements made  by witnesses. \nUnderstand the importance of ethics to security  personnel. Security practitioners are granted a very high level of  authority and responsibility to execute their job functions. The  potential for abuse exists, and without a strict code of personal  behavior, security practitioners could be regarded as having  unchecked power. Adherence to a code of ethics helps ensure that  such power is not abused. Security professionals must subscribe to  both their own organization's code of ethics as well as the ISC2 Code  of Ethics. \nKnow the ISC2 Code of Ethics and RFC 1087, Ethics and the \nInternet. All CISSP candidates should be familiar with the entire \nISC2 Code of Ethics because they have to sign an agreement that  they will adhere to it. In addition, be familiar with the basic  statements of RFC 1087. \nWritten Lab \n1. What are the major categories of computer crime? \n2. What is the main motivation behind a thrill attack? \n3. What is the difference between an interview and an  interrogation? \n4. What are the three basic requirements that evidence must meet  in order to be admissible in court? \nReview Questions \n1. Devin is revising the policies and procedures used by his  organization to conduct investigations and would like to include  a definition of computer crime. Which one of the following  definitions would best meet his needs? \nA. Any attack specifically listed in your security policy \nB. Any illegal attack that compromises a protected computer \nC. Any violation of a law or regulation that involves a  computer \nD. Failure to practice due diligence in computer security \n2. What is the main purpose of a military and intelligence attack? \nA. To attack the availability of military systems \nB. To obtain secret and restricted information from military or  law enforcement sources \nC. To utilize military or intelligence agency systems to attack  other nonmilitary sites \nD. To compromise military systems for use in attacks against  other systems \n3. Which of the following is not a canon of the ISC2 Code of \nEthics? \nA. Protect your colleagues. \nB. Provide diligent and competent service to principals. \nC. Advance and protect the profession. \nD. Protect society. \n4. Which of the following is not an example of a financially  motivated attack? \nA. Accessing services that you have not purchased \nB. Disclosing confidential personal employee information \nC. Transferring funds from an unapproved source into your  account \nD. Selling a botnet for use in a DDoS attack \n5. Which one of the following attacker actions is most indicative of  a terrorist attack? \nA. Altering sensitive trade secret documents \nB. Damaging the ability to communicate and respond to a  physical attack \nC. Stealing unclassified information \nD. Transferring funds to other countries \n6. Which of the following would not be a primary goal of a grudge  attack? \nA. Disclosing embarrassing personal information \nB. Launching a virus on an organization's system \nC. Sending inappropriate email with a spoofed origination  address of the victim organization \nD. Using automated tools to scan the organization's systems  for vulnerable ports \n7. What are the primary reasons attackers engage in thrill attacks? \n(Choose all that apply.) \nA. Bragging rights \nB. Money from the sale of stolen documents \nC. Pride of conquering a secure system \nD. Retaliation against a person or organization \n8. What is the most important rule to follow when collecting  evidence? \nA. Do not turn off a computer until you photograph the screen. \nB. List all people present while collecting evidence. \nC. Avoid the modification of evidence during the collection  process. \nD. Transfer all equipment to a secure storage location. \n9. What would be a valid argument for not immediately removing  power from a machine when an incident is discovered? \nA. All of the damage has been done. Turning the machine off  would not stop additional damage. \nB. There is no other system that can replace this one if it is  turned off. \nC. Too many users are logged in and using the system. \nD. Valuable evidence in memory will be lost. \n10. What type of evidence refers to written documents that are  brought into court to prove a fact? \nA. Best evidence \nB. Parol evidence \nC. Documentary evidence \nD. Testimonial evidence \n11. Which one of the following investigation types has the highest  standard of evidence? \nA. Administrative \nB. Civil \nC. Criminal \nD. Regulatory \n12. During an operational investigation, what type of analysis might  an organization undertake to prevent similar incidents in the  future? \nA. Forensic analysis \nB. Root cause analysis \nC. Network traffic analysis \nD. Fagan analysis \n13. What step of the Electronic Discovery Reference Model ensures  that information that may be subject to discovery is not altered? \nA. Preservation \nB. Production \nC. Processing \nD. Presentation \n14. Gary is a system administrator and is testifying in court about a  cybercrime incident. He brings server logs to support his  testimony. What type of evidence are the server logs? \nA. Real evidence \nB. Documentary evidence \nC. Parol evidence \nD. Testimonial evidence \n15. You are a law enforcement officer and you need to confiscate a \nPC from a suspected attacker who does not work for your  organization. You are concerned that if you approach the  individual, they may destroy evidence. What legal avenue is  most appropriate? \nA. Consent agreement signed by employees \nB. Search warrant \nC. No legal avenue is necessary. \nD. Voluntary consent \n16. Gavin is considering altering his organization's log retention  policy to delete logs at the end of each day. What is the most  important reason that he should avoid this approach? \nA. An incident may not be discovered for several days and  valuable evidence could be lost. \nB. Disk space is cheap, and log files are used frequently. \nC. Log files are protected and cannot be altered. \nD. Any information in a log file is useless after it is several  hours old. \n17. What phase of the Electronic Discovery Reference Model  examines information to remove information subject to  attorney-client privilege? \nA. Identification \nB. Collection \nC. Processing \nD. Review \n18. What are ethics? \nA. Mandatory actions required to fulfill job requirements \nB. Laws of professional conduct \nC. Regulations set forth by a professional organization \nD. Rules of personal behavior \n19. According to the ISC2 Code of Ethics, how are CISSPs expected  to act? \nA. Honestly, diligently, responsibly, and legally \nB. Honorably, honestly, justly, responsibly, and legally \nC. Upholding the security policy and protecting the  organization \nD. Trustworthy, loyally, friendly, courteously \n20. Which of the following actions are considered unacceptable and  unethical according to RFC 1087, “Ethics and the Internet”? \nA. Actions that compromise the privacy of classified  information \nB. Actions that compromise the privacy of users \nC. Actions that disrupt organizational activities \nD. Actions in which a computer is used in a manner  inconsistent with a stated security policy ",
  "elements": {
    "summaries": [
      "Information security professionals must be familiar with the investigation process. This involves gathering and analyzing the evidence required to conduct an investigation. Security professionals should be familiar with the major categories of evidence, including real evidence, documentary evidence, and testimonial evidence. Electronic evidence is often gathered through the analysis of hardware, software, storage media, and networks. It is essential to gather evidence using appropriate procedures that do not alter the original evidence and preserve the chain of custody. Computer crimes are grouped into several major categories, and the crimes in each category share common motivations and desired results. Understanding what an attacker is after can help in properly securing a system. For example, military and intelligence attacks are launched to acquire secret information that could not be obtained legally. Business attacks are similar except that they target civilian systems. Other types of attacks include financial attacks and terrorist attacks (which, in the context of computer crimes, are attacks designed to disrupt normal life). There are also grudge attacks, the purpose of which is to cause damage by destroying data or using information to embarrass an organization or person, and thrill attacks, launched by inexperienced crackers to compromise or disable a system. Although generally not sophisticated, thrill attacks can be annoying and costly. Finally, hacktivists take their potentially sophisticated skills and apply them to issues where they have a political interest. The set of rules that govern your personal behavior is a code of ethics. There are several codes of ethics, from general to specific in nature, that security professionals can use to guide them. ISC2 makes the acceptance of its Code of Ethics a requirement for certification. Study Essentials Know the definition of computer crime. Computer crime is a crime (or violation of a law or regulation) that is directed against, or directly involves, a computer. Be able to list and explain the six categories of computer crimes. Computer crimes are grouped into seven categories: military and intelligence attack, business attack, financial attack, terrorist attack, grudge attack, thrill attack, and hacktivist attack. Be able to explain the motive of each type of attack. Know the importance of collecting evidence. As soon you discover an incident, you must begin to collect evidence and as much information about the incident as possible. The evidence can be used in a subsequent legal action or in finding the identity of the attacker. Evidence can also assist you in determining the extent of damage. Understand the eDiscovery process. Organizations that believe they will be the target of a lawsuit have a duty to preserve digital evidence in a process known as electronic discovery, or eDiscovery. The eDiscovery process includes information governance, identification, preservation, collection, processing, review, analysis, production, and presentation activities. Know how to investigate intrusions and how to gather sufficient artifacts from the equipment, software, and data. You must have possession of equipment, software, or data to analyze it and use it as evidence. You must acquire the evidence without modifying it or allowing anyone else to modify it. Know the basic alternatives for confiscating evidence and when each one is appropriate. First, the person who owns the evidence could voluntarily surrender it. Second, a subpoena could be used to compel the subject to surrender the evidence. Third, a law enforcement officer performing a legally permissible duty may seize visible evidence that the officer has probable cause to believe is associated with criminal activity. Fourth, a search warrant is most useful when you need to confiscate evidence without giving the subject an opportunity to alter it. Fifth, a law enforcement officer may collect evidence when exigent circumstances exist. Know the importance of retaining investigatory data. Because you will discover some incidents after they have occurred, you will lose valuable evidence unless you ensure that critical log files are retained for a reasonable period of time. You can retain log files and system status information either in place or in archives. Know the basic requirements for evidence to be admissible in a court of law. To be admissible, evidence must be relevant to a fact at issue in the case, the fact must be material to the case, and the evidence must be competent or legally collected. Explain the various types of evidence that may be used in a criminal or civil trial. Real evidence consists of actual objects that can be brought into the courtroom. Documentary evidence consists of written documents that provide insight into the facts. Testimonial evidence consists of verbal or written statements made by witnesses. Understand the importance of ethics to security personnel. Security practitioners are granted a very high level of authority and responsibility to execute their job functions. The potential for abuse exists, and without a strict code of personal behavior, security practitioners could be regarded as having unchecked power. Adherence to a code of ethics helps ensure that such power is not abused. Security professionals must subscribe to both their own organization's code of ethics as well as the ISC2 Code of Ethics. Know the ISC2 Code of Ethics and RFC 1087, Ethics and the Internet. All CISSP candidates should be familiar with the entire ISC2 Code of Ethics because they have to sign an agreement that they will adhere to it. In addition, be familiar with the basic statements of RFC 1087."
    ],
    "reviewQuestions": [],
    "writtenLabs": []
  }
}